----- AUTO GENERATED - DO NOT EDIT

if GetLocale() ~= "koKR" then
    return
end

loadstring([[
BtWQuestsDatabase:UpdateNPCsTable({
    [235386] = {
        name = "마법학자 엄브릭",
    },
    [235389] = {
        name = "알레리아 윈드러너",
    },
    [235394] = {
        name = "로스락시온",
    },
    [235405] = {
        name = "마법학자 엄브릭",
    },
    [235411] = {
        name = "마법학자 엄브릭",
    },
    [235469] = {
        name = "아라토르",
    },
    [235486] = {
        name = "로스락시온",
    },
    [235502] = {
        name = "알레리아 윈드러너",
    },
    [235503] = {
        name = "아라토르",
    },
    [235504] = {
        name = "로스락시온",
    },
    [235522] = {
        name = "로스락시온",
    },
    [235530] = {
        name = "로스락시온",
    },
    [235532] = {
        name = "알레리아 윈드러너",
    },
    [235535] = {
        name = "로스락시온",
    },
    [235606] = {
        name = "로스락시온",
    },
    [235633] = {
        name = "데시무스",
    },
    [235648] = {
        name = "로스락시온",
    },
    [235649] = {
        name = "로스락시온",
    },
    [235650] = {
        name = "데시무스",
    },
    [235660] = {
        name = "알레리아 윈드러너",
    },
    [235697] = {
        name = "데시무스",
    },
    [235698] = {
        name = "마법학자 엄브릭",
    },
    [235713] = {
        name = "로스락시온",
    },
    [235715] = {
        name = "알레리아 윈드러너",
    },
    [235717] = {
        name = "알레리아 윈드러너",
    },
    [235724] = {
        name = "아라토르",
    },
    [235763] = {
        name = "알레리아 윈드러너",
    },
    [235765] = {
        name = "알레리아 윈드러너",
    },
    [235787] = {
        name = "로르테마르 테론",
    },
    [236087] = {
        name = "마법학자 엄브릭",
    },
    [236099] = {
        name = "여군주 리아드린",
    },
    [236100] = {
        name = "아라토르",
    },
    [236126] = {
        name = "줄자라",
    },
    [236132] = {
        name = "아라토르",
    },
    [236140] = {
        name = "줄자라",
    },
    [236141] = {
        name = "줄자라",
    },
    [236143] = {
        name = "여군주 리아드린",
    },
    [236147] = {
        name = "줄자라",
    },
    [236155] = {
        name = "줄자라",
    },
    [236162] = {
        name = "줄자라",
    },
    [236363] = {
        name = "마법학자 엄브릭",
    },
    [236391] = {
        name = "아라토르",
    },
    [236436] = {
        name = "여군주 리아드린",
    },
    [236468] = {
        name = "줄자라",
    },
    [236485] = {
        name = "여군주 리아드린",
    },
    [236522] = {
        name = "줄잔",
    },
    [236540] = {
        name = "줄잔",
    },
    [236541] = {
        name = "줄자라",
    },
    [236542] = {
        name = "여군주 리아드린",
    },
    [236558] = {
        name = "줄잔",
    },
    [236559] = {
        name = "줄자라",
    },
    [236567] = {
        name = "아라토르",
    },
    [236572] = {
        name = "로르테마르 테론",
    },
    [236587] = {
        name = "줄자라",
    },
    [236601] = {
        name = "줄자라",
    },
    [236602] = {
        name = "줄자라",
    },
    [236610] = {
        name = "아라토르",
    },
    [236612] = {
        name = "로르테마르 테론",
    },
    [236659] = {
        name = "줄자라",
    },
    [236686] = {
        name = "아라토르",
    },
    [236687] = {
        name = "마법학자 엄브릭",
    },
    [236692] = {
        name = "여군주 리아드린",
    },
    [236693] = {
        name = "여군주 리아드린",
    },
    [236704] = {
        name = "오르웨냐",
    },
    [236716] = {
        name = "아라토르",
    },
    [236730] = {
        name = "마법학자 엄브릭",
    },
    [236737] = {
        name = "아라토르",
    },
    [236739] = {
        name = "마법학자 란드라 돈스트라이더",
    },
    [236743] = {
        name = "오르웨냐",
    },
    [236779] = {
        name = "로르테마르 테론",
    },
    [236896] = {
        name = "로르테마르 테론",
    },
    [236903] = {
        name = "오르웨냐",
    },
    [236906] = {
        name = "대총독 투랄리온",
    },
    [236908] = {
        name = "마트리안 던폴",
    },
    [236930] = {
        name = "켈리아 에버글로우",
    },
    [236945] = {
        name = "알레리아 윈드러너",
    },
    [236961] = {
        name = "로르테마르 테론",
    },
    [236964] = {
        name = "아라토르",
    },
    [236978] = {
        name = "대총독 투랄리온",
    },
    [237222] = {
        name = "빛의 선봉대",
    },
    [237224] = {
        name = "아이트리그",
    },
    [237234] = {
        name = "오르웨냐",
    },
    [237236] = {
        name = "아마라크",
    },
    [237240] = {
        name = "마법학자 엄브릭",
    },
    [237253] = {
        name = "여군주 리아드린",
    },
    [237268] = {
        name = "쿠르드란 와일드해머",
    },
    [237277] = {
        name = "여군주 리아드린",
    },
    [237278] = {
        name = "여군주 리아드린",
    },
    [237284] = {
        name = "아마라크",
    },
    [237325] = {
        name = "오르웨냐",
    },
    [237332] = {
        name = "하가르",
    },
    [237345] = {
        name = "할두런 브라이트윙",
    },
    [237356] = {
        name = "오르웨냐",
    },
    [237361] = {
        name = "오르웨냐",
    },
    [237433] = {
        name = "로르테마르 테론",
    },
    [237465] = {
        name = "할두런 브라이트윙",
    },
    [237480] = {
        name = "오르웨냐",
    },
    [237483] = {
        name = "오르웨냐",
    },
    [237502] = {
        name = "아라토르",
    },
    [237508] = {
        name = "아라토르",
    },
    [237511] = {
        name = "알론서스 파올",
    },
    [237565] = {
        name = "알론서스 파올",
    },
    [237567] = {
        name = "하가르",
    },
    [237572] = {
        name = "하가르",
    },
    [237594] = {
        name = "맥스웰 티로서스 경",
    },
    [237601] = {
        name = "알론서스 파올",
    },
    [237602] = {
        name = "알론서스 파올",
    },
    [237786] = {
        name = "오르웨냐",
    },
    [237787] = {
        name = "할두런 브라이트윙",
    },
    [237860] = {
        name = "오르웨냐",
    },
    [237873] = {
        name = "타이테일러 골든블레이드",
    },
    [237904] = {
        name = "타이테일러 골든블레이드",
    },
    [237905] = {
        name = "타이테일러 골든블레이드",
    },
    [237953] = {
        name = "로아 전령 시즈타",
    },
    [237956] = {
        name = "쿨지",
    },
    [238083] = {
        name = "원정순찰대원 세디나",
    },
    [238084] = {
        name = "해리스 라이트브레스",
    },
    [238296] = {
        name = "알레리아 윈드러너",
    },
    [238490] = {
        name = "리사라 더스크모운",
    },
    [238505] = {
        name = "리사라 더스크모운",
    },
    [238730] = {
        name = "타레나 선스트라이크",
    },
    [238732] = {
        name = "기드윈 골드브레이즈",
    },
    [238748] = {
        name = "기드윈 골드브레이즈",
    },
    [239368] = {
        name = "리사라 더스크모운",
    },
    [239574] = {
        name = "알레리아 윈드러너",
    },
    [239650] = {
        name = "주르아샤르 카사메",
    },
    [239720] = {
        name = "루시아 나이트브레이커",
    },
    [239795] = {
        name = "주르아샤르 카사메",
    },
    [240033] = {
        name = "줄자라",
    },
    [240034] = {
        name = "줄자라",
    },
    [240037] = {
        name = "줄자라",
    },
    [240039] = {
        name = "여군주 리아드린",
    },
    [240186] = {
        name = "줄자라",
    },
    [240215] = {
        name = "줄자라",
    },
    [240216] = {
        name = "줄자라",
    },
    [240240] = {
        name = "알론서스 파올",
    },
    [240403] = {
        name = "마법학자 멜레도어",
    },
    [240408] = {
        name = "순찰자 바르디스",
    },
    [240422] = {
        name = "마법학자 멜레도어",
    },
    [240521] = {
        name = "목각가 아자이",
    },
    [240523] = {
        name = "정찰 지도",
    },
    [240533] = {
        name = "오르웨냐",
    },
    [240630] = {
        name = "할두런 브라이트윙",
    },
    [240662] = {
        name = "지원 성기사",
    },
    [240691] = {
        name = "데시무스",
    },
    [240747] = {
        name = "알론서스 파올",
    },
    [240839] = {
        name = "하가르",
    },
    [240975] = {
        name = "나마지",
    },
    [240976] = {
        name = "카가라",
    },
    [240977] = {
        name = "자크캐쉬",
    },
    [241045] = {
        name = "쿠파알",
    },
    [241070] = {
        name = "오르웨냐",
    },
    [241072] = {
        name = "기자니지",
    },
    [241082] = {
        name = "반백의 토룬도",
    },
    [241109] = {
        name = "아라토르",
    },
    [241130] = {
        name = "할두런 브라이트윙",
    },
    [241205] = {
        name = "아라토르",
    },
    [241206] = {
        name = "로르테마르 테론",
    },
    [241219] = {
        name = "목각가 아자이",
    },
    [241308] = {
        name = "여군주 리아드린",
    },
    [241393] = {
        name = "마법학자 아라디스",
    },
    [241398] = {
        name = "마법학자 던블레이즈",
    },
    [241399] = {
        name = "제이스",
    },
    [241400] = {
        name = "마법학자 아라디스",
    },
    [241401] = {
        name = "제이스",
    },
    [241402] = {
        name = "제이스",
    },
    [241403] = {
        name = "제이스",
    },
    [241404] = {
        name = "제이스",
    },
    [241405] = {
        name = "마법학자 아라디스",
    },
    [241553] = {
        name = "바엘리스 선플룸",
    },
    [241620] = {
        name = "두 번 추방당한 툴아마르",
    },
    [241629] = {
        name = "하난",
    },
    [241654] = {
        name = "대총독 투랄리온",
    },
    [241677] = {
        name = "여군주 리아드린의 환영",
    },
    [241704] = {
        name = "오르웨냐",
    },
    [241742] = {
        name = "오르웨냐",
    },
    [242014] = {
        name = "차나",
    },
    [242120] = {
        name = "다나스 트롤베인",
    },
    [242143] = {
        name = "마법학자 엄브릭",
    },
    [242233] = {
        name = "황천사자 주라스",
    },
    [242358] = {
        name = "쿠리",
    },
    [242383] = {
        name = "구도자 크리캐쉬",
    },
    [242391] = {
        name = "구도자 크리캐쉬",
    },
    [242393] = {
        name = "트리쉬",
    },
    [242394] = {
        name = "아마시",
    },
    [242433] = {
        name = "아라토르",
    },
    [242592] = {
        name = "오르웨냐",
    },
    [242593] = {
        name = "몬테 가즈로",
    },
    [242650] = {
        name = "네이레이아",
    },
    [242688] = {
        name = "루마",
    },
    [242689] = {
        name = "카마리",
    },
    [242691] = {
        name = "쿠리",
    },
    [242700] = {
        name = "켈리아 에버글로우",
    },
    [242802] = {
        name = "살란드리아",
    },
    [242803] = {
        name = "탤리아 폴드라곤",
    },
    [242811] = {
        name = "성전사 솜버선",
    },
    [242882] = {
        name = "오르웨냐",
    },
    [242889] = {
        name = "탤리아 폴드라곤",
    },
    [242890] = {
        name = "살란드리아",
    },
    [242893] = {
        name = "살란드리아",
    },
    [242894] = {
        name = "탤리아 폴드라곤",
    },
    [242897] = {
        name = "살란드리아",
    },
    [242898] = {
        name = "탤리아 폴드라곤",
    },
    [243053] = {
        name = "네이레이아",
    },
    [243091] = {
        name = "아라토르",
    },
    [243226] = {
        name = "보렐투스",
    },
    [243290] = {
        name = "사르비",
    },
    [243884] = {
        name = "주르아샤르 카사메",
    },
    [243907] = {
        name = "데시무스",
    },
    [243984] = {
        name = "아라토르",
    },
    [244163] = {
        name = "추아",
    },
    [244242] = {
        name = "엔리안",
    },
    [244394] = {
        name = "엔리안",
    },
    [244419] = {
        name = "아마라크",
    },
    [244422] = {
        name = "줄자라",
    },
    [244438] = {
        name = "줄자라",
    },
    [244443] = {
        name = "벨라스 돈블레이드",
    },
    [244454] = {
        name = "벨라스 돈블레이드",
    },
    [244455] = {
        name = "아마라크",
    },
    [244473] = {
        name = "엔리안",
    },
    [244493] = {
        name = "아바라",
    },
    [244499] = {
        name = "키판",
    },
    [244516] = {
        name = "키판",
    },
    [244522] = {
        name = "베란",
    },
    [244588] = {
        name = "줄자라",
    },
    [244591] = {
        name = "분자라",
    },
    [244592] = {
        name = "줄자라",
    },
    [244929] = {
        name = "데시무스",
    },
    [244948] = {
        name = "데시무스",
    },
    [245004] = {
        name = "군주 안테노리안",
    },
    [245166] = {
        name = "네이레이아",
    },
    [245186] = {
        name = "태양길잡이 데즈코",
    },
    [245192] = {
        name = "킬투스 블러드번",
    },
    [245200] = {
        name = "제스테니스 선스트라이커",
    },
    [245201] = {
        name = "마법학자 자로니스",
    },
    [245202] = {
        name = "순찰자 한노비아",
    },
    [245270] = {
        name = "줄자라",
    },
    [245285] = {
        name = "교관 데일디르",
    },
    [245297] = {
        name = "벨라스 돈블레이드",
    },
    [245418] = {
        name = "벨라스 돈블레이드",
    },
    [245637] = {
        name = "수미라",
    },
    [245639] = {
        name = "수미라",
    },
    [245664] = {
        name = "릴라주",
    },
    [245669] = {
        name = "젠니라",
    },
    [245745] = {
        name = "발데카르 솔라르",
    },
    [245748] = {
        name = "칼리엘 솔라르",
    },
    [245878] = {
        name = "기사 아나이스",
    },
    [245944] = {
        name = "지원 혈기사",
    },
    [245986] = {
        name = "수미라",
    },
    [246035] = {
        name = "기사 아나이스",
    },
    [246208] = {
        name = "브라코",
    },
    [246557] = {
        name = "킬투스 블러드번",
    },
    [246607] = {
        name = "녹색예언자 사이에나",
    },
    [246727] = {
        name = "라베니아",
    },
    [246777] = {
        name = "지칼",
    },
    [246806] = {
        name = "비전술사 태민",
    },
    [246866] = {
        name = "대장 던러너",
    },
    [247014] = {
        name = "니자 톤터스크",
    },
    [247245] = {
        name = "브라코",
    },
    [247251] = {
        name = "니자 톤터스크",
    },
    [247254] = {
        name = "혼합사 자만가",
    },
    [247299] = {
        name = "태양길잡이 데즈코",
    },
    [247374] = {
        name = "지아단",
    },
    [247394] = {
        name = "순찰자 발사린",
    },
    [247395] = {
        name = "순찰자 아스테레이",
    },
    [247424] = {
        name = "차나",
    },
    [247500] = {
        name = "비전술사 태민",
    },
    [247503] = {
        name = "하스벨리온 선게이즈",
    },
    [247593] = {
        name = "대장 던러너",
    },
    [247596] = {
        name = "비전술사 태민",
    },
    [247640] = {
        name = "샤오말",
    },
    [247645] = {
        name = "솔윈 브라이트스티치",
    },
    [247658] = {
        name = "나옐리",
    },
    [247664] = {
        name = "여군주 다크글렌",
    },
    [247674] = {
        name = "여군주 다크글렌",
    },
    [247736] = {
        name = "나옐리",
    },
    [247936] = {
        name = "유렐렌",
    },
    [248015] = {
        name = "차로누스",
    },
    [248040] = {
        name = "연구원 베리지엔",
    },
    [248072] = {
        name = "균열칼날 아스트레",
    },
    [248121] = {
        name = "푸르그",
    },
    [248123] = {
        name = "도주!",
    },
    [248250] = {
        name = "쿠르드란 와일드해머",
    },
    [248307] = {
        name = "순찰자 발사린",
    },
    [248616] = {
        name = "균열칼날 아스트레",
    },
    [248631] = {
        name = "지휘관 쿠로스 마운틴피스트",
    },
    [248657] = {
        name = "펠나 톤터스크",
    },
    [248787] = {
        name = "탄진",
    },
    [248838] = {
        name = "다크조르",
    },
    [248880] = {
        name = "굶주린 공허방랑자",
    },
    [248881] = {
        name = "정찰병 네피나",
    },
    [248886] = {
        name = "하가르",
    },
    [248894] = {
        name = "정찰병 네피나",
    },
    [249034] = {
        name = "균열방랑자 사이데라스",
    },
    [249045] = {
        name = "균열칼날 아스트레",
    },
    [249106] = {
        name = "마른나무껍질 정찰병",
    },
    [249130] = {
        name = "렌도레이 유령검",
    },
    [249337] = {
        name = "탈란드라 던스프라이트",
    },
    [249426] = {
        name = "리미엔 바운트캐스크",
    },
    [249653] = {
        name = "줄자라",
    },
    [249917] = {
        name = "하바자",
    },
    [249935] = {
        name = "란레이 노사",
    },
    [250068] = {
        name = "로아 전령 토부이",
    },
    [250196] = {
        name = "멀록왕 아옳아옳",
    },
    [250197] = {
        name = "조수 그르긇 그르긇",
    },
    [250291] = {
        name = "순찰자 크렌안",
    },
    [250298] = {
        name = "누미아 골든",
    },
    [250388] = {
        name = "하스벨리온 선게이즈",
    },
    [250677] = {
        name = "란레이 노사",
    },
    [250791] = {
        name = "테렐 블러드페이트",
    },
    [250798] = {
        name = "알레실 던블러드",
    },
    [250888] = {
        name = "솔윈 브라이트스티치",
    },
    [251258] = {
        name = "아니",
    },
    [251277] = {
        name = "란레이 노사",
    },
    [251355] = {
        name = "알론서스 파올",
    },
    [251522] = {
        name = "이다고",
    },
    [251669] = {
        name = "릴라주",
    },
    [251715] = {
        name = "툭툭",
    },
    [251723] = {
        name = "자이니",
    },
    [251891] = {
        name = "머무는 망령",
    },
    [252109] = {
        name = "영혼착취자 알라리",
    },
    [252110] = {
        name = "레오나 다크스트라이더",
    },
    [252495] = {
        name = "하가르",
    },
    [252496] = {
        name = "하가르",
    },
    [252497] = {
        name = "하가르",
    },
    [252500] = {
        name = "순찰자 텔레누스",
    },
    [252510] = {
        name = "오린 스타리라이트",
    },
    [252807] = {
        name = "선봉대 성기사",
    },
    [252853] = {
        name = "데시무스",
    },
    [252871] = {
        name = "주르아샤르 세이네이아",
    },
    [252872] = {
        name = "오른샨",
    },
    [252947] = {
        name = "라이시카스",
    },
    [252949] = {
        name = "균열칼날 마엘라",
    },
    [253015] = {
        name = "마법학자 재다나",
    },
    [253038] = {
        name = "균열방랑자 알레이셴",
    },
    [253058] = {
        name = "너덜너덜한 고서",
    },
    [253087] = {
        name = "발광하는 시체",
    },
    [253105] = {
        name = "하난",
    },
    [253125] = {
        name = "쿠르드란 와일드해머",
    },
    [253312] = {
        name = "네이타르",
    },
    [253390] = {
        name = "케탄",
    },
    [253392] = {
        name = "아카지",
    },
    [253433] = {
        name = "케탄",
    },
    [253468] = {
        name = "드라덴",
    },
    [253523] = {
        name = "기사 아나이스",
    },
    [253948] = {
        name = "레오나 다크스트라이더",
    },
    [253997] = {
        name = "켈부조",
    },
    [254012] = {
        name = "오린 스타리라이트",
    },
    [254014] = {
        name = "오린 스타리라이트",
    },
    [254142] = {
        name = "이칼라니",
    },
    [254144] = {
        name = "안잘리",
    },
    [254146] = {
        name = "라칸",
    },
    [254402] = {
        name = "정찰병 필라나스",
    },
    [254488] = {
        name = "자크자리",
    },
    [254491] = {
        name = "카하네아",
    },
    [254509] = {
        name = "라이시카스",
    },
    [254510] = {
        name = "라이시카스",
    },
    [254513] = {
        name = "균열칼날 마엘라",
    },
    [254665] = {
        name = "장로 도루",
    },
    [254716] = {
        name = "네룬다",
    },
    [254719] = {
        name = "칸자",
    },
    [254783] = {
        name = "반백의 토룬도",
    },
    [254827] = {
        name = "장로 도루",
    },
    [254903] = {
        name = "모타",
    },
    [255406] = {
        name = "신병 다르락",
    },
    [255822] = {
        name = "오르웨냐",
    },
    [255852] = {
        name = "정찰병 젤칸라",
    },
    [256206] = {
        name = "지각력 있는 공허방랑자",
    },
    [256285] = {
        name = "영혼착취자 알라리",
    },
    [256796] = {
        name = "지아단",
    },
    [256813] = {
        name = "지아단",
    },
    [256815] = {
        name = "비디우스",
    },
    [256867] = {
        name = "통곡하는 아마니",
    },
    [256901] = {
        name = "지아단",
    },
    [257002] = {
        name = "지칼",
    },
    [257092] = {
        name = "늙은 테오잔",
    },
    [257384] = {
        name = "낙담한 마법학자",
    },
    [257393] = {
        name = "페른 쉐이드스타",
    },
    [257426] = {
        name = "스승 안시올",
    },
    [257478] = {
        name = "다르굴",
    },
    [257479] = {
        name = "아마리 린든",
    },
    [258014] = {
        name = "칸자",
    },
    [258363] = {
        name = "칸자",
    },
    [258950] = {
        name = "바칼라",
    },
})
]])()
