----- AUTO GENERATED - DO NOT EDIT

if GetLocale() ~= "ruRU" then
    return
end

loadstring([[
BtWQuestsDatabase:UpdateNPCsTable({
    [235386] = {
        name = "Магистр Умбрий",
    },
    [235389] = {
        name = "Аллерия Ветрокрылая",
    },
    [235394] = {
        name = "Лотраксион",
    },
    [235405] = {
        name = "Магистр Умбрий",
    },
    [235411] = {
        name = "Магистр Умбрий",
    },
    [235469] = {
        name = "Аратор",
    },
    [235486] = {
        name = "Лотраксион",
    },
    [235502] = {
        name = "Аллерия Ветрокрылая",
    },
    [235503] = {
        name = "Аратор",
    },
    [235504] = {
        name = "Лотраксион",
    },
    [235522] = {
        name = "Лотраксион",
    },
    [235530] = {
        name = "Лотраксион",
    },
    [235532] = {
        name = "Аллерия Ветрокрылая",
    },
    [235535] = {
        name = "Лотраксион",
    },
    [235606] = {
        name = "Лотраксион",
    },
    [235633] = {
        name = "Децим",
    },
    [235648] = {
        name = "Лотраксион",
    },
    [235649] = {
        name = "Лотраксион",
    },
    [235650] = {
        name = "Децим",
    },
    [235660] = {
        name = "Аллерия Ветрокрылая",
    },
    [235697] = {
        name = "Децим",
    },
    [235698] = {
        name = "Магистр Умбрий",
    },
    [235713] = {
        name = "Лотраксион",
    },
    [235715] = {
        name = "Аллерия Ветрокрылая",
    },
    [235717] = {
        name = "Аллерия Ветрокрылая",
    },
    [235724] = {
        name = "Аратор",
    },
    [235763] = {
        name = "Аллерия Ветрокрылая",
    },
    [235765] = {
        name = "Аллерия Ветрокрылая",
    },
    [235787] = {
        name = "Лор'темар Терон",
    },
    [236087] = {
        name = "Магистр Умбрий",
    },
    [236099] = {
        name = "Леди Лиадрин",
    },
    [236100] = {
        name = "Аратор",
    },
    [236126] = {
        name = "Зул'джарра",
    },
    [236132] = {
        name = "Аратор",
    },
    [236140] = {
        name = "Зул'джарра",
    },
    [236141] = {
        name = "Зул'джарра",
    },
    [236143] = {
        name = "Леди Лиадрин",
    },
    [236147] = {
        name = "Зул'джарра",
    },
    [236155] = {
        name = "Зул'джарра",
    },
    [236162] = {
        name = "Зул'джарра",
    },
    [236363] = {
        name = "Магистр Умбрий",
    },
    [236391] = {
        name = "Аратор",
    },
    [236436] = {
        name = "Леди Лиадрин",
    },
    [236468] = {
        name = "Зул'джарра",
    },
    [236485] = {
        name = "Леди Лиадрин",
    },
    [236522] = {
        name = "Зул'джан",
    },
    [236540] = {
        name = "Зул'джан",
    },
    [236541] = {
        name = "Зул'джарра",
    },
    [236542] = {
        name = "Леди Лиадрин",
    },
    [236558] = {
        name = "Зул'джан",
    },
    [236559] = {
        name = "Зул'джарра",
    },
    [236567] = {
        name = "Аратор",
    },
    [236572] = {
        name = "Лор'темар Терон",
    },
    [236587] = {
        name = "Зул'джарра",
    },
    [236601] = {
        name = "Зул'джарра",
    },
    [236602] = {
        name = "Зул'джарра",
    },
    [236610] = {
        name = "Аратор",
    },
    [236612] = {
        name = "Лор'темар Терон",
    },
    [236659] = {
        name = "Зул'джарра",
    },
    [236686] = {
        name = "Аратор",
    },
    [236687] = {
        name = "Магистр Умбрий",
    },
    [236692] = {
        name = "Леди Лиадрин",
    },
    [236693] = {
        name = "Леди Лиадрин",
    },
    [236704] = {
        name = "Орвейна",
    },
    [236716] = {
        name = "Аратор",
    },
    [236730] = {
        name = "Магистр Умбрий",
    },
    [236737] = {
        name = "Аратор",
    },
    [236739] = {
        name = "Магистр Ландра Рассветная Странница",
    },
    [236743] = {
        name = "Орвейна",
    },
    [236779] = {
        name = "Лор'темар Терон",
    },
    [236896] = {
        name = "Лор'темар Терон",
    },
    [236903] = {
        name = "Орвейна",
    },
    [236906] = {
        name = "Верховный экзарх Туралион",
    },
    [236908] = {
        name = "Матреан Утренний Полумрак",
    },
    [236930] = {
        name = "Келия Вечный Свет",
    },
    [236945] = {
        name = "Аллерия Ветрокрылая",
    },
    [236961] = {
        name = "Лор'темар Терон",
    },
    [236964] = {
        name = "Аратор",
    },
    [236978] = {
        name = "Верховный экзарх Туралион",
    },
    [237222] = {
        name = "Авангард Света",
    },
    [237224] = {
        name = "Эйтригг",
    },
    [237234] = {
        name = "Орвейна",
    },
    [237236] = {
        name = "Амаракк",
    },
    [237240] = {
        name = "Магистр Умбрий",
    },
    [237253] = {
        name = "Леди Лиадрин",
    },
    [237268] = {
        name = "Курдран Громовой Молот",
    },
    [237277] = {
        name = "Леди Лиадрин",
    },
    [237278] = {
        name = "Леди Лиадрин",
    },
    [237284] = {
        name = "Амаракк",
    },
    [237325] = {
        name = "Орвейна",
    },
    [237332] = {
        name = "Хагар",
    },
    [237345] = {
        name = "Халдарон Светлое Крыло",
    },
    [237356] = {
        name = "Орвейна",
    },
    [237361] = {
        name = "Орвейна",
    },
    [237433] = {
        name = "Лор'темар Терон",
    },
    [237465] = {
        name = "Халдарон Светлое Крыло",
    },
    [237480] = {
        name = "Орвейна",
    },
    [237483] = {
        name = "Орвейна",
    },
    [237502] = {
        name = "Аратор",
    },
    [237508] = {
        name = "Аратор",
    },
    [237511] = {
        name = "Алонсий Фаол",
    },
    [237565] = {
        name = "Алонсий Фаол",
    },
    [237567] = {
        name = "Хагар",
    },
    [237572] = {
        name = "Хагар",
    },
    [237594] = {
        name = "Лорд Максвелл Тиросс",
    },
    [237601] = {
        name = "Алонсий Фаол",
    },
    [237602] = {
        name = "Алонсий Фаол",
    },
    [237786] = {
        name = "Орвейна",
    },
    [237787] = {
        name = "Халдарон Светлое Крыло",
    },
    [237860] = {
        name = "Орвейна",
    },
    [237873] = {
        name = "Титалор Золоченый Клинок",
    },
    [237904] = {
        name = "Титалор Золоченый Клинок",
    },
    [237905] = {
        name = "Титалор Золоченый Клинок",
    },
    [237953] = {
        name = "Говорящий с лоа Сидж'та",
    },
    [237956] = {
        name = "Кулзи",
    },
    [238083] = {
        name = "Странница Седайна",
    },
    [238084] = {
        name = "Харрис Дыхание Света",
    },
    [238296] = {
        name = "Аллерия Ветрокрылая",
    },
    [238490] = {
        name = "Лиссара Скорбь Сумерек",
    },
    [238505] = {
        name = "Лиссара Скорбь Сумерек",
    },
    [238730] = {
        name = "Таренар Удар Солнца",
    },
    [238732] = {
        name = "Гидвин Златокос",
    },
    [238748] = {
        name = "Гидвин Златокос",
    },
    [239368] = {
        name = "Лиссара Скорбь Сумерек",
    },
    [239574] = {
        name = "Аллерия Ветрокрылая",
    },
    [239650] = {
        name = "Зур'ашар Кассаме",
    },
    [239720] = {
        name = "Люция Ночеубийца",
    },
    [239795] = {
        name = "Зур'ашар Кассаме",
    },
    [240033] = {
        name = "Зул'джарра",
    },
    [240034] = {
        name = "Зул'джарра",
    },
    [240037] = {
        name = "Зул'джарра",
    },
    [240039] = {
        name = "Леди Лиадрин",
    },
    [240186] = {
        name = "Зул'джарра",
    },
    [240215] = {
        name = "Зул'джарра",
    },
    [240216] = {
        name = "Зул'джарра",
    },
    [240240] = {
        name = "Алонсий Фаол",
    },
    [240403] = {
        name = "Магистр Меледор",
    },
    [240408] = {
        name = "Следопыт Вардис",
    },
    [240422] = {
        name = "Магистр Меледор",
    },
    [240521] = {
        name = "Резчик по дереву Азай",
    },
    [240523] = {
        name = "Тактическая карта",
    },
    [240533] = {
        name = "Орвейна",
    },
    [240630] = {
        name = "Халдарон Светлое Крыло",
    },
    [240662] = {
        name = "Паладин-помощник",
    },
    [240691] = {
        name = "Децим",
    },
    [240747] = {
        name = "Алонсий Фаол",
    },
    [240839] = {
        name = "Хагар",
    },
    [240975] = {
        name = "Намаджи",
    },
    [240976] = {
        name = "Кагара",
    },
    [240977] = {
        name = "Зак'каш",
    },
    [241045] = {
        name = "Ку'паал",
    },
    [241070] = {
        name = "Орвейна",
    },
    [241072] = {
        name = "Гиджаниджи",
    },
    [241082] = {
        name = "Торундо Ревун",
    },
    [241109] = {
        name = "Аратор",
    },
    [241130] = {
        name = "Халдарон Светлое Крыло",
    },
    [241205] = {
        name = "Аратор",
    },
    [241206] = {
        name = "Лор'темар Терон",
    },
    [241219] = {
        name = "Резчик по дереву Азай",
    },
    [241308] = {
        name = "Леди Лиадрин",
    },
    [241393] = {
        name = "Магистр Арадис",
    },
    [241398] = {
        name = "Магистр Рассветный Жар",
    },
    [241399] = {
        name = "Джаэт",
    },
    [241400] = {
        name = "Магистр Арадис",
    },
    [241401] = {
        name = "Джаэт",
    },
    [241402] = {
        name = "Джаэт",
    },
    [241403] = {
        name = "Джаэт",
    },
    [241404] = {
        name = "Джаэт",
    },
    [241405] = {
        name = "Магистр Арадис",
    },
    [241553] = {
        name = "Ваэлит Солнечный Гребень",
    },
    [241620] = {
        name = "Тул'амар Дважды Изгнанная",
    },
    [241629] = {
        name = "Ханнан",
    },
    [241654] = {
        name = "Верховный экзарх Туралион",
    },
    [241677] = {
        name = "Копия леди Лиадрин",
    },
    [241704] = {
        name = "Орвейна",
    },
    [241742] = {
        name = "Орвейна",
    },
    [242014] = {
        name = "Чана",
    },
    [242120] = {
        name = "Данат Троллебой",
    },
    [242143] = {
        name = "Магистр Умбрий",
    },
    [242233] = {
        name = "Юрас Посланник Пустоты",
    },
    [242358] = {
        name = "Кури",
    },
    [242383] = {
        name = "Искатель Криккаш",
    },
    [242391] = {
        name = "Искатель Криккаш",
    },
    [242393] = {
        name = "Трише",
    },
    [242394] = {
        name = "Амакси",
    },
    [242433] = {
        name = "Аратор",
    },
    [242592] = {
        name = "Орвейна",
    },
    [242593] = {
        name = "Монти Газлоу",
    },
    [242650] = {
        name = "Ней'лея",
    },
    [242688] = {
        name = "Лума",
    },
    [242689] = {
        name = "Камари",
    },
    [242691] = {
        name = "Кури",
    },
    [242700] = {
        name = "Келия Вечный Свет",
    },
    [242802] = {
        name = "Саландрия",
    },
    [242803] = {
        name = "Телия Фордрагон",
    },
    [242811] = {
        name = "Рыцарь Солнце Теней",
    },
    [242882] = {
        name = "Орвейна",
    },
    [242889] = {
        name = "Телия Фордрагон",
    },
    [242890] = {
        name = "Саландрия",
    },
    [242893] = {
        name = "Саландрия",
    },
    [242894] = {
        name = "Телия Фордрагон",
    },
    [242897] = {
        name = "Саландрия",
    },
    [242898] = {
        name = "Телия Фордрагон",
    },
    [243053] = {
        name = "Ней'лея",
    },
    [243091] = {
        name = "Аратор",
    },
    [243226] = {
        name = "Болет",
    },
    [243290] = {
        name = "Сарви",
    },
    [243884] = {
        name = "Зур'ашар Кассаме",
    },
    [243907] = {
        name = "Децим",
    },
    [243984] = {
        name = "Аратор",
    },
    [244163] = {
        name = "Чуа",
    },
    [244242] = {
        name = "Эн'лиан",
    },
    [244394] = {
        name = "Эн'лиан",
    },
    [244419] = {
        name = "Амаракк",
    },
    [244422] = {
        name = "Зул'джарра",
    },
    [244438] = {
        name = "Зул'джарра",
    },
    [244443] = {
        name = "Белат Клинок Рассвета",
    },
    [244454] = {
        name = "Белат Клинок Рассвета",
    },
    [244455] = {
        name = "Амаракк",
    },
    [244473] = {
        name = "Эн'лиан",
    },
    [244493] = {
        name = "Авара",
    },
    [244499] = {
        name = "Кифаан",
    },
    [244516] = {
        name = "Кифаан",
    },
    [244522] = {
        name = "Вераан",
    },
    [244588] = {
        name = "Зул'джарра",
    },
    [244591] = {
        name = "Вун'зара",
    },
    [244592] = {
        name = "Зул'джарра",
    },
    [244929] = {
        name = "Децим",
    },
    [244948] = {
        name = "Децим",
    },
    [245004] = {
        name = "Лорд Антенориан",
    },
    [245166] = {
        name = "Ней'лея",
    },
    [245186] = {
        name = "Служитель Солнца Дезко",
    },
    [245192] = {
        name = "Килт Кровожог",
    },
    [245200] = {
        name = "Джестенис Солнцесвет",
    },
    [245201] = {
        name = "Магистр Джаронис",
    },
    [245202] = {
        name = "Следопыт Ганновия",
    },
    [245270] = {
        name = "Зул'джарра",
    },
    [245285] = {
        name = "Инструктор Талендир",
    },
    [245297] = {
        name = "Белат Клинок Рассвета",
    },
    [245418] = {
        name = "Белат Клинок Рассвета",
    },
    [245637] = {
        name = "Су'меера",
    },
    [245639] = {
        name = "Су'меера",
    },
    [245664] = {
        name = "Лиладжу",
    },
    [245669] = {
        name = "Дженира",
    },
    [245745] = {
        name = "Вальдекар Солаар",
    },
    [245748] = {
        name = "Калиэль Солаар",
    },
    [245878] = {
        name = "Рыцарь Анаис",
    },
    [245944] = {
        name = "Рыцарь крови – помощник",
    },
    [245986] = {
        name = "Су'меера",
    },
    [246035] = {
        name = "Рыцарь Анаис",
    },
    [246208] = {
        name = "Бракко",
    },
    [246557] = {
        name = "Килт Кровожог",
    },
    [246607] = {
        name = "Глашатай растений Кьенна",
    },
    [246727] = {
        name = "Голодий",
    },
    [246777] = {
        name = "Гикаль",
    },
    [246806] = {
        name = "Чародей Таемин",
    },
    [246866] = {
        name = "Капитан Вестник Зари",
    },
    [247014] = {
        name = "Нийя Сломанный Клык",
    },
    [247245] = {
        name = "Бракко",
    },
    [247251] = {
        name = "Нийя Сломанный Клык",
    },
    [247254] = {
        name = "Мешальщик Джаманга",
    },
    [247299] = {
        name = "Служитель Солнца Дезко",
    },
    [247374] = {
        name = "Зиадан",
    },
    [247394] = {
        name = "Следопыт Вальсарин",
    },
    [247395] = {
        name = "Следопыт Астерэ",
    },
    [247424] = {
        name = "Чана",
    },
    [247500] = {
        name = "Чародей Таемин",
    },
    [247503] = {
        name = "Гатвелион Солнечный Взор",
    },
    [247593] = {
        name = "Капитан Вестник Зари",
    },
    [247596] = {
        name = "Чародей Таемин",
    },
    [247640] = {
        name = "Шао'мал",
    },
    [247645] = {
        name = "Солвин Яркий Шов",
    },
    [247658] = {
        name = "Найели",
    },
    [247664] = {
        name = "Госпожа Мракодол",
    },
    [247674] = {
        name = "Госпожа Мракодол",
    },
    [247736] = {
        name = "Найели",
    },
    [247936] = {
        name = "Ю'релен",
    },
    [248015] = {
        name = "Харон",
    },
    [248040] = {
        name = "Исследователь Веригиен",
    },
    [248072] = {
        name = "Клинок Бездны Астре",
    },
    [248121] = {
        name = "Фарг",
    },
    [248123] = {
        name = "Флиг",
    },
    [248250] = {
        name = "Курдран Громовой Молот",
    },
    [248307] = {
        name = "Следопыт Вальсарин",
    },
    [248616] = {
        name = "Клинок Бездны Астре",
    },
    [248631] = {
        name = "Командир Корат Горный Кулак",
    },
    [248657] = {
        name = "Пел'на Сломанный Клык",
    },
    [248787] = {
        name = "Тан'зин",
    },
    [248838] = {
        name = "Дак'зор",
    },
    [248880] = {
        name = "Голодающий демон Бездны",
    },
    [248881] = {
        name = "Разведчица Нефина",
    },
    [248886] = {
        name = "Хагар",
    },
    [248894] = {
        name = "Разведчица Нефина",
    },
    [249034] = {
        name = "Странник разломов Сайдерас",
    },
    [249045] = {
        name = "Клинок Бездны Астре",
    },
    [249106] = {
        name = "Разведчик из племени Сухокожих",
    },
    [249130] = {
        name = "Рен'дорай – Призрачный Клинок",
    },
    [249337] = {
        name = "Таландра Дух Рассвета",
    },
    [249426] = {
        name = "Лимьен Бунткаск",
    },
    [249653] = {
        name = "Зул'джарра",
    },
    [249917] = {
        name = "Хавазза",
    },
    [249935] = {
        name = "Ланлая Нокса",
    },
    [250068] = {
        name = "Говорящий с лоа Тобуи",
    },
    [250196] = {
        name = "Король Мргл-Мргл",
    },
    [250197] = {
        name = "Помощница Гргл-гргл",
    },
    [250291] = {
        name = "Следопыт Кренн'ан",
    },
    [250298] = {
        name = "Нумия Золотая",
    },
    [250388] = {
        name = "Гатвелион Солнечный Взор",
    },
    [250677] = {
        name = "Ланлая Нокса",
    },
    [250791] = {
        name = "Терел Кровавая Судьба",
    },
    [250798] = {
        name = "Алесил Кровь Рассвета",
    },
    [250888] = {
        name = "Солвин Яркий Шов",
    },
    [251258] = {
        name = "Ани",
    },
    [251277] = {
        name = "Ланлая Нокса",
    },
    [251355] = {
        name = "Алонсий Фаол",
    },
    [251522] = {
        name = "Айдаго",
    },
    [251669] = {
        name = "Лиладжу",
    },
    [251715] = {
        name = "Туктук",
    },
    [251723] = {
        name = "Зайни",
    },
    [251891] = {
        name = "Неугасающая тень",
    },
    [252109] = {
        name = "Аллари Пожирательница Душ",
    },
    [252110] = {
        name = "Леона Тенеброд",
    },
    [252495] = {
        name = "Хагар",
    },
    [252496] = {
        name = "Хагар",
    },
    [252497] = {
        name = "Хагар",
    },
    [252500] = {
        name = "Следопыт Телен",
    },
    [252510] = {
        name = "Орин Блуждающий Свет",
    },
    [252807] = {
        name = "Паладин авангарда",
    },
    [252853] = {
        name = "Децим",
    },
    [252871] = {
        name = "Зур'ашар Шай'нея",
    },
    [252872] = {
        name = "Орн'шан",
    },
    [252947] = {
        name = "Лисикас",
    },
    [252949] = {
        name = "Клинок Бездны Маэлла",
    },
    [253015] = {
        name = "Магистр Зайдана",
    },
    [253038] = {
        name = "Странник разломов Алайшен",
    },
    [253058] = {
        name = "Любимая книга",
    },
    [253087] = {
        name = "Светящийся труп",
    },
    [253105] = {
        name = "Ханнан",
    },
    [253125] = {
        name = "Курдран Громовой Молот",
    },
    [253312] = {
        name = "Ней'тар",
    },
    [253390] = {
        name = "Кетан",
    },
    [253392] = {
        name = "Акази",
    },
    [253433] = {
        name = "Кетан",
    },
    [253468] = {
        name = "Дратен",
    },
    [253523] = {
        name = "Рыцарь Анаис",
    },
    [253948] = {
        name = "Леона Тенеброд",
    },
    [253997] = {
        name = "Кел'вуджо",
    },
    [254012] = {
        name = "Орин Блуждающий Свет",
    },
    [254014] = {
        name = "Орин Блуждающий Свет",
    },
    [254142] = {
        name = "Иклани",
    },
    [254144] = {
        name = "Ан'джали",
    },
    [254146] = {
        name = "Ракан",
    },
    [254402] = {
        name = "Разведчик Филанас",
    },
    [254488] = {
        name = "Джак'зари",
    },
    [254491] = {
        name = "Каханея",
    },
    [254509] = {
        name = "Лисикас",
    },
    [254510] = {
        name = "Лисикас",
    },
    [254513] = {
        name = "Клинок Бездны Маэлла",
    },
    [254665] = {
        name = "Старейшина Дору",
    },
    [254716] = {
        name = "Нерунда",
    },
    [254719] = {
        name = "Канза",
    },
    [254783] = {
        name = "Торундо Ревун",
    },
    [254827] = {
        name = "Старейшина Дору",
    },
    [254903] = {
        name = "Мотта",
    },
    [255406] = {
        name = "Новобранец Дар'рак",
    },
    [255822] = {
        name = "Орвейна",
    },
    [255852] = {
        name = "Разведчица Зел'канра",
    },
    [256206] = {
        name = "Разумный демон Бездны",
    },
    [256285] = {
        name = "Аллари Пожирательница Душ",
    },
    [256796] = {
        name = "Зиадан",
    },
    [256813] = {
        name = "Зиадан",
    },
    [256815] = {
        name = "Видий",
    },
    [256867] = {
        name = "Скорбящий амани",
    },
    [256901] = {
        name = "Зиадан",
    },
    [257002] = {
        name = "Гикаль",
    },
    [257092] = {
        name = "Старик Тео'зан",
    },
    [257384] = {
        name = "Печальный магистр",
    },
    [257393] = {
        name = "Ферн Тень Звезды",
    },
    [257426] = {
        name = "Инструктор Антеол",
    },
    [257478] = {
        name = "Дар'гул",
    },
    [257479] = {
        name = "Амари Линдон",
    },
    [258014] = {
        name = "Канза",
    },
    [258363] = {
        name = "Канза",
    },
    [258950] = {
        name = "Вакала",
    },
})
]])()
