----- AUTO GENERATED - DO NOT EDIT

if GetLocale() ~= "zhCN" then
    return
end

loadstring([[
BtWQuestsDatabase:UpdateNPCsTable({
    [235386] = {
        name = "魔导师乌布里克",
    },
    [235389] = {
        name = "奥蕾莉亚·风行者",
    },
    [235394] = {
        name = "洛萨克森",
    },
    [235405] = {
        name = "魔导师乌布里克",
    },
    [235411] = {
        name = "魔导师乌布里克",
    },
    [235469] = {
        name = "阿拉托尔",
    },
    [235486] = {
        name = "洛萨克森",
    },
    [235502] = {
        name = "奥蕾莉亚·风行者",
    },
    [235503] = {
        name = "阿拉托尔",
    },
    [235504] = {
        name = "洛萨克森",
    },
    [235522] = {
        name = "洛萨克森",
    },
    [235530] = {
        name = "洛萨克森",
    },
    [235532] = {
        name = "奥蕾莉亚·风行者",
    },
    [235535] = {
        name = "洛萨克森",
    },
    [235606] = {
        name = "洛萨克森",
    },
    [235633] = {
        name = "殆希莫斯",
    },
    [235648] = {
        name = "洛萨克森",
    },
    [235649] = {
        name = "洛萨克森",
    },
    [235650] = {
        name = "殆希莫斯",
    },
    [235660] = {
        name = "奥蕾莉亚·风行者",
    },
    [235697] = {
        name = "殆希莫斯",
    },
    [235698] = {
        name = "魔导师乌布里克",
    },
    [235713] = {
        name = "洛萨克森",
    },
    [235715] = {
        name = "奥蕾莉亚·风行者",
    },
    [235717] = {
        name = "奥蕾莉亚·风行者",
    },
    [235724] = {
        name = "阿拉托尔",
    },
    [235763] = {
        name = "奥蕾莉亚·风行者",
    },
    [235765] = {
        name = "奥蕾莉亚·风行者",
    },
    [235787] = {
        name = "洛瑟玛·塞隆",
    },
    [236087] = {
        name = "魔导师乌布里克",
    },
    [236099] = {
        name = "女伯爵莉亚德琳",
    },
    [236100] = {
        name = "阿拉托尔",
    },
    [236126] = {
        name = "祖尔加拉",
    },
    [236132] = {
        name = "阿拉托尔",
    },
    [236140] = {
        name = "祖尔加拉",
    },
    [236141] = {
        name = "祖尔加拉",
    },
    [236143] = {
        name = "女伯爵莉亚德琳",
    },
    [236147] = {
        name = "祖尔加拉",
    },
    [236155] = {
        name = "祖尔加拉",
    },
    [236162] = {
        name = "祖尔加拉",
    },
    [236363] = {
        name = "魔导师乌布里克",
    },
    [236391] = {
        name = "阿拉托尔",
    },
    [236436] = {
        name = "女伯爵莉亚德琳",
    },
    [236468] = {
        name = "祖尔加拉",
    },
    [236485] = {
        name = "女伯爵莉亚德琳",
    },
    [236522] = {
        name = "祖尔加",
    },
    [236540] = {
        name = "祖尔加",
    },
    [236541] = {
        name = "祖尔加拉",
    },
    [236542] = {
        name = "女伯爵莉亚德琳",
    },
    [236558] = {
        name = "祖尔加",
    },
    [236559] = {
        name = "祖尔加拉",
    },
    [236567] = {
        name = "阿拉托尔",
    },
    [236572] = {
        name = "洛瑟玛·塞隆",
    },
    [236587] = {
        name = "祖尔加拉",
    },
    [236601] = {
        name = "祖尔加拉",
    },
    [236602] = {
        name = "祖尔加拉",
    },
    [236610] = {
        name = "阿拉托尔",
    },
    [236612] = {
        name = "洛瑟玛·塞隆",
    },
    [236659] = {
        name = "祖尔加拉",
    },
    [236686] = {
        name = "阿拉托尔",
    },
    [236687] = {
        name = "魔导师乌布里克",
    },
    [236692] = {
        name = "女伯爵莉亚德琳",
    },
    [236693] = {
        name = "女伯爵莉亚德琳",
    },
    [236704] = {
        name = "奥威娜",
    },
    [236716] = {
        name = "阿拉托尔",
    },
    [236730] = {
        name = "魔导师乌布里克",
    },
    [236737] = {
        name = "阿拉托尔",
    },
    [236739] = {
        name = "魔导师兰德拉·晨行者",
    },
    [236743] = {
        name = "奥威娜",
    },
    [236779] = {
        name = "洛瑟玛·塞隆",
    },
    [236896] = {
        name = "洛瑟玛·塞隆",
    },
    [236903] = {
        name = "奥威娜",
    },
    [236906] = {
        name = "大主教图拉扬",
    },
    [236908] = {
        name = "马特瑞安·晨陨",
    },
    [236930] = {
        name = "克利雅·长明",
    },
    [236945] = {
        name = "奥蕾莉亚·风行者",
    },
    [236961] = {
        name = "洛瑟玛·塞隆",
    },
    [236964] = {
        name = "阿拉托尔",
    },
    [236978] = {
        name = "大主教图拉扬",
    },
    [237222] = {
        name = "圣光先锋",
    },
    [237224] = {
        name = "伊崔格",
    },
    [237234] = {
        name = "奥威娜",
    },
    [237236] = {
        name = "阿玛拉克",
    },
    [237240] = {
        name = "魔导师乌布里克",
    },
    [237253] = {
        name = "女伯爵莉亚德琳",
    },
    [237268] = {
        name = "库德兰·蛮锤",
    },
    [237277] = {
        name = "女伯爵莉亚德琳",
    },
    [237278] = {
        name = "女伯爵莉亚德琳",
    },
    [237284] = {
        name = "阿玛拉克",
    },
    [237325] = {
        name = "奥威娜",
    },
    [237332] = {
        name = "哈加尔",
    },
    [237345] = {
        name = "哈杜伦·明翼",
    },
    [237356] = {
        name = "奥威娜",
    },
    [237361] = {
        name = "奥威娜",
    },
    [237433] = {
        name = "洛瑟玛·塞隆",
    },
    [237465] = {
        name = "哈杜伦·明翼",
    },
    [237480] = {
        name = "奥威娜",
    },
    [237483] = {
        name = "奥威娜",
    },
    [237502] = {
        name = "阿拉托尔",
    },
    [237508] = {
        name = "阿拉托尔",
    },
    [237511] = {
        name = "阿隆索斯·法奥",
    },
    [237565] = {
        name = "阿隆索斯·法奥",
    },
    [237567] = {
        name = "哈加尔",
    },
    [237572] = {
        name = "哈加尔",
    },
    [237594] = {
        name = "玛克斯韦尔·泰罗索斯男爵",
    },
    [237601] = {
        name = "阿隆索斯·法奥",
    },
    [237602] = {
        name = "阿隆索斯·法奥",
    },
    [237786] = {
        name = "奥威娜",
    },
    [237787] = {
        name = "哈杜伦·明翼",
    },
    [237860] = {
        name = "奥威娜",
    },
    [237873] = {
        name = "泰特勒·金刃",
    },
    [237904] = {
        name = "泰特勒·金刃",
    },
    [237905] = {
        name = "泰特勒·金刃",
    },
    [237953] = {
        name = "神灵代言人西吉塔",
    },
    [237956] = {
        name = "库尔吉",
    },
    [238083] = {
        name = "远行者塞蒂娜",
    },
    [238084] = {
        name = "哈里斯·光息",
    },
    [238296] = {
        name = "奥蕾莉亚·风行者",
    },
    [238490] = {
        name = "莱丝萨拉·暮哀",
    },
    [238505] = {
        name = "莱丝萨拉·暮哀",
    },
    [238730] = {
        name = "塔伦纳·射日者",
    },
    [238732] = {
        name = "吉德文·金须",
    },
    [238748] = {
        name = "吉德文·金须",
    },
    [239368] = {
        name = "莱丝萨拉·暮哀",
    },
    [239574] = {
        name = "奥蕾莉亚·风行者",
    },
    [239650] = {
        name = "卡萨梅，祖尔阿沙",
    },
    [239720] = {
        name = "露西亚·碎夜",
    },
    [239795] = {
        name = "卡萨梅，祖尔阿沙",
    },
    [240033] = {
        name = "祖尔加拉",
    },
    [240034] = {
        name = "祖尔加拉",
    },
    [240037] = {
        name = "祖尔加拉",
    },
    [240039] = {
        name = "女伯爵莉亚德琳",
    },
    [240186] = {
        name = "祖尔加拉",
    },
    [240215] = {
        name = "祖尔加拉",
    },
    [240216] = {
        name = "祖尔加拉",
    },
    [240240] = {
        name = "阿隆索斯·法奥",
    },
    [240403] = {
        name = "魔导师梅雷多尔",
    },
    [240408] = {
        name = "游侠瓦迪斯",
    },
    [240422] = {
        name = "魔导师梅雷多尔",
    },
    [240521] = {
        name = "木匠阿扎伊",
    },
    [240523] = {
        name = "侦察地图",
    },
    [240533] = {
        name = "奥威娜",
    },
    [240630] = {
        name = "哈杜伦·明翼",
    },
    [240662] = {
        name = "助战的圣骑士",
    },
    [240691] = {
        name = "殆希莫斯",
    },
    [240747] = {
        name = "阿隆索斯·法奥",
    },
    [240839] = {
        name = "哈加尔",
    },
    [240975] = {
        name = "娜玛姬",
    },
    [240976] = {
        name = "卡格拉",
    },
    [240977] = {
        name = "扎卡希",
    },
    [241045] = {
        name = "库帕尔",
    },
    [241070] = {
        name = "奥威娜",
    },
    [241072] = {
        name = "吉加尼姬",
    },
    [241082] = {
        name = "沧桑的托伦多",
    },
    [241109] = {
        name = "阿拉托尔",
    },
    [241130] = {
        name = "哈杜伦·明翼",
    },
    [241205] = {
        name = "阿拉托尔",
    },
    [241206] = {
        name = "洛瑟玛·塞隆",
    },
    [241219] = {
        name = "木匠阿扎伊",
    },
    [241308] = {
        name = "女伯爵莉亚德琳",
    },
    [241393] = {
        name = "魔导师阿拉蒂斯",
    },
    [241398] = {
        name = "魔导师晨炎",
    },
    [241399] = {
        name = "捷斯",
    },
    [241400] = {
        name = "魔导师阿拉蒂斯",
    },
    [241401] = {
        name = "捷斯",
    },
    [241402] = {
        name = "捷斯",
    },
    [241403] = {
        name = "捷斯",
    },
    [241404] = {
        name = "捷斯",
    },
    [241405] = {
        name = "魔导师阿拉蒂斯",
    },
    [241553] = {
        name = "瓦尔利斯·阳羽",
    },
    [241620] = {
        name = "二度流放的图尔阿玛",
    },
    [241629] = {
        name = "哈南",
    },
    [241654] = {
        name = "大主教图拉扬",
    },
    [241677] = {
        name = "女伯爵莉亚德琳的影像",
    },
    [241704] = {
        name = "奥威娜",
    },
    [241742] = {
        name = "奥威娜",
    },
    [242014] = {
        name = "夏安娜",
    },
    [242120] = {
        name = "达纳斯·托尔贝恩",
    },
    [242143] = {
        name = "魔导师乌布里克",
    },
    [242233] = {
        name = "虚空来客朱拉斯",
    },
    [242358] = {
        name = "库利",
    },
    [242383] = {
        name = "求知者克里卡什",
    },
    [242391] = {
        name = "求知者克里卡什",
    },
    [242393] = {
        name = "特里谢",
    },
    [242394] = {
        name = "阿玛克希",
    },
    [242433] = {
        name = "阿拉托尔",
    },
    [242592] = {
        name = "奥威娜",
    },
    [242593] = {
        name = "蒙特·加兹鲁维",
    },
    [242650] = {
        name = "奈雷亚",
    },
    [242688] = {
        name = "鲁玛",
    },
    [242689] = {
        name = "卡玛瑞",
    },
    [242691] = {
        name = "库利",
    },
    [242700] = {
        name = "克利雅·长明",
    },
    [242802] = {
        name = "萨兰蒂亚",
    },
    [242803] = {
        name = "泰莉亚·弗塔根",
    },
    [242811] = {
        name = "十字军战士昏日",
    },
    [242882] = {
        name = "奥威娜",
    },
    [242889] = {
        name = "泰莉亚·弗塔根",
    },
    [242890] = {
        name = "萨兰蒂亚",
    },
    [242893] = {
        name = "萨兰蒂亚",
    },
    [242894] = {
        name = "泰莉亚·弗塔根",
    },
    [242897] = {
        name = "萨兰蒂亚",
    },
    [242898] = {
        name = "泰莉亚·弗塔根",
    },
    [243053] = {
        name = "奈雷亚",
    },
    [243091] = {
        name = "阿拉托尔",
    },
    [243226] = {
        name = "肝菌",
    },
    [243290] = {
        name = "萨维",
    },
    [243884] = {
        name = "卡萨梅，祖尔阿沙",
    },
    [243907] = {
        name = "殆希莫斯",
    },
    [243984] = {
        name = "阿拉托尔",
    },
    [244163] = {
        name = "舒阿",
    },
    [244242] = {
        name = "恩里阿安",
    },
    [244394] = {
        name = "恩里阿安",
    },
    [244419] = {
        name = "阿玛拉克",
    },
    [244422] = {
        name = "祖尔加拉",
    },
    [244438] = {
        name = "祖尔加拉",
    },
    [244443] = {
        name = "贝拉斯·黎明之刃",
    },
    [244454] = {
        name = "贝拉斯·黎明之刃",
    },
    [244455] = {
        name = "阿玛拉克",
    },
    [244473] = {
        name = "恩里阿安",
    },
    [244493] = {
        name = "阿瓦菈",
    },
    [244499] = {
        name = "琪法安",
    },
    [244516] = {
        name = "琪法安",
    },
    [244522] = {
        name = "沃拉安",
    },
    [244588] = {
        name = "祖尔加拉",
    },
    [244591] = {
        name = "沃恩扎拉",
    },
    [244592] = {
        name = "祖尔加拉",
    },
    [244929] = {
        name = "殆希莫斯",
    },
    [244948] = {
        name = "殆希莫斯",
    },
    [245004] = {
        name = "安忒诺里安勋爵",
    },
    [245166] = {
        name = "奈雷亚",
    },
    [245186] = {
        name = "烈日行者德兹科",
    },
    [245192] = {
        name = "凯尔图斯·血焚",
    },
    [245200] = {
        name = "耶泰尼斯·射日者",
    },
    [245201] = {
        name = "魔导师亚隆尼斯",
    },
    [245202] = {
        name = "游侠汉诺维亚",
    },
    [245270] = {
        name = "祖尔加拉",
    },
    [245285] = {
        name = "萨林迪尔教官",
    },
    [245297] = {
        name = "贝拉斯·黎明之刃",
    },
    [245418] = {
        name = "贝拉斯·黎明之刃",
    },
    [245637] = {
        name = "苏米拉",
    },
    [245639] = {
        name = "苏米拉",
    },
    [245664] = {
        name = "利拉祖",
    },
    [245669] = {
        name = "杰妮拉",
    },
    [245745] = {
        name = "瓦德卡尔·索莱尔",
    },
    [245748] = {
        name = "卡莉耶·索莱尔",
    },
    [245878] = {
        name = "骑士阿纳伊斯",
    },
    [245944] = {
        name = "助战的血骑士",
    },
    [245986] = {
        name = "苏米拉",
    },
    [246035] = {
        name = "骑士阿纳伊斯",
    },
    [246208] = {
        name = "布拉科",
    },
    [246557] = {
        name = "凯尔图斯·血焚",
    },
    [246607] = {
        name = "绿语者希恩娜",
    },
    [246727] = {
        name = "拉文尼阿",
    },
    [246777] = {
        name = "吉卡勒",
    },
    [246806] = {
        name = "奥术师泰尔敏",
    },
    [246866] = {
        name = "晨行者队长",
    },
    [247014] = {
        name = "尼嘉·断齿",
    },
    [247245] = {
        name = "布拉科",
    },
    [247251] = {
        name = "尼嘉·断齿",
    },
    [247254] = {
        name = "调和者亚曼伽",
    },
    [247299] = {
        name = "烈日行者德兹科",
    },
    [247374] = {
        name = "兹尔丹",
    },
    [247394] = {
        name = "游侠瓦尔萨琳",
    },
    [247395] = {
        name = "游侠阿斯特雷",
    },
    [247424] = {
        name = "夏安娜",
    },
    [247500] = {
        name = "奥术师泰尔敏",
    },
    [247503] = {
        name = "哈斯温里奥",
    },
    [247593] = {
        name = "晨行者队长",
    },
    [247596] = {
        name = "奥术师泰尔敏",
    },
    [247640] = {
        name = "绍麦尔",
    },
    [247645] = {
        name = "索尔文·明缝",
    },
    [247658] = {
        name = "娜耶莉",
    },
    [247664] = {
        name = "暗谷女士",
    },
    [247674] = {
        name = "暗谷女士",
    },
    [247736] = {
        name = "娜耶莉",
    },
    [247936] = {
        name = "尤瑞伦",
    },
    [248015] = {
        name = "煞戎努斯",
    },
    [248040] = {
        name = "研究院伏里吉恩",
    },
    [248072] = {
        name = "裂隙之刃阿斯崔",
    },
    [248121] = {
        name = "弗戈",
    },
    [248123] = {
        name = "弗利戈",
    },
    [248250] = {
        name = "库德兰·蛮锤",
    },
    [248307] = {
        name = "游侠瓦尔萨琳",
    },
    [248616] = {
        name = "裂隙之刃阿斯崔",
    },
    [248631] = {
        name = "指挥官科鲁斯·山脉之拳",
    },
    [248657] = {
        name = "佩尔娜·断齿",
    },
    [248787] = {
        name = "坦辛",
    },
    [248838] = {
        name = "达克佐尔",
    },
    [248880] = {
        name = "饥渴的虚空行者",
    },
    [248881] = {
        name = "斥候奈芬娜",
    },
    [248886] = {
        name = "哈加尔",
    },
    [248894] = {
        name = "斥候奈芬娜",
    },
    [249034] = {
        name = "裂隙行者赛德拉斯",
    },
    [249045] = {
        name = "裂隙之刃阿斯崔",
    },
    [249106] = {
        name = "枯木斥候",
    },
    [249130] = {
        name = "朗多雷幽刃剑士",
    },
    [249337] = {
        name = "塔兰德拉·晨灵",
    },
    [249426] = {
        name = "利米恩·邦卡斯科",
    },
    [249653] = {
        name = "祖尔加拉",
    },
    [249917] = {
        name = "哈瓦札尔",
    },
    [249935] = {
        name = "兰莱尔·诺克萨",
    },
    [250068] = {
        name = "神灵代言人托布伊",
    },
    [250196] = {
        name = "国王姆嘎姆嘎",
    },
    [250197] = {
        name = "助手噶格噶格",
    },
    [250291] = {
        name = "游侠克雷安",
    },
    [250298] = {
        name = "努米亚·高登",
    },
    [250388] = {
        name = "哈斯温里奥",
    },
    [250677] = {
        name = "兰莱尔·诺克萨",
    },
    [250791] = {
        name = "特瑞尔·血命",
    },
    [250798] = {
        name = "阿勒希尔·黎明之血",
    },
    [250888] = {
        name = "索尔文·明缝",
    },
    [251258] = {
        name = "安妮",
    },
    [251277] = {
        name = "兰莱尔·诺克萨",
    },
    [251355] = {
        name = "阿隆索斯·法奥",
    },
    [251522] = {
        name = "艾达戈",
    },
    [251669] = {
        name = "利拉祖",
    },
    [251715] = {
        name = "图克图克",
    },
    [251723] = {
        name = "欣尼",
    },
    [251891] = {
        name = "纠缠之影",
    },
    [252109] = {
        name = "食魂者阿莱利",
    },
    [252110] = {
        name = "蕾欧娜·涉暗",
    },
    [252495] = {
        name = "哈加尔",
    },
    [252496] = {
        name = "哈加尔",
    },
    [252497] = {
        name = "哈加尔",
    },
    [252500] = {
        name = "游侠泰雷努斯",
    },
    [252510] = {
        name = "奥林·迷光",
    },
    [252807] = {
        name = "先锋圣骑士",
    },
    [252853] = {
        name = "殆希莫斯",
    },
    [252871] = {
        name = "谢尼亚，祖尔阿沙",
    },
    [252872] = {
        name = "奥恩尚",
    },
    [252947] = {
        name = "莱希卡斯",
    },
    [252949] = {
        name = "裂隙之刃麦拉",
    },
    [253015] = {
        name = "魔导师塞伊丹娜",
    },
    [253038] = {
        name = "裂隙行者阿雷申",
    },
    [253058] = {
        name = "深受喜爱的书典",
    },
    [253087] = {
        name = "冷光尸体",
    },
    [253105] = {
        name = "哈南",
    },
    [253125] = {
        name = "库德兰·蛮锤",
    },
    [253312] = {
        name = "内塔尔",
    },
    [253390] = {
        name = "科坦",
    },
    [253392] = {
        name = "阿卡齐",
    },
    [253433] = {
        name = "科坦",
    },
    [253468] = {
        name = "德拉森",
    },
    [253523] = {
        name = "骑士阿纳伊斯",
    },
    [253948] = {
        name = "蕾欧娜·涉暗",
    },
    [253997] = {
        name = "凯尔沃卓",
    },
    [254012] = {
        name = "奥林·迷光",
    },
    [254014] = {
        name = "奥林·迷光",
    },
    [254142] = {
        name = "伊科拉妮",
    },
    [254144] = {
        name = "安贾莉",
    },
    [254146] = {
        name = "拉坎",
    },
    [254402] = {
        name = "斥候菲拉纳斯",
    },
    [254488] = {
        name = "贾克萨里",
    },
    [254491] = {
        name = "卡哈妮",
    },
    [254509] = {
        name = "莱希卡斯",
    },
    [254510] = {
        name = "莱希卡斯",
    },
    [254513] = {
        name = "裂隙之刃麦拉",
    },
    [254665] = {
        name = "长老多鲁",
    },
    [254716] = {
        name = "奈伦妲",
    },
    [254719] = {
        name = "坎扎",
    },
    [254783] = {
        name = "沧桑的托伦多",
    },
    [254827] = {
        name = "长老多鲁",
    },
    [254903] = {
        name = "莫塔",
    },
    [255406] = {
        name = "新兵达拉克",
    },
    [255822] = {
        name = "奥威娜",
    },
    [255852] = {
        name = "斥候泽尔坎拉",
    },
    [256206] = {
        name = "有知觉的虚空行者",
    },
    [256285] = {
        name = "食魂者阿莱利",
    },
    [256796] = {
        name = "兹尔丹",
    },
    [256813] = {
        name = "兹尔丹",
    },
    [256815] = {
        name = "维迪奥斯",
    },
    [256867] = {
        name = "哀伤的阿曼尼",
    },
    [256901] = {
        name = "兹尔丹",
    },
    [257002] = {
        name = "吉卡勒",
    },
    [257092] = {
        name = "老泰欧赞",
    },
    [257384] = {
        name = "沮丧的魔导师",
    },
    [257393] = {
        name = "芬妮·影星",
    },
    [257426] = {
        name = "指导者安瑟隆",
    },
    [257478] = {
        name = "达古尔",
    },
    [257479] = {
        name = "阿玛瑞·林顿",
    },
    [258014] = {
        name = "坎扎",
    },
    [258363] = {
        name = "坎扎",
    },
    [258950] = {
        name = "芙卡拉",
    },
})
]])()
