----- AUTO GENERATED - DO NOT EDIT

if GetLocale() ~= "zhTW" then
    return
end

loadstring([[
BtWQuestsDatabase:UpdateNPCsTable({
    [235386] = {
        name = "博學者奧姆里克",
    },
    [235389] = {
        name = "艾蘭里亞‧風行者",
    },
    [235394] = {
        name = "洛斯拉賽恩",
    },
    [235405] = {
        name = "博學者奧姆里克",
    },
    [235411] = {
        name = "博學者奧姆里克",
    },
    [235469] = {
        name = "阿拉特",
    },
    [235486] = {
        name = "洛斯拉賽恩",
    },
    [235502] = {
        name = "艾蘭里亞‧風行者",
    },
    [235503] = {
        name = "阿拉特",
    },
    [235504] = {
        name = "洛斯拉賽恩",
    },
    [235522] = {
        name = "洛斯拉賽恩",
    },
    [235530] = {
        name = "洛斯拉賽恩",
    },
    [235532] = {
        name = "艾蘭里亞‧風行者",
    },
    [235535] = {
        name = "洛斯拉賽恩",
    },
    [235606] = {
        name = "洛斯拉賽恩",
    },
    [235633] = {
        name = "戴西蒙斯",
    },
    [235648] = {
        name = "洛斯拉賽恩",
    },
    [235649] = {
        name = "洛斯拉賽恩",
    },
    [235650] = {
        name = "戴西蒙斯",
    },
    [235660] = {
        name = "艾蘭里亞‧風行者",
    },
    [235697] = {
        name = "戴西蒙斯",
    },
    [235698] = {
        name = "博學者奧姆里克",
    },
    [235713] = {
        name = "洛斯拉賽恩",
    },
    [235715] = {
        name = "艾蘭里亞‧風行者",
    },
    [235717] = {
        name = "艾蘭里亞‧風行者",
    },
    [235724] = {
        name = "阿拉特",
    },
    [235763] = {
        name = "艾蘭里亞‧風行者",
    },
    [235765] = {
        name = "艾蘭里亞‧風行者",
    },
    [235787] = {
        name = "洛索瑪‧塞隆",
    },
    [236087] = {
        name = "博學者奧姆里克",
    },
    [236099] = {
        name = "莉雅德倫女士",
    },
    [236100] = {
        name = "阿拉特",
    },
    [236126] = {
        name = "祖爾賈拉",
    },
    [236132] = {
        name = "阿拉特",
    },
    [236140] = {
        name = "祖爾賈拉",
    },
    [236141] = {
        name = "祖爾賈拉",
    },
    [236143] = {
        name = "莉雅德倫女士",
    },
    [236147] = {
        name = "祖爾賈拉",
    },
    [236155] = {
        name = "祖爾賈拉",
    },
    [236162] = {
        name = "祖爾賈拉",
    },
    [236363] = {
        name = "博學者奧姆里克",
    },
    [236391] = {
        name = "阿拉特",
    },
    [236436] = {
        name = "莉雅德倫女士",
    },
    [236468] = {
        name = "祖爾賈拉",
    },
    [236485] = {
        name = "莉雅德倫女士",
    },
    [236522] = {
        name = "祖爾詹",
    },
    [236540] = {
        name = "祖爾詹",
    },
    [236541] = {
        name = "祖爾賈拉",
    },
    [236542] = {
        name = "莉雅德倫女士",
    },
    [236558] = {
        name = "祖爾詹",
    },
    [236559] = {
        name = "祖爾賈拉",
    },
    [236567] = {
        name = "阿拉特",
    },
    [236572] = {
        name = "洛索瑪‧塞隆",
    },
    [236587] = {
        name = "祖爾賈拉",
    },
    [236601] = {
        name = "祖爾賈拉",
    },
    [236602] = {
        name = "祖爾賈拉",
    },
    [236610] = {
        name = "阿拉特",
    },
    [236612] = {
        name = "洛索瑪‧塞隆",
    },
    [236659] = {
        name = "祖爾賈拉",
    },
    [236686] = {
        name = "阿拉特",
    },
    [236687] = {
        name = "博學者奧姆里克",
    },
    [236692] = {
        name = "莉雅德倫女士",
    },
    [236693] = {
        name = "莉雅德倫女士",
    },
    [236704] = {
        name = "歐薇娜",
    },
    [236716] = {
        name = "阿拉特",
    },
    [236730] = {
        name = "博學者奧姆里克",
    },
    [236737] = {
        name = "阿拉特",
    },
    [236739] = {
        name = "博學者蘭德拉‧晨行者",
    },
    [236743] = {
        name = "歐薇娜",
    },
    [236779] = {
        name = "洛索瑪‧塞隆",
    },
    [236896] = {
        name = "洛索瑪‧塞隆",
    },
    [236903] = {
        name = "歐薇娜",
    },
    [236906] = {
        name = "大主教圖拉揚",
    },
    [236908] = {
        name = "麥崔恩‧晨殞",
    },
    [236930] = {
        name = "卡莉雅‧永明",
    },
    [236945] = {
        name = "艾蘭里亞‧風行者",
    },
    [236961] = {
        name = "洛索瑪‧塞隆",
    },
    [236964] = {
        name = "阿拉特",
    },
    [236978] = {
        name = "大主教圖拉揚",
    },
    [237222] = {
        name = "聖光先鋒",
    },
    [237224] = {
        name = "伊崔格",
    },
    [237234] = {
        name = "歐薇娜",
    },
    [237236] = {
        name = "阿瑪拉克",
    },
    [237240] = {
        name = "博學者奧姆里克",
    },
    [237253] = {
        name = "莉雅德倫女士",
    },
    [237268] = {
        name = "庫德蘭‧蠻錘",
    },
    [237277] = {
        name = "莉雅德倫女士",
    },
    [237278] = {
        name = "莉雅德倫女士",
    },
    [237284] = {
        name = "阿瑪拉克",
    },
    [237325] = {
        name = "歐薇娜",
    },
    [237332] = {
        name = "哈嘉爾",
    },
    [237345] = {
        name = "赫杜倫‧亮翼",
    },
    [237356] = {
        name = "歐薇娜",
    },
    [237361] = {
        name = "歐薇娜",
    },
    [237433] = {
        name = "洛索瑪‧塞隆",
    },
    [237465] = {
        name = "赫杜倫‧亮翼",
    },
    [237480] = {
        name = "歐薇娜",
    },
    [237483] = {
        name = "歐薇娜",
    },
    [237502] = {
        name = "阿拉特",
    },
    [237508] = {
        name = "阿拉特",
    },
    [237511] = {
        name = "阿隆索斯‧法奧",
    },
    [237565] = {
        name = "阿隆索斯‧法奧",
    },
    [237567] = {
        name = "哈嘉爾",
    },
    [237572] = {
        name = "哈嘉爾",
    },
    [237594] = {
        name = "麥斯威爾‧泰羅索斯領主",
    },
    [237601] = {
        name = "阿隆索斯‧法奧",
    },
    [237602] = {
        name = "阿隆索斯‧法奧",
    },
    [237786] = {
        name = "歐薇娜",
    },
    [237787] = {
        name = "赫杜倫‧亮翼",
    },
    [237860] = {
        name = "歐薇娜",
    },
    [237873] = {
        name = "泰塔勒‧金刃",
    },
    [237904] = {
        name = "泰塔勒‧金刃",
    },
    [237905] = {
        name = "泰塔勒‧金刃",
    },
    [237953] = {
        name = "羅亞語者席塔",
    },
    [237956] = {
        name = "庫爾吉",
    },
    [238083] = {
        name = "遠行者賽狄娜",
    },
    [238084] = {
        name = "哈利斯‧光流",
    },
    [238296] = {
        name = "艾蘭里亞‧風行者",
    },
    [238490] = {
        name = "萊瑟拉‧暮哀",
    },
    [238505] = {
        name = "萊瑟拉‧暮哀",
    },
    [238730] = {
        name = "塔瑞納爾‧日擊",
    },
    [238732] = {
        name = "基德溫‧金辮",
    },
    [238748] = {
        name = "基德溫‧金辮",
    },
    [239368] = {
        name = "萊瑟拉‧暮哀",
    },
    [239574] = {
        name = "艾蘭里亞‧風行者",
    },
    [239650] = {
        name = "祖拉夏‧卡薩梅",
    },
    [239720] = {
        name = "露西亞‧破夜者",
    },
    [239795] = {
        name = "祖拉夏‧卡薩梅",
    },
    [240033] = {
        name = "祖爾賈拉",
    },
    [240034] = {
        name = "祖爾賈拉",
    },
    [240037] = {
        name = "祖爾賈拉",
    },
    [240039] = {
        name = "莉雅德倫女士",
    },
    [240186] = {
        name = "祖爾賈拉",
    },
    [240215] = {
        name = "祖爾賈拉",
    },
    [240216] = {
        name = "祖爾賈拉",
    },
    [240240] = {
        name = "阿隆索斯‧法奧",
    },
    [240403] = {
        name = "博學者梅勒鐸",
    },
    [240408] = {
        name = "遊俠瓦迪斯",
    },
    [240422] = {
        name = "博學者梅勒鐸",
    },
    [240521] = {
        name = "木匠艾哲",
    },
    [240523] = {
        name = "偵察地圖",
    },
    [240533] = {
        name = "歐薇娜",
    },
    [240630] = {
        name = "赫杜倫‧亮翼",
    },
    [240662] = {
        name = "協助的聖騎士",
    },
    [240691] = {
        name = "戴西蒙斯",
    },
    [240747] = {
        name = "阿隆索斯‧法奧",
    },
    [240839] = {
        name = "哈嘉爾",
    },
    [240975] = {
        name = "娜瑪琪",
    },
    [240976] = {
        name = "卡甲拉",
    },
    [240977] = {
        name = "薩卡許",
    },
    [241045] = {
        name = "庫帕爾",
    },
    [241070] = {
        name = "歐薇娜",
    },
    [241072] = {
        name = "琪詹吉",
    },
    [241082] = {
        name = "斑白的托倫多",
    },
    [241109] = {
        name = "阿拉特",
    },
    [241130] = {
        name = "赫杜倫‧亮翼",
    },
    [241205] = {
        name = "阿拉特",
    },
    [241206] = {
        name = "洛索瑪‧塞隆",
    },
    [241219] = {
        name = "木匠艾哲",
    },
    [241308] = {
        name = "莉雅德倫女士",
    },
    [241393] = {
        name = "博學者阿拉迪斯",
    },
    [241398] = {
        name = "博學者晨焰",
    },
    [241399] = {
        name = "賈厄斯",
    },
    [241400] = {
        name = "博學者阿拉迪斯",
    },
    [241401] = {
        name = "賈厄斯",
    },
    [241402] = {
        name = "賈厄斯",
    },
    [241403] = {
        name = "賈厄斯",
    },
    [241404] = {
        name = "賈厄斯",
    },
    [241405] = {
        name = "博學者阿拉迪斯",
    },
    [241553] = {
        name = "瓦莉絲‧日羽",
    },
    [241620] = {
        name = "『二度流放者』圖阿瑪",
    },
    [241629] = {
        name = "哈南",
    },
    [241654] = {
        name = "大主教圖拉揚",
    },
    [241677] = {
        name = "莉雅德倫女士的影像",
    },
    [241704] = {
        name = "歐薇娜",
    },
    [241742] = {
        name = "歐薇娜",
    },
    [242014] = {
        name = "查娜",
    },
    [242120] = {
        name = "達納斯‧托爾貝恩",
    },
    [242143] = {
        name = "博學者奧姆里克",
    },
    [242233] = {
        name = "『虛空使』裘拉斯",
    },
    [242358] = {
        name = "庫里",
    },
    [242383] = {
        name = "追尋者克里凱仕",
    },
    [242391] = {
        name = "追尋者克里凱仕",
    },
    [242393] = {
        name = "翠希",
    },
    [242394] = {
        name = "阿瑪瑟",
    },
    [242433] = {
        name = "阿拉特",
    },
    [242592] = {
        name = "歐薇娜",
    },
    [242593] = {
        name = "蒙特‧加茲魯維",
    },
    [242650] = {
        name = "奈蕾亞",
    },
    [242688] = {
        name = "露瑪",
    },
    [242689] = {
        name = "卡瑪瑞",
    },
    [242691] = {
        name = "庫里",
    },
    [242700] = {
        name = "卡莉雅‧永明",
    },
    [242802] = {
        name = "瑟蘭德雅",
    },
    [242803] = {
        name = "泰莉亞‧弗塔根",
    },
    [242811] = {
        name = "十字軍暗日",
    },
    [242882] = {
        name = "歐薇娜",
    },
    [242889] = {
        name = "泰莉亞‧弗塔根",
    },
    [242890] = {
        name = "瑟蘭德雅",
    },
    [242893] = {
        name = "瑟蘭德雅",
    },
    [242894] = {
        name = "泰莉亞‧弗塔根",
    },
    [242897] = {
        name = "瑟蘭德雅",
    },
    [242898] = {
        name = "泰莉亞‧弗塔根",
    },
    [243053] = {
        name = "奈蕾亞",
    },
    [243091] = {
        name = "阿拉特",
    },
    [243226] = {
        name = "柏特斯",
    },
    [243290] = {
        name = "薩維",
    },
    [243884] = {
        name = "祖拉夏‧卡薩梅",
    },
    [243907] = {
        name = "戴西蒙斯",
    },
    [243984] = {
        name = "阿拉特",
    },
    [244163] = {
        name = "奇雅",
    },
    [244242] = {
        name = "恩萊亞",
    },
    [244394] = {
        name = "恩萊亞",
    },
    [244419] = {
        name = "阿瑪拉克",
    },
    [244422] = {
        name = "祖爾賈拉",
    },
    [244438] = {
        name = "祖爾賈拉",
    },
    [244443] = {
        name = "貝拉斯‧曦刃",
    },
    [244454] = {
        name = "貝拉斯‧曦刃",
    },
    [244455] = {
        name = "阿瑪拉克",
    },
    [244473] = {
        name = "恩萊亞",
    },
    [244493] = {
        name = "阿娃菈",
    },
    [244499] = {
        name = "齊凡",
    },
    [244516] = {
        name = "齊凡",
    },
    [244522] = {
        name = "維蘭",
    },
    [244588] = {
        name = "祖爾賈拉",
    },
    [244591] = {
        name = "馮薩拉",
    },
    [244592] = {
        name = "祖爾賈拉",
    },
    [244929] = {
        name = "戴西蒙斯",
    },
    [244948] = {
        name = "戴西蒙斯",
    },
    [245004] = {
        name = "安諾里恩領主",
    },
    [245166] = {
        name = "奈蕾亞",
    },
    [245186] = {
        name = "日行者戴斯可",
    },
    [245192] = {
        name = "凱爾圖斯‧血燃",
    },
    [245200] = {
        name = "傑斯賽尼斯‧擊日者",
    },
    [245201] = {
        name = "博學者賈若尼斯",
    },
    [245202] = {
        name = "遊俠哈諾薇亞",
    },
    [245270] = {
        name = "祖爾賈拉",
    },
    [245285] = {
        name = "講師薩蘭迪爾",
    },
    [245297] = {
        name = "貝拉斯‧曦刃",
    },
    [245418] = {
        name = "貝拉斯‧曦刃",
    },
    [245637] = {
        name = "蘇梅拉",
    },
    [245639] = {
        name = "蘇梅拉",
    },
    [245664] = {
        name = "莉拉菊",
    },
    [245669] = {
        name = "潔妮拉",
    },
    [245745] = {
        name = "瓦德卡‧索勒",
    },
    [245748] = {
        name = "卡莉爾‧索勒",
    },
    [245878] = {
        name = "騎士安娜絲",
    },
    [245944] = {
        name = "協助的血騎士",
    },
    [245986] = {
        name = "蘇梅拉",
    },
    [246035] = {
        name = "騎士安娜絲",
    },
    [246208] = {
        name = "布拉寇",
    },
    [246557] = {
        name = "凱爾圖斯‧血燃",
    },
    [246607] = {
        name = "綠語者席娜",
    },
    [246727] = {
        name = "拉凡尼亞",
    },
    [246777] = {
        name = "姬蔻",
    },
    [246806] = {
        name = "秘法師泰明",
    },
    [246866] = {
        name = "曦奔隊長",
    },
    [247014] = {
        name = "妮嘉‧斷齒",
    },
    [247245] = {
        name = "布拉寇",
    },
    [247251] = {
        name = "妮嘉‧斷齒",
    },
    [247254] = {
        name = "混合者賈曼加",
    },
    [247299] = {
        name = "日行者戴斯可",
    },
    [247374] = {
        name = "齊亞丹",
    },
    [247394] = {
        name = "遊俠瓦薩林",
    },
    [247395] = {
        name = "遊俠阿斯特雷",
    },
    [247424] = {
        name = "查娜",
    },
    [247500] = {
        name = "秘法師泰明",
    },
    [247503] = {
        name = "海斯維利‧桑凱",
    },
    [247593] = {
        name = "曦奔隊長",
    },
    [247596] = {
        name = "秘法師泰明",
    },
    [247640] = {
        name = "小莫",
    },
    [247645] = {
        name = "索爾溫‧亮縫",
    },
    [247658] = {
        name = "納耶里",
    },
    [247664] = {
        name = "暗幽谷女士",
    },
    [247674] = {
        name = "暗幽谷女士",
    },
    [247736] = {
        name = "納耶里",
    },
    [247936] = {
        name = "尤蕾蘭",
    },
    [248015] = {
        name = "查洛納斯",
    },
    [248040] = {
        name = "研究員威里吉恩",
    },
    [248072] = {
        name = "裂刃奧斯崔",
    },
    [248121] = {
        name = "皮戈",
    },
    [248123] = {
        name = "弗力克",
    },
    [248250] = {
        name = "庫德蘭‧蠻錘",
    },
    [248307] = {
        name = "遊俠瓦薩林",
    },
    [248616] = {
        name = "裂刃奧斯崔",
    },
    [248631] = {
        name = "寇魯斯‧山拳指揮官",
    },
    [248657] = {
        name = "佩爾娜‧斷齒",
    },
    [248787] = {
        name = "坦金",
    },
    [248838] = {
        name = "達克佐",
    },
    [248880] = {
        name = "飢餓的虛無行者",
    },
    [248881] = {
        name = "斥候內菲娜",
    },
    [248886] = {
        name = "哈嘉爾",
    },
    [248894] = {
        name = "斥候內菲娜",
    },
    [249034] = {
        name = "裂隙行者賽德拉斯",
    },
    [249045] = {
        name = "裂刃奧斯崔",
    },
    [249106] = {
        name = "枯木斥侯",
    },
    [249130] = {
        name = "刃多雷鬼刃",
    },
    [249337] = {
        name = "塔蘭卓‧晨靈",
    },
    [249426] = {
        name = "里米恩‧金桶",
    },
    [249653] = {
        name = "祖爾賈拉",
    },
    [249917] = {
        name = "哈瓦札",
    },
    [249935] = {
        name = "蘭蕾‧諾薩",
    },
    [250068] = {
        name = "羅亞語者托布伊",
    },
    [250196] = {
        name = "莫戈莫戈大王",
    },
    [250197] = {
        name = "助手嘎咕嘎咕",
    },
    [250291] = {
        name = "遊俠克羅南",
    },
    [250298] = {
        name = "努米雅‧黃金",
    },
    [250388] = {
        name = "海斯維利‧桑凱",
    },
    [250677] = {
        name = "蘭蕾‧諾薩",
    },
    [250791] = {
        name = "特勒‧血命",
    },
    [250798] = {
        name = "艾爾索‧晨血",
    },
    [250888] = {
        name = "索爾溫‧亮縫",
    },
    [251258] = {
        name = "安妮",
    },
    [251277] = {
        name = "蘭蕾‧諾薩",
    },
    [251355] = {
        name = "阿隆索斯‧法奧",
    },
    [251522] = {
        name = "伊達戈",
    },
    [251669] = {
        name = "莉拉菊",
    },
    [251715] = {
        name = "圖圖",
    },
    [251723] = {
        name = "吉尼",
    },
    [251891] = {
        name = "滯延之影",
    },
    [252109] = {
        name = "『噬魂者』艾萊莉",
    },
    [252110] = {
        name = "雷歐娜‧暗行",
    },
    [252495] = {
        name = "哈嘉爾",
    },
    [252496] = {
        name = "哈嘉爾",
    },
    [252497] = {
        name = "哈嘉爾",
    },
    [252500] = {
        name = "遊俠泰雷努斯",
    },
    [252510] = {
        name = "歐林‧逸光",
    },
    [252807] = {
        name = "先鋒聖騎士",
    },
    [252853] = {
        name = "戴西蒙斯",
    },
    [252871] = {
        name = "祖拉夏‧夏妮雅",
    },
    [252872] = {
        name = "歐恩肖",
    },
    [252947] = {
        name = "萊希卡斯",
    },
    [252949] = {
        name = "裂刃梅拉",
    },
    [253015] = {
        name = "博學者賽戴娜",
    },
    [253038] = {
        name = "裂隙行者亞拉宣",
    },
    [253058] = {
        name = "熱門典籍",
    },
    [253087] = {
        name = "冷光屍體",
    },
    [253105] = {
        name = "哈南",
    },
    [253125] = {
        name = "庫德蘭‧蠻錘",
    },
    [253312] = {
        name = "奈塔",
    },
    [253390] = {
        name = "科坦",
    },
    [253392] = {
        name = "阿卡齊",
    },
    [253433] = {
        name = "科坦",
    },
    [253468] = {
        name = "崔森",
    },
    [253523] = {
        name = "騎士安娜絲",
    },
    [253948] = {
        name = "雷歐娜‧暗行",
    },
    [253997] = {
        name = "凱爾沃裘",
    },
    [254012] = {
        name = "歐林‧逸光",
    },
    [254014] = {
        name = "歐林‧逸光",
    },
    [254142] = {
        name = "愛菈妮",
    },
    [254144] = {
        name = "安嘉莉",
    },
    [254146] = {
        name = "拉坎",
    },
    [254402] = {
        name = "斥侯菲拉那斯",
    },
    [254488] = {
        name = "賈扎里",
    },
    [254491] = {
        name = "卡哈妮雅",
    },
    [254509] = {
        name = "萊希卡斯",
    },
    [254510] = {
        name = "萊希卡斯",
    },
    [254513] = {
        name = "裂刃梅拉",
    },
    [254665] = {
        name = "多魯長老",
    },
    [254716] = {
        name = "娜魯達",
    },
    [254719] = {
        name = "坎莎",
    },
    [254783] = {
        name = "斑白的托倫多",
    },
    [254827] = {
        name = "多魯長老",
    },
    [254903] = {
        name = "莫塔",
    },
    [255406] = {
        name = "新兵達拉克",
    },
    [255822] = {
        name = "歐薇娜",
    },
    [255852] = {
        name = "斥候潔兒坎菈",
    },
    [256206] = {
        name = "有意識的虛無行者",
    },
    [256285] = {
        name = "『噬魂者』艾萊莉",
    },
    [256796] = {
        name = "齊亞丹",
    },
    [256813] = {
        name = "齊亞丹",
    },
    [256815] = {
        name = "維迪奧斯",
    },
    [256867] = {
        name = "哀悼的阿曼尼人",
    },
    [256901] = {
        name = "齊亞丹",
    },
    [257002] = {
        name = "姬蔻",
    },
    [257092] = {
        name = "老特歐詹",
    },
    [257384] = {
        name = "沮喪的博學者",
    },
    [257393] = {
        name = "芬安‧影星",
    },
    [257426] = {
        name = "導師安西歐",
    },
    [257478] = {
        name = "達古爾",
    },
    [257479] = {
        name = "阿曼莉‧林登",
    },
    [258014] = {
        name = "坎莎",
    },
    [258363] = {
        name = "坎莎",
    },
    [258950] = {
        name = "瓦卡菈",
    },
})
]])()
