----- AUTO GENERATED - DO NOT EDIT

if GetLocale() ~= "zhTW" then
    return
end

loadstring([[
BtWQuestsDatabase:UpdateQuestsTable({
    [86509] = {
        name = "非敵即友",
    },
    [86510] = {
        name = "半影之居",
    },
    [86511] = {
        name = "深淵之緣",
    },
    [86512] = {
        name = "收割",
    },
    [86513] = {
        name = "力挽狂瀾",
    },
    [86514] = {
        name = "深淵女士",
    },
    [86515] = {
        name = "無盡飢渴",
    },
    [86516] = {
        name = "全都成了獵物",
    },
    [86517] = {
        name = "消逝在虛無之中",
    },
    [86518] = {
        name = "掠食披肩",
    },
    [86519] = {
        name = "深淵戰記",
    },
    [86520] = {
        name = "狩獵聖光",
    },
    [86521] = {
        name = "奧核點瑟納斯：侵蝕",
    },
    [86522] = {
        name = "日光再現",
    },
    [86528] = {
        name = "裂開的全息鑰匙",
    },
    [86530] = {
        name = "第一，容器",
    },
    [86531] = {
        name = "工作中斷",
    },
    [86536] = {
        name = "可靠的敵人",
    },
    [86537] = {
        name = "不穩定的網路",
    },
    [86538] = {
        name = "第二，燃料",
    },
    [86539] = {
        name = "是那魯！",
    },
    [86540] = {
        name = "第三，開炸",
    },
    [86541] = {
        name = "以防萬一…",
    },
    [86542] = {
        name = "黑暗中的閃光",
    },
    [86543] = {
        name = "博學者殿堂：重返家園",
    },
    [86544] = {
        name = "死亡之後",
    },
    [86545] = {
        name = "聖光烙印",
    },
    [86549] = {
        name = "無懼黑暗",
    },
    [86557] = {
        name = "衝突與死亡之事",
    },
    [86558] = {
        name = "拯救蒼生",
    },
    [86559] = {
        name = "遠方前線",
    },
    [86561] = {
        name = "怪異的世界",
    },
    [86562] = {
        name = "與死亡共舞",
    },
    [86565] = {
        name = "穢惡終無出路",
    },
    [86621] = {
        name = "任性的博學者",
    },
    [86622] = {
        name = "因緣際會",
    },
    [86623] = {
        name = "吸引虛無",
    },
    [86624] = {
        name = "合理解釋",
    },
    [86626] = {
        name = "被洗劫的實驗室",
    },
    [86632] = {
        name = "安寧地之戰",
    },
    [86633] = {
        name = "理解虛無",
    },
    [86634] = {
        name = "隨時監視",
    },
    [86635] = {
        name = "進入死亡之域",
    },
    [86636] = {
        name = "虛無與我同行",
    },
    [86637] = {
        name = "暫時得救",
    },
    [86638] = {
        name = "扼殺觸鬚",
    },
    [86639] = {
        name = "僥倖生還",
    },
    [86640] = {
        name = "預示",
    },
    [86641] = {
        name = "舊傷疤",
    },
    [86642] = {
        name = "看不見的敵人",
    },
    [86643] = {
        name = "追根究柢",
    },
    [86644] = {
        name = "神明降臨",
    },
    [86646] = {
        name = "僵局",
    },
    [86647] = {
        name = "止戈",
    },
    [86648] = {
        name = "聖光指引我們",
    },
    [86649] = {
        name = "不可救藥",
    },
    [86650] = {
        name = "支離破碎",
    },
    [86652] = {
        name = "留在暗影中",
    },
    [86653] = {
        name = "阿曼尼之道",
    },
    [86654] = {
        name = "痛扁納爾丁",
    },
    [86655] = {
        name = "古老的傳統",
    },
    [86656] = {
        name = "殘暴盛宴",
    },
    [86657] = {
        name = "影盆守望",
    },
    [86658] = {
        name = "迷霧中的墓穴",
    },
    [86659] = {
        name = "撕裂迷霧",
    },
    [86660] = {
        name = "從暗影中救出",
    },
    [86661] = {
        name = "死亡羅亞的柴薪",
    },
    [86663] = {
        name = "星星之火",
    },
    [86664] = {
        name = "灼見或灼燒",
    },
    [86665] = {
        name = "火焰中的臉孔",
    },
    [86666] = {
        name = "在重生的陰影中",
    },
    [86681] = {
        name = "納羅拉克之穴：復仇的滋味",
    },
    [86682] = {
        name = "納羅拉克之穴：喚醒熊神",
    },
    [86683] = {
        name = "哈謝離去",
    },
    [86684] = {
        name = "劍刃",
    },
    [86685] = {
        name = "一敗塗地",
    },
    [86686] = {
        name = "聖光之前，人人平等",
    },
    [86687] = {
        name = "導管危機",
    },
    [86692] = {
        name = "折戟沉沙",
    },
    [86693] = {
        name = "哈謝的傳奇",
    },
    [86708] = {
        name = "祖阿曼大門",
    },
    [86710] = {
        name = "設下底線",
    },
    [86711] = {
        name = "阿曼尼的號召",
    },
    [86712] = {
        name = "阿曼尼永不退縮",
    },
    [86715] = {
        name = "中斷儀式",
    },
    [86716] = {
        name = "聖光武裝",
    },
    [86717] = {
        name = "證明你的價值",
    },
    [86718] = {
        name = "暮光放血",
    },
    [86719] = {
        name = "阿曼尼重要人士",
    },
    [86720] = {
        name = "折斷劍刃",
    },
    [86721] = {
        name = "努力的目標",
    },
    [86722] = {
        name = "阿曼尼之心",
    },
    [86723] = {
        name = "孤立",
    },
    [86733] = {
        name = "銀月城協商",
    },
    [86734] = {
        name = "外交",
    },
    [86735] = {
        name = "浴火重生",
    },
    [86736] = {
        name = "浴火重生",
    },
    [86737] = {
        name = "晴風光綻",
    },
    [86738] = {
        name = "鋒喉",
    },
    [86739] = {
        name = "拯救晴風村",
    },
    [86740] = {
        name = "流離的動物",
    },
    [86741] = {
        name = "光綻逼近",
    },
    [86742] = {
        name = "奇特植被",
    },
    [86743] = {
        name = "修剪光綻",
    },
    [86744] = {
        name = "尋求真相",
    },
    [86745] = {
        name = "需要通知銀月城",
    },
    [86769] = {
        name = "聖光的最後堡壘",
    },
    [86770] = {
        name = "奎爾達納斯的勇士",
    },
    [86780] = {
        name = "中流砥柱",
    },
    [86781] = {
        name = "面對過去",
    },
    [86805] = {
        name = "緊要關頭",
    },
    [86806] = {
        name = "發光之翼",
    },
    [86807] = {
        name = "大門",
    },
    [86808] = {
        name = "謎樣語者",
    },
    [86809] = {
        name = "信念的考驗",
    },
    [86811] = {
        name = "殺光以太族",
    },
    [86822] = {
        name = "最後一項聖物",
    },
    [86823] = {
        name = "黑暗部落",
    },
    [86824] = {
        name = "無旗倖免",
    },
    [86825] = {
        name = "忠誠的僕人，但毫無信念的目標",
    },
    [86826] = {
        name = "『刀疤』那戈許",
    },
    [86827] = {
        name = "公正認證",
    },
    [86828] = {
        name = "不只是托爾貝恩",
    },
    [86829] = {
        name = "紀念性的一刻",
    },
    [86830] = {
        name = "真正的黑暗部落",
    },
    [86831] = {
        name = "沒了督軍領導的戰士",
    },
    [86832] = {
        name = "夠格的熔爐",
    },
    [86833] = {
        name = "重製的壁壘",
    },
    [86834] = {
        name = "放逐虛無之裔",
    },
    [86836] = {
        name = "獵人在等候",
    },
    [86837] = {
        name = "太陽之井的會面",
    },
    [86838] = {
        name = "從疲憊中復甦",
    },
    [86839] = {
        name = "聖光之願聖物",
    },
    [86840] = {
        name = "閃爍的希望",
    },
    [86841] = {
        name = "過往聖騎士的聖物",
    },
    [86842] = {
        name = "血色之力",
    },
    [86843] = {
        name = "錯用的聖光",
    },
    [86844] = {
        name = "導回聖光",
    },
    [86845] = {
        name = "日行者之道",
    },
    [86846] = {
        name = "協助供應商補給",
    },
    [86848] = {
        name = "聖光武器庫",
    },
    [86849] = {
        name = "釋放怒火",
    },
    [86850] = {
        name = "破碎之日",
    },
    [86851] = {
        name = "艾恩根基",
    },
    [86852] = {
        name = "聖光的最後一戰",
    },
    [86855] = {
        name = "我們責任的後果",
    },
    [86856] = {
        name = "壓抑呼喚",
    },
    [86857] = {
        name = "深入裂隙",
    },
    [86858] = {
        name = "內心深處的瘋狂",
    },
    [86859] = {
        name = "找出解方",
    },
    [86860] = {
        name = "預防措施",
    },
    [86861] = {
        name = "吸引化身",
    },
    [86862] = {
        name = "強者必敗",
    },
    [86864] = {
        name = "探查大巢穴",
    },
    [86865] = {
        name = "尋求問題的解答",
    },
    [86866] = {
        name = "我們可以治癒嗎？",
    },
    [86867] = {
        name = "深入光綻",
    },
    [86868] = {
        name = "善意之旅",
    },
    [86874] = {
        name = "去除光綻",
    },
    [86877] = {
        name = "正義斬除",
    },
    [86880] = {
        name = "取回摯愛之物",
    },
    [86881] = {
        name = "斬草除根",
    },
    [86882] = {
        name = "得當使用艾恩之塵",
    },
    [86883] = {
        name = "狂暴進行曲",
    },
    [86884] = {
        name = "斬除與燒毀",
    },
    [86885] = {
        name = "力挽狂瀾",
    },
    [86887] = {
        name = "為了未來撤退",
    },
    [86890] = {
        name = "告訴大家你的見聞",
    },
    [86891] = {
        name = "最後手段",
    },
    [86892] = {
        name = "存活",
    },
    [86894] = {
        name = "艾恩哈拉之賜",
    },
    [86896] = {
        name = "光會找到出路",
    },
    [86897] = {
        name = "平息狂亂",
    },
    [86898] = {
        name = "哈拉尼爾的崛起",
    },
    [86899] = {
        name = "為了樹根",
    },
    [86900] = {
        name = "前往哈拉希爾",
    },
    [86901] = {
        name = "裂隙與獸穴",
    },
    [86902] = {
        name = "棄捨聖物",
    },
    [86903] = {
        name = "亞肯提納",
    },
    [86907] = {
        name = "回音之穴",
    },
    [86910] = {
        name = "庫札特之亂",
    },
    [86911] = {
        name = "回音和記憶",
    },
    [86912] = {
        name = "深入源途",
    },
    [86913] = {
        name = "哈瑪拉小屋",
    },
    [86914] = {
        name = "照看哈瑪拉",
    },
    [86929] = {
        name = "議會召集",
    },
    [86930] = {
        name = "播下種子",
    },
    [86942] = {
        name = "消除擴散",
    },
    [86944] = {
        name = "裂隙種子",
    },
    [86956] = {
        name = "旅行之花",
    },
    [86973] = {
        name = "在哈瑪拉阻止威脅",
    },
    [86997] = {
        name = "法術書大亂鬥",
    },
    [86998] = {
        name = "訓練環節",
    },
    [87002] = {
        name = "學術抱負",
    },
    [87254] = {
        name = "詛咒淨化",
    },
    [87256] = {
        name = "替代良藥",
    },
    [87267] = {
        name = "未獲滿足的需求",
    },
    [87268] = {
        name = "必要的懺悔",
    },
    [87317] = {
        name = "拒絕你的拒絕",
    },
    [87388] = {
        name = "大一號的野獸",
    },
    [87391] = {
        name = "品嚐當地的美食",
    },
    [87392] = {
        name = "貨物的陰謀",
    },
    [87393] = {
        name = "批准搜索",
    },
    [87394] = {
        name = "監視供應商",
    },
    [87395] = {
        name = "海水之下",
    },
    [87396] = {
        name = "正義的制裁",
    },
    [87397] = {
        name = "連帶摧毀的貨物",
    },
    [87398] = {
        name = "與走私者的對決",
    },
    [87399] = {
        name = "面對太陽",
    },
    [87400] = {
        name = "在太陽下四散",
    },
    [87401] = {
        name = "園丁的意外",
    },
    [87402] = {
        name = "聖光的力量",
    },
    [87455] = {
        name = "試煉與列表",
    },
    [87456] = {
        name = "四散的紀念品",
    },
    [87457] = {
        name = "我們最在行的事",
    },
    [87458] = {
        name = "前債已償",
    },
    [87672] = {
        name = "空氣中瀰漫著虛無",
    },
    [88653] = {
        name = "蛋黃找上你了",
    },
    [88708] = {
        name = "暴戾的結論",
    },
    [88719] = {
        name = "聖光之聲",
    },
    [88755] = {
        name = "學術追尋",
    },
    [88768] = {
        name = "黑暗使者",
    },
    [88977] = {
        name = "重演犯罪現場",
    },
    [88978] = {
        name = "追蹤足跡",
    },
    [88979] = {
        name = "逮個正著",
    },
    [88985] = {
        name = "恢復收取",
    },
    [88986] = {
        name = "致盲強盜",
    },
    [88987] = {
        name = "收拾破壞現場",
    },
    [88988] = {
        name = "工匠的學徒",
    },
    [88989] = {
        name = "又一個倒在木屑旁了",
    },
    [89012] = {
        name = "安全途徑",
    },
    [89034] = {
        name = "燒毀苦澀花",
    },
    [89035] = {
        name = "哈拉提名人",
    },
    [89193] = {
        name = "阿拉特",
    },
    [89199] = {
        name = "小小的任務",
    },
    [89200] = {
        name = "解除結界",
    },
    [89201] = {
        name = "出奇制勝",
    },
    [89202] = {
        name = "打草驚蛇",
    },
    [89203] = {
        name = "共同利益",
    },
    [89204] = {
        name = "順手牽羊",
    },
    [89205] = {
        name = "打造鑰匙",
    },
    [89206] = {
        name = "破門而入",
    },
    [89207] = {
        name = "人急了也是會咬人的",
    },
    [89208] = {
        name = "我們的報償",
    },
    [89230] = {
        name = "不是鬥士也能很浪漫",
    },
    [89231] = {
        name = "鬥士也能很浪漫",
    },
    [89233] = {
        name = "三角戀",
    },
    [89249] = {
        name = "全面壓制",
    },
    [89271] = {
        name = "吾子",
    },
    [89334] = {
        name = "先發制人",
    },
    [89338] = {
        name = "為農具收集",
    },
    [89383] = {
        name = "充滿冒險精神的幼雛",
    },
    [89384] = {
        name = "飢餓的陸行鷹",
    },
    [89385] = {
        name = "帶小孩的第一課",
    },
    [89386] = {
        name = "築巢受阻",
    },
    [89388] = {
        name = "虛無風暴",
    },
    [89402] = {
        name = "哈朗達",
    },
    [89503] = {
        name = "悲傷的手足",
    },
    [89506] = {
        name = "堅強的連結",
    },
    [89513] = {
        name = "充足的火種",
    },
    [89559] = {
        name = "毫無意義的崇拜",
    },
    [89560] = {
        name = "安靜的道別",
    },
    [89565] = {
        name = "悼念之路",
    },
    [90094] = {
        name = "狩獵的回音",
    },
    [90095] = {
        name = "呼喚的回音",
    },
    [90467] = {
        name = "天空的故事",
    },
    [90468] = {
        name = "雜七雜八！",
    },
    [90469] = {
        name = "出發去找庫里",
    },
    [90470] = {
        name = "尋找天之玻璃",
    },
    [90474] = {
        name = "艾恩夏倫的傳說",
    },
    [90481] = {
        name = "我有許可",
    },
    [90482] = {
        name = "食物的連結",
    },
    [90483] = {
        name = "枯木食人妖的故事",
    },
    [90484] = {
        name = "觀賞劍齒象",
    },
    [90485] = {
        name = "事後留下的文物",
    },
    [90486] = {
        name = "危險的美食",
    },
    [90493] = {
        name = "安寧地之心",
    },
    [90494] = {
        name = "失蹤的博學者",
    },
    [90509] = {
        name = "安寧地的叛徒",
    },
    [90533] = {
        name = "快找歐薇娜！",
    },
    [90534] = {
        name = "哈拉尼爾的家園",
    },
    [90535] = {
        name = "留下你的印記",
    },
    [90537] = {
        name = "遲綻者",
    },
    [90540] = {
        name = "拯救魯坦尼",
    },
    [90544] = {
        name = "汪汪竊賊",
    },
    [90546] = {
        name = "失蹤的聖騎士",
    },
    [90547] = {
        name = "失蹤的聖騎士",
    },
    [90548] = {
        name = "暮光公文",
    },
    [90549] = {
        name = "掙扎的跡象",
    },
    [90550] = {
        name = "暗日的悲報",
    },
    [90551] = {
        name = "捕獲情報",
    },
    [90552] = {
        name = "審問",
    },
    [90553] = {
        name = "剿刃行動",
    },
    [90554] = {
        name = "你的所到之處只有灰燼",
    },
    [90555] = {
        name = "自由祝福",
    },
    [90556] = {
        name = "擒賊先擒王",
    },
    [90568] = {
        name = "意想不到的友誼",
    },
    [90569] = {
        name = "物歸原主",
    },
    [90570] = {
        name = "前往死亡之域廢墟",
    },
    [90571] = {
        name = "野獸詩歌",
    },
    [90601] = {
        name = "收集微光蘑菇",
    },
    [90602] = {
        name = "釘菇斯塔",
    },
    [90615] = {
        name = "懷恨在心",
    },
    [90616] = {
        name = "你強嗎？",
    },
    [90617] = {
        name = "有趣的蘑菇人",
    },
    [90619] = {
        name = "殺不死的只會更強",
    },
    [90620] = {
        name = "前往鬥技場",
    },
    [90621] = {
        name = "小小英雄的旅程",
    },
    [90622] = {
        name = "尚未落敗的冠軍",
    },
    [90669] = {
        name = "金幣的價值",
    },
    [90749] = {
        name = "共同的敵人",
    },
    [90772] = {
        name = "越燃越烈",
    },
    [90782] = {
        name = "虛空使",
    },
    [90818] = {
        name = "兇殺路：說溜嘴了",
    },
    [90819] = {
        name = "兇殺路：做好份內任務",
    },
    [90821] = {
        name = "兇殺路：藏在港口的秘密",
    },
    [90822] = {
        name = "兇殺路：一舉肅清",
    },
    [90824] = {
        name = "我哥哥還活著！",
    },
    [90826] = {
        name = "阿魯雅的治療之水",
    },
    [90827] = {
        name = "只要劇毒",
    },
    [90829] = {
        name = "會見導師",
    },
    [90830] = {
        name = "道路自現",
    },
    [90831] = {
        name = "一切的努力",
    },
    [90832] = {
        name = "女神的歌聲沉寂下來",
    },
    [90833] = {
        name = "最後的儀式",
    },
    [90834] = {
        name = "從這時開始",
    },
    [90835] = {
        name = "兇殺路：謠言四起",
    },
    [90837] = {
        name = "兇殺路：魔化蹤跡",
    },
    [90838] = {
        name = "誓言與傳家寶",
    },
    [90844] = {
        name = "清醒的片刻",
    },
    [90845] = {
        name = "遙遠的記憶",
    },
    [90847] = {
        name = "強權之下的真相",
    },
    [90848] = {
        name = "她點燃了這場烽火",
    },
    [90851] = {
        name = "自相殘食",
    },
    [90852] = {
        name = "科技電磁脈衝",
    },
    [90858] = {
        name = "壓制壓迫者",
    },
    [90860] = {
        name = "掙脫枷鎖",
    },
    [90866] = {
        name = "世界共通語",
    },
    [90872] = {
        name = "血中浸染",
    },
    [90873] = {
        name = "暴力的狂歡",
    },
    [90874] = {
        name = "他們的暴戾終結",
    },
    [90875] = {
        name = "跨越各界",
    },
    [90907] = {
        name = "率先知道",
    },
    [90910] = {
        name = "極度黑暗",
    },
    [90914] = {
        name = "天生殺手",
    },
    [90915] = {
        name = "侵略工藝",
    },
    [90916] = {
        name = "意圖毀滅",
    },
    [90917] = {
        name = "殘暴收割者",
    },
    [90918] = {
        name = "不可寬恕者",
    },
    [90919] = {
        name = "失敗的邪魔",
    },
    [90920] = {
        name = "靈魂的溫暖",
    },
    [90922] = {
        name = "隕落者的餘痕",
    },
    [90923] = {
        name = "恐懼牧者",
    },
    [90924] = {
        name = "邪惡的終結",
    },
    [90963] = {
        name = "裂縫的洞穴",
    },
    [91000] = {
        name = "謙卑地幹粗活",
    },
    [91001] = {
        name = "清出道路",
    },
    [91062] = {
        name = "斷橋",
    },
    [91063] = {
        name = "綻放晶格",
    },
    [91065] = {
        name = "偷走花瓣腦的東西",
    },
    [91069] = {
        name = "為托巴尼報仇",
    },
    [91070] = {
        name = "回收貨物",
    },
    [91071] = {
        name = "阿塔阿巴斯的威脅",
    },
    [91085] = {
        name = "花瓣羽翼",
    },
    [91086] = {
        name = "去除花苞",
    },
    [91087] = {
        name = "遞交報告",
    },
    [91088] = {
        name = "瀑布之後",
    },
    [91090] = {
        name = "煩人害蟲",
    },
    [91136] = {
        name = "石中記憶",
    },
    [91137] = {
        name = "迷失在光之中",
    },
    [91145] = {
        name = "被征服的英雄",
    },
    [91146] = {
        name = "閃爍之光",
    },
    [91147] = {
        name = "斷絕她的線索",
    },
    [91148] = {
        name = "被線操縱",
    },
    [91149] = {
        name = "別將我埋葬",
    },
    [91206] = {
        name = "羅亞騷動",
    },
    [91270] = {
        name = "最重要的東西",
    },
    [91271] = {
        name = "好一條魚！",
    },
    [91274] = {
        name = "切斷虛無",
    },
    [91281] = {
        name = "至暗之夜",
    },
    [91284] = {
        name = "前途未定",
    },
    [91288] = {
        name = "狩獵考驗",
    },
    [91291] = {
        name = "血之考驗",
    },
    [91292] = {
        name = "秘法考驗",
    },
    [91301] = {
        name = "訓徒高手",
    },
    [91328] = {
        name = "秘密原料",
    },
    [91339] = {
        name = "在搖籃中扼殺",
    },
    [91340] = {
        name = "為了暴力",
    },
    [91341] = {
        name = "無限制",
    },
    [91342] = {
        name = "若要把事做好",
    },
    [91343] = {
        name = "野心的回報",
    },
    [91345] = {
        name = "前往北塔",
    },
    [91346] = {
        name = "對女神的祈求",
    },
    [91347] = {
        name = "陸行鷹奔竄",
    },
    [91348] = {
        name = "打草驚鰻",
    },
    [91349] = {
        name = "林間暗處",
    },
    [91350] = {
        name = "正式指令",
    },
    [91359] = {
        name = "真菌鞭笞者都給我滾",
    },
    [91360] = {
        name = "除草行動",
    },
    [91361] = {
        name = "回到工作中？",
    },
    [91363] = {
        name = "黑暗收割",
    },
    [91375] = {
        name = "方嘉拉村的寂靜",
    },
    [91376] = {
        name = "小怪物",
    },
    [91377] = {
        name = "死亡怪物",
    },
    [91378] = {
        name = "你是傳奇",
    },
    [91379] = {
        name = "腐化大地",
    },
    [91380] = {
        name = "野獸之腹",
    },
    [91381] = {
        name = "惡靈菇堡",
    },
    [91382] = {
        name = "強大與優越",
    },
    [91383] = {
        name = "收拾乾淨",
    },
    [91384] = {
        name = "回收任務",
    },
    [91385] = {
        name = "遊俠精神",
    },
    [91386] = {
        name = "量身訂做",
    },
    [91388] = {
        name = "罕見絲線",
    },
    [91389] = {
        name = "人要衣裝",
    },
    [91391] = {
        name = "仍在探查",
    },
    [91403] = {
        name = "可能導致麻痺",
    },
    [91404] = {
        name = "致命惡毒",
    },
    [91405] = {
        name = "驗證毒藥",
    },
    [91406] = {
        name = "遠離辛特蘭",
    },
    [91407] = {
        name = "羅亞之眼",
    },
    [91408] = {
        name = "尋找沙德拉",
    },
    [91409] = {
        name = "夢見蜘蛛",
    },
    [91410] = {
        name = "共奉羅亞",
    },
    [91411] = {
        name = "梅薩拉洞穴：深入梅薩拉",
    },
    [91412] = {
        name = "劇毒之后的回歸",
    },
    [91450] = {
        name = "我們準備好了",
    },
    [91452] = {
        name = "知識所及",
    },
    [91462] = {
        name = "前往中央高塔",
    },
    [91463] = {
        name = "前往南塔",
    },
    [91493] = {
        name = "非此貨物",
    },
    [91494] = {
        name = "一位精靈的垃圾，另一位的寶物",
    },
    [91495] = {
        name = "熟人有危",
    },
    [91504] = {
        name = "秘法聚合",
    },
    [91505] = {
        name = "如坐刺脊",
    },
    [91533] = {
        name = "我們留下的事物",
    },
    [91535] = {
        name = "甜蜜墓園",
    },
    [91536] = {
        name = "如同雜草",
    },
    [91537] = {
        name = "面對真相",
    },
    [91541] = {
        name = "失控的情感",
    },
    [91542] = {
        name = "心中的城鎮",
    },
    [91543] = {
        name = "重新控制",
    },
    [91544] = {
        name = "熟悉的能量",
    },
    [91545] = {
        name = "比以往更強",
    },
    [91546] = {
        name = "做出改變",
    },
    [91550] = {
        name = "沉默與暗影的遊戲",
    },
    [91551] = {
        name = "除巢作業",
    },
    [91552] = {
        name = "羽毛之怒",
    },
    [91553] = {
        name = "哈拉尼爾永不氣餒！",
    },
    [91556] = {
        name = "羅亞之焰",
    },
    [91557] = {
        name = "訊息傳給蛻殼",
    },
    [91558] = {
        name = "疫病花瓣",
    },
    [91559] = {
        name = "惡性害蟲",
    },
    [91560] = {
        name = "驅逐探險者",
    },
    [91561] = {
        name = "血源性病原體",
    },
    [91563] = {
        name = "哈拉齊的狩獵",
    },
    [91565] = {
        name = "虛無之痕競技場：悲慟尖塔",
    },
    [91566] = {
        name = "虛無之痕競技場：憎惡尖塔",
    },
    [91583] = {
        name = "虛無之痕競技場：英靈堡壘",
    },
    [91585] = {
        name = "新鮮現採",
    },
    [91586] = {
        name = "土壤營養品",
    },
    [91587] = {
        name = "軀體大餐",
    },
    [91588] = {
        name = "哈朗達廚房",
    },
    [91589] = {
        name = "根突運送",
    },
    [91597] = {
        name = "虛無之痕競技場：為了我的聯盟",
    },
    [91598] = {
        name = "虛無之痕競技場：激起暴力之前",
    },
    [91599] = {
        name = "虛無之痕競技場：熟悉的怨恨",
    },
    [91600] = {
        name = "虛無之痕競技場：暫且放下",
    },
    [91603] = {
        name = "虛無之痕競技場：二打一",
    },
    [91605] = {
        name = "虛無之痕競技場：錯誤的一邊",
    },
    [91606] = {
        name = "虛無之痕競技場：清理房屋",
    },
    [91630] = {
        name = "失竊的視野",
    },
    [91694] = {
        name = "虛無之痕競技場：瓦解三人組",
    },
    [91726] = {
        name = "勢不可擋之力",
    },
    [91747] = {
        name = "並非納羅拉克",
    },
    [91748] = {
        name = "暮光超標",
    },
    [91749] = {
        name = "不公不義",
    },
    [91750] = {
        name = "信賴危機",
    },
    [91787] = {
        name = "旅程結束",
    },
    [91813] = {
        name = "靈爪",
    },
    [91833] = {
        name = "骯髒的深淵",
    },
    [91835] = {
        name = "送他們回家",
    },
    [91836] = {
        name = "敬重圖騰",
    },
    [91838] = {
        name = "削弱邪勢",
    },
    [91839] = {
        name = "拒絕獻祭",
    },
    [91840] = {
        name = "不得崛起",
    },
    [91842] = {
        name = "解除黑暗部落的武裝",
    },
    [91854] = {
        name = "深邃暗影",
    },
    [91872] = {
        name = "前任根莖守望者",
    },
    [91873] = {
        name = "強化區域",
    },
    [91874] = {
        name = "燃燒吧",
    },
    [91875] = {
        name = "自然療法",
    },
    [91876] = {
        name = "養育希望",
    },
    [91884] = {
        name = "移動的幻象",
    },
    [91885] = {
        name = "榨取你",
    },
    [91886] = {
        name = "預兆之聲",
    },
    [91887] = {
        name = "詭詐統治",
    },
    [91958] = {
        name = "納羅拉克之穴：不可饒恕",
    },
    [91963] = {
        name = "肆意妄為",
    },
    [91967] = {
        name = "你認識這個惡徒？",
    },
    [92021] = {
        name = "墓花園藝",
    },
    [92022] = {
        name = "惡毒天職",
    },
    [92023] = {
        name = "可疑雜物",
    },
    [92024] = {
        name = "到府醫治",
    },
    [92025] = {
        name = "給艾瑪希爾的花",
    },
    [92061] = {
        name = "風暴匯聚",
    },
    [92084] = {
        name = "哈拉齊的指引",
    },
    [92136] = {
        name = "希望灌注",
    },
    [92155] = {
        name = "驅邪物品",
    },
    [92156] = {
        name = "它在跟著我",
    },
    [92157] = {
        name = "儀式行動",
    },
    [92158] = {
        name = "引它入甕",
    },
    [92159] = {
        name = "最終歸處",
    },
    [92163] = {
        name = "魚人羅亞",
    },
    [92164] = {
        name = "魚人瘋狂",
    },
    [92165] = {
        name = "魚是食物，不是朋友",
    },
    [92166] = {
        name = "有樣學樣",
    },
    [92167] = {
        name = "只能有一個",
    },
    [92390] = {
        name = "為研究冒險",
    },
    [92396] = {
        name = "呼喚救兵",
    },
    [92397] = {
        name = "晨星防線",
    },
    [92398] = {
        name = "大勢已至",
    },
    [92408] = {
        name = "實質利益",
    },
    [92450] = {
        name = "長大好難",
    },
    [92451] = {
        name = "我覺得我行",
    },
    [92452] = {
        name = "未按照計畫",
    },
    [92453] = {
        name = "無畏",
    },
    [92492] = {
        name = "向犧牲致敬",
    },
    [92493] = {
        name = "伊達戈的遺物",
    },
    [92495] = {
        name = "干擾暮光之刃",
    },
    [92496] = {
        name = "以利矛與暗影相向",
    },
    [92497] = {
        name = "純粹魔法",
    },
    [92499] = {
        name = "最明智的領袖亦懂遵循",
    },
    [92505] = {
        name = "過去的真相",
    },
    [92506] = {
        name = "靈魂的代價",
    },
    [92507] = {
        name = "更強的敵人",
    },
    [92508] = {
        name = "犧牲之印",
    },
    [92509] = {
        name = "殘忍器具",
    },
    [92510] = {
        name = "闇能灌注",
    },
    [92511] = {
        name = "事件視界",
    },
    [92512] = {
        name = "吞噬者",
    },
    [92531] = {
        name = "良藥羅亞聖壇",
    },
    [92603] = {
        name = "孤獨之星",
    },
    [92604] = {
        name = "血之言語",
    },
    [92605] = {
        name = "骨之誠實",
    },
    [92606] = {
        name = "承接你的贈禮",
    },
    [92607] = {
        name = "雕鑄新形",
    },
    [92616] = {
        name = "菇舞勇氣",
    },
    [92617] = {
        name = "菇勇者",
    },
    [92618] = {
        name = "自信的菇",
    },
    [92641] = {
        name = "血染平原",
    },
    [92657] = {
        name = "醞釀的風暴",
    },
    [92658] = {
        name = "戰術獲取",
    },
    [92659] = {
        name = "資源剝奪",
    },
    [92660] = {
        name = "空無器具",
    },
    [92661] = {
        name = "錘擊對砧",
    },
    [92662] = {
        name = "核心崩塌",
    },
    [92694] = {
        name = "顏料中的幽暮",
    },
    [92695] = {
        name = "風暴之筆",
    },
    [92696] = {
        name = "重生的顏色",
    },
    [92697] = {
        name = "明日的光彩",
    },
    [92728] = {
        name = "犬意難平",
    },
    [92729] = {
        name = "狗麻煩了",
    },
    [92732] = {
        name = "聖光騷亂",
    },
    [92736] = {
        name = "聖光散步",
    },
    [92737] = {
        name = "聖光屠殺",
    },
    [92738] = {
        name = "馬鈴薯蟾蜍寶寶",
    },
    [92739] = {
        name = "好喔，有綻放者",
    },
    [92864] = {
        name = "把它們趕走",
    },
    [92865] = {
        name = "餵食花苞",
    },
    [92866] = {
        name = "重新栽種多頭樹妖",
    },
    [92868] = {
        name = "他往那邊跑了",
    },
    [92869] = {
        name = "魚魚寡歡",
    },
    [92870] = {
        name = "去吧，小斯庫茲",
    },
    [92882] = {
        name = "獵人的困境",
    },
    [92883] = {
        name = "獵人的職責",
    },
    [92884] = {
        name = "獵人的武器",
    },
    [92885] = {
        name = "獵人的囊中物",
    },
    [92939] = {
        name = "不僅僅是岩石！",
    },
    [92944] = {
        name = "穿越虛無",
    },
    [92946] = {
        name = "深埋黑暗中",
    },
    [92948] = {
        name = "陷入麻煩",
    },
    [93047] = {
        name = "屠宰基礎",
    },
    [93048] = {
        name = "毫無節奏",
    },
    [93049] = {
        name = "課業輔導",
    },
    [93050] = {
        name = "祭壇歷史",
    },
    [93051] = {
        name = "期末考",
    },
    [93093] = {
        name = "納爾丁戰利品",
    },
    [93094] = {
        name = "回收勝利",
    },
    [93095] = {
        name = "苦澀狂怒",
    },
    [93096] = {
        name = "阿曼尼榮耀",
    },
    [93178] = {
        name = "被干擾的無聲漫步",
    },
    [93179] = {
        name = "孩童般的虔誠",
    },
    [93180] = {
        name = "聖壇準備",
    },
    [93181] = {
        name = "神廟和茶壺",
    },
    [93182] = {
        name = "療癒歸鄉",
    },
    [93257] = {
        name = "惡齒危機",
    },
    [93258] = {
        name = "螃蟹線索",
    },
    [93259] = {
        name = "痛宰螃蟹",
    },
    [93260] = {
        name = "捕蟹行動",
    },
    [93261] = {
        name = "異常巨大的螃蟹",
    },
    [93396] = {
        name = "破裂邊緣",
    },
    [93432] = {
        name = "化劍為犁",
    },
    [93433] = {
        name = "聖壇關好，使命達成",
    },
    [93435] = {
        name = "惹四生非",
    },
    [93436] = {
        name = "詛咒無辜、擾亂罪人",
    },
    [93437] = {
        name = "血債血償",
    },
    [93440] = {
        name = "個人經歷",
    },
    [93566] = {
        name = "阿曼尼部族名人",
    },
    [93651] = {
        name = "盲目谷地：光綻根鬚",
    },
    [93667] = {
        name = "石洗營地",
    },
    [93734] = {
        name = "寶貝飾品",
    },
    [93801] = {
        name = "精準撲殺",
    },
    [93811] = {
        name = "銀月城宮廷名人",
    },
    [94370] = {
        name = "滑溜逼近",
    },
    [94371] = {
        name = "遊俠之夢",
    },
    [94388] = {
        name = "再犯是選擇",
    },
    [94393] = {
        name = "職涯諮詢",
    },
    [94396] = {
        name = "給我收斂點",
    },
    [94677] = {
        name = "失蹤的根莖守望者",
    },
    [94844] = {
        name = "虛無之痕競技場：為了我的部落",
    },
    [94845] = {
        name = "虛無之痕競技場：強力堡壘",
    },
    [94848] = {
        name = "虛無之痕競技場：激起暴力之前",
    },
    [94849] = {
        name = "虛無之痕競技場：熟悉的怨恨",
    },
    [94855] = {
        name = "虛無之痕競技場：暫且放下",
    },
    [94867] = {
        name = "迷失於阿塔阿巴斯",
    },
    [94871] = {
        name = "永歌森林",
    },
    [94993] = {
        name = "至暗之夜冒險",
    },
    [95008] = {
        name = "至暗之夜冒險",
    },
    [95276] = {
        name = "最後衝刺",
    },
})
]])()
