----- AUTO GENERATED - DO NOT EDIT

if GetLocale() ~= "ruRU" then
    return
end

loadstring([[
BtWQuestsDatabase:UpdateQuestsTable({
    [86509] = {
        name = "Друг или враг",
    },
    [86510] = {
        name = "Дом полумрака",
    },
    [86511] = {
        name = "Край Бездны",
    },
    [86512] = {
        name = "Жатва",
    },
    [86513] = {
        name = "Навстречу волнам",
    },
    [86514] = {
        name = "Владычица Пропасти",
    },
    [86515] = {
        name = "Опустошающий голод",
    },
    [86516] = {
        name = "Добычей станут все",
    },
    [86517] = {
        name = "Сгинувшие в Бездне",
    },
    [86518] = {
        name = "Оплечье хищника",
    },
    [86519] = {
        name = "Бездна, Бездна",
    },
    [86520] = {
        name = "Преследуя Свет",
    },
    [86521] = {
        name = "Узел Нексуса Зенас: Затмение",
    },
    [86522] = {
        name = "Забрезжил рассвет",
    },
    [86528] = {
        name = "Треснутый голографический ключ",
    },
    [86530] = {
        name = "Первое: заряды",
    },
    [86531] = {
        name = "Саботаж",
    },
    [86536] = {
        name = "Надежные враги",
    },
    [86537] = {
        name = "Небезопасность сети",
    },
    [86538] = {
        name = "Второе: топливо",
    },
    [86539] = {
        name = "Наару!",
    },
    [86540] = {
        name = "Третье: все взорвать",
    },
    [86541] = {
        name = "На всякий случай...",
    },
    [86542] = {
        name = "Огонек во тьме",
    },
    [86543] = {
        name = "Терраса Магистров: Возвращение домой",
    },
    [86544] = {
        name = "Пост мортем",
    },
    [86545] = {
        name = "Печать Света",
    },
    [86549] = {
        name = "Не бояться темноты",
    },
    [86557] = {
        name = "Раздор и смерть",
    },
    [86558] = {
        name = "Не утратить здравомыслия",
    },
    [86559] = {
        name = "Дальний-дальний рубеж",
    },
    [86561] = {
        name = "Странный иной мир",
    },
    [86562] = {
        name = "Танец со смертью",
    },
    [86565] = {
        name = "Нет молитв за недостойных",
    },
    [86621] = {
        name = "Своенравный магистр",
    },
    [86622] = {
        name = "Случайная встреча",
    },
    [86623] = {
        name = "Обращение к Бездне",
    },
    [86624] = {
        name = "Рациональное объяснение",
    },
    [86626] = {
        name = "Разоренная лаборатория",
    },
    [86632] = {
        name = "Битва за Транквиллион",
    },
    [86633] = {
        name = "Понимание Бездны",
    },
    [86634] = {
        name = "Стражи из прошлого",
    },
    [86635] = {
        name = "В Смертхольм",
    },
    [86636] = {
        name = "Иди со мной и с Бездной",
    },
    [86637] = {
        name = "Передышки не будет",
    },
    [86638] = {
        name = "Душащие щупальца",
    },
    [86639] = {
        name = "Все что осталось",
    },
    [86640] = {
        name = "Предчувствие",
    },
    [86641] = {
        name = "Старые шрамы",
    },
    [86642] = {
        name = "Незримый враг",
    },
    [86643] = {
        name = "Зри в корень",
    },
    [86644] = {
        name = "Боги пред нами",
    },
    [86646] = {
        name = "Тупик",
    },
    [86647] = {
        name = "Стук сердца",
    },
    [86648] = {
        name = "Да направит нас Свет",
    },
    [86649] = {
        name = "Искупление прошлых грехов",
    },
    [86650] = {
        name = "Раскол",
    },
    [86652] = {
        name = "Брошенные во тьме",
    },
    [86653] = {
        name = "Путь Амани",
    },
    [86654] = {
        name = "Избиение дряздинов",
    },
    [86655] = {
        name = "Древняя тропа",
    },
    [86656] = {
        name = "Жестокое пиршество",
    },
    [86657] = {
        name = "Тенепрудный дозор",
    },
    [86658] = {
        name = "Склеп в тумане",
    },
    [86659] = {
        name = "Там, за туманами",
    },
    [86660] = {
        name = "Спасение из тени",
    },
    [86661] = {
        name = "Угли мертвого лоа",
    },
    [86663] = {
        name = "Из углей возгорится пламя",
    },
    [86664] = {
        name = "Обжигающее предвидение",
    },
    [86665] = {
        name = "Лик в огне",
    },
    [86666] = {
        name = "В тени возрождения",
    },
    [86681] = {
        name = "Берлога Налоракка: вкус отмщения",
    },
    [86682] = {
        name = "Берлога Налоракка: разбудить медведя",
    },
    [86683] = {
        name = "Смелей, хаш'эй",
    },
    [86684] = {
        name = "Лезвие клинка",
    },
    [86685] = {
        name = "Сколы и трещины",
    },
    [86686] = {
        name = "Для Света чужих не бывает",
    },
    [86687] = {
        name = "Кризис с проводниками",
    },
    [86692] = {
        name = "Клинок раскололся",
    },
    [86693] = {
        name = "Легенда о хаш'эй",
    },
    [86708] = {
        name = "Врата Зул'Амана",
    },
    [86710] = {
        name = "Мы проведем черту здесь",
    },
    [86711] = {
        name = "Трубный глас Амани",
    },
    [86712] = {
        name = "Аманийцев не сломить",
    },
    [86715] = {
        name = "Конец ритуалам",
    },
    [86716] = {
        name = "Вооруженные Светом",
    },
    [86717] = {
        name = "Покажи, чего стоишь",
    },
    [86718] = {
        name = "Сумерки истекут кровью",
    },
    [86719] = {
        name = "Важные аманийцы",
    },
    [86720] = {
        name = "Сломать клинок",
    },
    [86721] = {
        name = "Все наши старания",
    },
    [86722] = {
        name = "Сердце Амани",
    },
    [86723] = {
        name = "Изоляция",
    },
    [86733] = {
        name = "Переговоры в Луносвете",
    },
    [86734] = {
        name = "Дипломатия",
    },
    [86735] = {
        name = "Вымощено пеплом",
    },
    [86736] = {
        name = "Вымощено пеплом",
    },
    [86737] = {
        name = "Легкий ветерок, светоцветье",
    },
    [86738] = {
        name = "Остропасть",
    },
    [86739] = {
        name = "Помощь Легкому Ветерку",
    },
    [86740] = {
        name = "Изгнанные с насиженных мест",
    },
    [86741] = {
        name = "Маячащие светоцветы",
    },
    [86742] = {
        name = "Любопытная культивация",
    },
    [86743] = {
        name = "Обрезка светоцветов",
    },
    [86744] = {
        name = "В поисках истины",
    },
    [86745] = {
        name = "В Луносвете должны знать",
    },
    [86769] = {
        name = "Последний оплот Света",
    },
    [86770] = {
        name = "Защитники Кель'Данаса",
    },
    [86780] = {
        name = "Где сражаются герои",
    },
    [86781] = {
        name = "Взглянуть в лицо прошлому",
    },
    [86805] = {
        name = "Час нужды",
    },
    [86806] = {
        name = "Сияющие крылья",
    },
    [86807] = {
        name = "Врата",
    },
    [86808] = {
        name = "Говорящий загадками",
    },
    [86809] = {
        name = "Испытание убежденности",
    },
    [86811] = {
        name = "Астральное искоренение",
    },
    [86822] = {
        name = "Последняя реликвия",
    },
    [86823] = {
        name = "Темная Орда",
    },
    [86824] = {
        name = "Не осталось никого",
    },
    [86825] = {
        name = "Верный слуга неверному делу",
    },
    [86826] = {
        name = "Нагош Шрам",
    },
    [86827] = {
        name = "Должное признание",
    },
    [86828] = {
        name = "Не только Троллебой",
    },
    [86829] = {
        name = "Знаменательный момент",
    },
    [86830] = {
        name = "Истинная Орда или Темная Орда",
    },
    [86831] = {
        name = "Воины без полководца",
    },
    [86832] = {
        name = "Достойный горн",
    },
    [86833] = {
        name = "Восстановление бастиона",
    },
    [86834] = {
        name = "Изгнание Безднорожденных",
    },
    [86836] = {
        name = "Охотник поджидает",
    },
    [86837] = {
        name = "Встреча у Солнечного Колодца",
    },
    [86838] = {
        name = "Возрождение утомленных",
    },
    [86839] = {
        name = "Реликвии Последней Надежды",
    },
    [86840] = {
        name = "Проблеск надежды",
    },
    [86841] = {
        name = "Древние реликвии паладинов",
    },
    [86842] = {
        name = "Сила Алого ордена",
    },
    [86843] = {
        name = "Свет во зло",
    },
    [86844] = {
        name = "Свет во благо",
    },
    [86845] = {
        name = "Путь Служителя Солнца",
    },
    [86846] = {
        name = "Обеспечение поставщиков",
    },
    [86848] = {
        name = "Арсенал Света",
    },
    [86849] = {
        name = "Необузданный гнев",
    },
    [86850] = {
        name = "Расколотое Солнце",
    },
    [86851] = {
        name = "Основание Альн",
    },
    [86852] = {
        name = "Последняя битва Света",
    },
    [86855] = {
        name = "Последствия исполненного долга",
    },
    [86856] = {
        name = "Приглушение зова",
    },
    [86857] = {
        name = "Спуск в Провал",
    },
    [86858] = {
        name = "Безумие укоренилось глубоко",
    },
    [86859] = {
        name = "В поисках решения",
    },
    [86860] = {
        name = "Пока они не выросли",
    },
    [86861] = {
        name = "Выгул воплощений",
    },
    [86862] = {
        name = "Чем больше в них Альн...",
    },
    [86864] = {
        name = "Бдение в Логове",
    },
    [86865] = {
        name = "В поисках проблем",
    },
    [86866] = {
        name = "Мы сможем это вылечить?",
    },
    [86867] = {
        name = "Вторжение в светоцвет",
    },
    [86868] = {
        name = "Жест доброй воли",
    },
    [86874] = {
        name = "Приглушенный свет",
    },
    [86877] = {
        name = "Праведная резня",
    },
    [86880] = {
        name = "То, что нам дорого, снова с нами",
    },
    [86881] = {
        name = "Под корень",
    },
    [86882] = {
        name = "Пыль Альн в надежных руках",
    },
    [86883] = {
        name = "Неистовое нашествие",
    },
    [86884] = {
        name = "Огнем и мечом",
    },
    [86885] = {
        name = "Сдерживая волны",
    },
    [86887] = {
        name = "Стремительный отход",
    },
    [86890] = {
        name = "Расскажите об увиденном народу",
    },
    [86891] = {
        name = "Последнее средство",
    },
    [86892] = {
        name = "Остаться в живых",
    },
    [86894] = {
        name = "Дар Альн'ары",
    },
    [86896] = {
        name = "Свет найдет путь",
    },
    [86897] = {
        name = "Успокоение ярости",
    },
    [86898] = {
        name = "Возвышение хараниров",
    },
    [86899] = {
        name = "Корневая причина",
    },
    [86900] = {
        name = "В Хар'атир",
    },
    [86901] = {
        name = "Провал и пещера",
    },
    [86902] = {
        name = "Раздача реликвий",
    },
    [86903] = {
        name = "Тайная таверна",
    },
    [86907] = {
        name = "Пещера Отголосков",
    },
    [86910] = {
        name = "Буйство Кузата",
    },
    [86911] = {
        name = "Отголоски и воспоминания",
    },
    [86912] = {
        name = "Вниз по Корнистому пути",
    },
    [86913] = {
        name = "Хижина в Хар'маре",
    },
    [86914] = {
        name = "Забота о Хар'маре",
    },
    [86929] = {
        name = "Собрание Совета",
    },
    [86930] = {
        name = "Что посеешь",
    },
    [86942] = {
        name = "Остановить распространение",
    },
    [86944] = {
        name = "Семена из Провала",
    },
    [86956] = {
        name = "Странствующие цветы",
    },
    [86973] = {
        name = "Остановить потери в Хар'маре",
    },
    [86997] = {
        name = "Книжный погром",
    },
    [86998] = {
        name = "Период тренировок",
    },
    [87002] = {
        name = "Академические устремления",
    },
    [87254] = {
        name = "Избавление от проклятия",
    },
    [87256] = {
        name = "Альтернативное целительство",
    },
    [87267] = {
        name = "Невыполненные требования",
    },
    [87268] = {
        name = "Необходимое искупление",
    },
    [87317] = {
        name = "Отказ в отрицании",
    },
    [87388] = {
        name = "Зверь покрупнее",
    },
    [87391] = {
        name = "Исследование местной фауны",
    },
    [87392] = {
        name = "Махинации с грузами",
    },
    [87393] = {
        name = "Обыск без ордера",
    },
    [87394] = {
        name = "Наблюдение за поставщиками",
    },
    [87395] = {
        name = "Под волнами",
    },
    [87396] = {
        name = "На месте преступления",
    },
    [87397] = {
        name = "Уничтожение опасного груза",
    },
    [87398] = {
        name = "Разборка с контрабандистами",
    },
    [87399] = {
        name = "Навстречу солнцу",
    },
    [87400] = {
        name = "В лучах солнца",
    },
    [87401] = {
        name = "Происшествие с садовниками",
    },
    [87402] = {
        name = "Свет даст все",
    },
    [87455] = {
        name = "Трудности и долги",
    },
    [87456] = {
        name = "Растерянные сувениры",
    },
    [87457] = {
        name = "Наши главные таланты",
    },
    [87458] = {
        name = "Долги уплачены",
    },
    [87672] = {
        name = "Бездна витает в воздухе",
    },
    [88653] = {
        name = "Не разбив яиц...",
    },
    [88708] = {
        name = "Жестокая правда",
    },
    [88719] = {
        name = "Глас Света",
    },
    [88755] = {
        name = "Академические исследования",
    },
    [88768] = {
        name = "Агенты Тьмы",
    },
    [88977] = {
        name = "Воспроизвести преступление",
    },
    [88978] = {
        name = "По следу",
    },
    [88979] = {
        name = "Взятие с поличным",
    },
    [88985] = {
        name = "Запоздалое возвращение",
    },
    [88986] = {
        name = "Ослепить разбойников",
    },
    [88987] = {
        name = "Уборка за диверсантами",
    },
    [88988] = {
        name = "Ученик ремесленника",
    },
    [88989] = {
        name = "Еще один наглотался опилок",
    },
    [89012] = {
        name = "Безопасный путь",
    },
    [89034] = {
        name = "Сожжение горечников",
    },
    [89035] = {
        name = "Известность среди хара'ти",
    },
    [89193] = {
        name = "Аратор",
    },
    [89199] = {
        name = "Небольшое дельце",
    },
    [89200] = {
        name = "Рассеивание оберегов",
    },
    [89201] = {
        name = "Перехитренный",
    },
    [89202] = {
        name = "Расшевелить гнездо",
    },
    [89203] = {
        name = "Взаимная выгода",
    },
    [89204] = {
        name = "Ловкость рук и никакого мошенничества",
    },
    [89205] = {
        name = "Изготовление ключа",
    },
    [89206] = {
        name = "Проникновение со взломом",
    },
    [89207] = {
        name = "Крысы могут укусить",
    },
    [89208] = {
        name = "Заслуженная награда",
    },
    [89230] = {
        name = "Кавалер, а не воин",
    },
    [89231] = {
        name = "Воин, а не кавалер",
    },
    [89233] = {
        name = "Любовный треугольник",
    },
    [89249] = {
        name = "Сокрушение",
    },
    [89271] = {
        name = "Мой сын",
    },
    [89334] = {
        name = "Заблаговременная готовность",
    },
    [89338] = {
        name = "Мечи на орала",
    },
    [89383] = {
        name = "Сбежавший птенец",
    },
    [89384] = {
        name = "Голодная стая",
    },
    [89385] = {
        name = "Первый шаг к родительству",
    },
    [89386] = {
        name = "Обустройство гнезд",
    },
    [89388] = {
        name = "Буря Бездны",
    },
    [89402] = {
        name = "Харандар",
    },
    [89503] = {
        name = "Скорбящие родственники",
    },
    [89506] = {
        name = "Крепкие связи",
    },
    [89513] = {
        name = "Растопка в изобилии",
    },
    [89559] = {
        name = "Беспричинное поклонение",
    },
    [89560] = {
        name = "Тихое прощание",
    },
    [89565] = {
        name = "Путь скорби",
    },
    [90094] = {
        name = "Отголосок охоты",
    },
    [90095] = {
        name = "Отголосок зова",
    },
    [90467] = {
        name = "Легенды о небе",
    },
    [90468] = {
        name = "Домашние хлопоты",
    },
    [90469] = {
        name = "Упрямая Кури",
    },
    [90470] = {
        name = "В поисках небесного стекла",
    },
    [90474] = {
        name = "Легенда об Альн'ашаране",
    },
    [90481] = {
        name = "У меня есть разрешение",
    },
    [90482] = {
        name = "Кулинарные связи",
    },
    [90483] = {
        name = "Истории Сухокожих",
    },
    [90484] = {
        name = "Любопытный стегодон",
    },
    [90485] = {
        name = "Старинные артефакты",
    },
    [90486] = {
        name = "Опасные деликатесы",
    },
    [90493] = {
        name = "Сердце Транквиллиона",
    },
    [90494] = {
        name = "Пропавший магистр",
    },
    [90509] = {
        name = "Предатели Транквиллиона",
    },
    [90533] = {
        name = "Приведи Орвейну!",
    },
    [90534] = {
        name = "Дом хараниров",
    },
    [90535] = {
        name = "Оставить свой след",
    },
    [90537] = {
        name = "Позднее цветение",
    },
    [90540] = {
        name = "Спасение рутаани",
    },
    [90544] = {
        name = "Собака-воровка",
    },
    [90546] = {
        name = "Пропавшие паладины",
    },
    [90547] = {
        name = "Пропавшие паладины",
    },
    [90548] = {
        name = "Сумеречные депеши",
    },
    [90549] = {
        name = "Следы борьбы",
    },
    [90550] = {
        name = "Солнце Теней",
    },
    [90551] = {
        name = "За языком",
    },
    [90552] = {
        name = "Допрос",
    },
    [90553] = {
        name = "Избиение Клинков",
    },
    [90554] = {
        name = "Путь, усеянный прахом",
    },
    [90555] = {
        name = "Благословенная свобода",
    },
    [90556] = {
        name = "Голову с плеч",
    },
    [90568] = {
        name = "Неожиданные друзья",
    },
    [90569] = {
        name = "Назад в котомку",
    },
    [90570] = {
        name = "На руины Смертхольма",
    },
    [90571] = {
        name = "Логово чудовища",
    },
    [90601] = {
        name = "Сбор лучегрибов",
    },
    [90602] = {
        name = "Гомфуста",
    },
    [90615] = {
        name = "Сведение счетов",
    },
    [90616] = {
        name = "Сила есть?",
    },
    [90617] = {
        name = "Забавные ребята",
    },
    [90619] = {
        name = "То, что их не убивает",
    },
    [90620] = {
        name = "На ринг",
    },
    [90621] = {
        name = "Приключения маленьких героев",
    },
    [90622] = {
        name = "Еще не побежденные чемпионы",
    },
    [90669] = {
        name = "Золото есть золото",
    },
    [90749] = {
        name = "Наш общий враг",
    },
    [90772] = {
        name = "Пламя разгорается",
    },
    [90782] = {
        name = "Посланники Пустоты",
    },
    [90818] = {
        name = "Закоулок душегубов: болтливые языки",
    },
    [90819] = {
        name = "Закоулок душегубов: отыгрыш роли",
    },
    [90821] = {
        name = "Закоулок душегубов: тайны гавани",
    },
    [90822] = {
        name = "Закоулок душегубов: налет на Скверну",
    },
    [90824] = {
        name = "Мой брат жив!",
    },
    [90826] = {
        name = "Целительные воды Ахл'уа",
    },
    [90827] = {
        name = "Только самое ядовитое",
    },
    [90829] = {
        name = "Знакомство с наставником",
    },
    [90830] = {
        name = "Путь явит себя сам",
    },
    [90831] = {
        name = "Делать – значит, становиться",
    },
    [90832] = {
        name = "Когда ее голос умолкнет",
    },
    [90833] = {
        name = "Последний обряд",
    },
    [90834] = {
        name = "С этой минуты",
    },
    [90835] = {
        name = "Закоулок душегубов: изобилие слухов",
    },
    [90837] = {
        name = "Закоулок душегубов: следы Скверны",
    },
    [90838] = {
        name = "Клятвы и наследие",
    },
    [90844] = {
        name = "Проблески прошлого",
    },
    [90845] = {
        name = "Далекие воспоминания",
    },
    [90847] = {
        name = "Истина через силу",
    },
    [90848] = {
        name = "Она разожгла пламя",
    },
    [90851] = {
        name = "Пожирая своих",
    },
    [90852] = {
        name = "Техномагнитный импульс",
    },
    [90858] = {
        name = "Подавление угнетателей",
    },
    [90860] = {
        name = "Сбрасывание ярма",
    },
    [90866] = {
        name = "Универсальный язык",
    },
    [90872] = {
        name = "По горло в крови",
    },
    [90873] = {
        name = "Жестокие меры",
    },
    [90874] = {
        name = "Жестокий конец",
    },
    [90875] = {
        name = "Среди миров",
    },
    [90907] = {
        name = "Первый, кто должен знать",
    },
    [90910] = {
        name = "Всепоглощающая тьма",
    },
    [90914] = {
        name = "Прирожденный убийца",
    },
    [90915] = {
        name = "Искусство агрессии",
    },
    [90916] = {
        name = "Найти, чтобы уничтожить",
    },
    [90917] = {
        name = "Жнец свирепости",
    },
    [90918] = {
        name = "Непрощенный",
    },
    [90919] = {
        name = "Демон, потерпевший неудачу",
    },
    [90920] = {
        name = "Согревание души",
    },
    [90922] = {
        name = "Путь павших",
    },
    [90923] = {
        name = "Пастырь страха",
    },
    [90924] = {
        name = "Зловещий конец",
    },
    [90963] = {
        name = "Пещеры Расселины",
    },
    [91000] = {
        name = "Скромный слуга",
    },
    [91001] = {
        name = "Расчистка пути",
    },
    [91062] = {
        name = "Разрушенные мосты",
    },
    [91063] = {
        name = "Соцветение",
    },
    [91065] = {
        name = "Сороки-воровки",
    },
    [91069] = {
        name = "Месть за Толбани",
    },
    [91070] = {
        name = "Возврат товаров",
    },
    [91071] = {
        name = "Угроза для Атал'Абаси",
    },
    [91085] = {
        name = "Щетина из цветов",
    },
    [91086] = {
        name = "Обрезка бутонов",
    },
    [91087] = {
        name = "Рапорты доставлены",
    },
    [91088] = {
        name = "За водопадом",
    },
    [91090] = {
        name = "Назойливые вредители",
    },
    [91136] = {
        name = "Воспоминания в камне",
    },
    [91137] = {
        name = "Заблудшие в Свете",
    },
    [91145] = {
        name = "Покоренные герои",
    },
    [91146] = {
        name = "Мерцающий свет",
    },
    [91147] = {
        name = "Перерезать нить",
    },
    [91148] = {
        name = "Желаемое и действительное",
    },
    [91149] = {
        name = "Схорони меня",
    },
    [91206] = {
        name = "Треволнения лоа",
    },
    [91270] = {
        name = "Самое важное",
    },
    [91271] = {
        name = "Рыба!",
    },
    [91274] = {
        name = "Разрывая связи с Бездной",
    },
    [91281] = {
        name = "Полночь",
    },
    [91284] = {
        name = "Выбор пути",
    },
    [91288] = {
        name = "Испытание охоты",
    },
    [91291] = {
        name = "Испытание крови",
    },
    [91292] = {
        name = "Испытание тайной магии",
    },
    [91301] = {
        name = "Обучение своего протеже",
    },
    [91328] = {
        name = "Секретные ингредиенты",
    },
    [91339] = {
        name = "Задушенный в колыбели",
    },
    [91340] = {
        name = "Во имя жестокости",
    },
    [91341] = {
        name = "Без ограничений",
    },
    [91342] = {
        name = "Если хочешь, чтобы все было сделано как следует...",
    },
    [91343] = {
        name = "Награда за амбиции",
    },
    [91345] = {
        name = "В северную башню",
    },
    [91346] = {
        name = "Служители богини",
    },
    [91347] = {
        name = "Крылобеги-пахари",
    },
    [91348] = {
        name = "Мана и змеи",
    },
    [91349] = {
        name = "Темный уголок леса",
    },
    [91350] = {
        name = "Серьезное поручение",
    },
    [91359] = {
        name = "Долой грибных плеточников",
    },
    [91360] = {
        name = "Прополка сорняков",
    },
    [91361] = {
        name = "Снова в строю?",
    },
    [91363] = {
        name = "Жатва Тьмы",
    },
    [91375] = {
        name = "Тишина в Грибной деревне",
    },
    [91376] = {
        name = "Маленькие чудовища",
    },
    [91377] = {
        name = "Порождения мертвых",
    },
    [91378] = {
        name = "Ты – легенда",
    },
    [91379] = {
        name = "Разложение земли",
    },
    [91380] = {
        name = "Чрево чудовища",
    },
    [91381] = {
        name = "Молчаливое зло",
    },
    [91382] = {
        name = "Сильный и могучий",
    },
    [91383] = {
        name = "Уборка",
    },
    [91384] = {
        name = "Восстановление",
    },
    [91385] = {
        name = "Дух следопыта",
    },
    [91386] = {
        name = "Высокое искусство",
    },
    [91388] = {
        name = "Необычные нити",
    },
    [91389] = {
        name = "Мужчину красит одежда",
    },
    [91391] = {
        name = "Разведка продолжается",
    },
    [91403] = {
        name = "Возможен паралич",
    },
    [91404] = {
        name = "Самый гнусный яд",
    },
    [91405] = {
        name = "Определение яда",
    },
    [91406] = {
        name = "Вдали от Внутренних земель",
    },
    [91407] = {
        name = "Глаз лоа",
    },
    [91408] = {
        name = "Розыски Шадры",
    },
    [91409] = {
        name = "Сны о пауках",
    },
    [91410] = {
        name = "Общий лоа",
    },
    [91411] = {
        name = "Пещеры Маисара: В глубинах Маисара",
    },
    [91412] = {
        name = "Возвращение Королевы пауков",
    },
    [91450] = {
        name = "Теперь мы готовы",
    },
    [91452] = {
        name = "Подборка знаний",
    },
    [91462] = {
        name = "В центральную башню",
    },
    [91463] = {
        name = "В южную башню",
    },
    [91493] = {
        name = "Это не мой заказ",
    },
    [91494] = {
        name = "Что для одного эльфа – хлам, для другого – сокровище",
    },
    [91495] = {
        name = "Знакомцы в беде",
    },
    [91504] = {
        name = "Накопление чар",
    },
    [91505] = {
        name = "Ножи в спине",
    },
    [91533] = {
        name = "То, что останется в прошлом",
    },
    [91535] = {
        name = "Дом, милая могила",
    },
    [91536] = {
        name = "Как сорная трава",
    },
    [91537] = {
        name = "Признать проблему",
    },
    [91541] = {
        name = "Неконтролируемые эмоции",
    },
    [91542] = {
        name = "Город во мне",
    },
    [91543] = {
        name = "Возвращение контроля",
    },
    [91544] = {
        name = "Знакомые энергии",
    },
    [91545] = {
        name = "Сильнее, чем прежде",
    },
    [91546] = {
        name = "Время перемен",
    },
    [91550] = {
        name = "Игра тишины и тени",
    },
    [91551] = {
        name = "Де-гнезда-ция",
    },
    [91552] = {
        name = "Пернатая ярость",
    },
    [91553] = {
        name = "Хараниры не сдаются!",
    },
    [91556] = {
        name = "Пламя лоа",
    },
    [91557] = {
        name = "Послание в Распадок",
    },
    [91558] = {
        name = "Заразные лепестки",
    },
    [91559] = {
        name = "Смертельный вредитель",
    },
    [91560] = {
        name = "Вычеркнутые исследователи",
    },
    [91561] = {
        name = "Патоген из крови",
    },
    [91563] = {
        name = "Охота Халаззи",
    },
    [91565] = {
        name = "Арена Шрама Бездны: Шпиль Горя",
    },
    [91566] = {
        name = "Арена Шрама Бездны: Шпиль Ненависти",
    },
    [91583] = {
        name = "Арена Шрама Бездны: Бастион доблести",
    },
    [91585] = {
        name = "Только что из сада",
    },
    [91586] = {
        name = "Почвенные альтернативы",
    },
    [91587] = {
        name = "Кухня мертвоедов",
    },
    [91588] = {
        name = "Харандарская кухня",
    },
    [91589] = {
        name = "Корневая экспресс-почта",
    },
    [91597] = {
        name = "Арена Шрама Бездны: за мой Альянс",
    },
    [91598] = {
        name = "Арена Шрама Бездны: спровоцированная жестокость",
    },
    [91599] = {
        name = "Арена Шрама Бездны: давняя вражда",
    },
    [91600] = {
        name = "Арена Шрама Бездны: забытые распри",
    },
    [91603] = {
        name = "Арена Шрама Бездны: двое на одного",
    },
    [91605] = {
        name = "Арена Шрама Бездны: не на той стороне",
    },
    [91606] = {
        name = "Арена Шрама Бездны: уборка в доме",
    },
    [91630] = {
        name = "Похищенное зрение",
    },
    [91694] = {
        name = "Арена Шрама Бездны: Раскол троицы",
    },
    [91726] = {
        name = "Неудержимая сила",
    },
    [91747] = {
        name = "Не совсем Налоракк",
    },
    [91748] = {
        name = "Слишком сумрачно",
    },
    [91749] = {
        name = "Все это неправильно",
    },
    [91750] = {
        name = "Опасность доверия",
    },
    [91787] = {
        name = "Конец путешествия",
    },
    [91813] = {
        name = "Призрачная Лапа",
    },
    [91833] = {
        name = "Грязные глубины",
    },
    [91835] = {
        name = "Отправить их домой",
    },
    [91836] = {
        name = "Уважение к тотемам",
    },
    [91838] = {
        name = "Зло слабеет",
    },
    [91839] = {
        name = "Отвергнутая жертва",
    },
    [91840] = {
        name = "Никто не восстанет",
    },
    [91842] = {
        name = "Разоружение Темной Орды",
    },
    [91854] = {
        name = "Сгущающиеся тени",
    },
    [91872] = {
        name = "Бывший корнестраж",
    },
    [91873] = {
        name = "Буферная зона",
    },
    [91874] = {
        name = "Поджигай!",
    },
    [91875] = {
        name = "Естественное лекарство",
    },
    [91876] = {
        name = "Забота и надежда",
    },
    [91884] = {
        name = "Иллюзия движения",
    },
    [91885] = {
        name = "Я высосу тебя",
    },
    [91886] = {
        name = "Зловещие голоса",
    },
    [91887] = {
        name = "Власть обмана",
    },
    [91958] = {
        name = "Берлога Налоракка: Непрощенный",
    },
    [91963] = {
        name = "Амок",
    },
    [91967] = {
        name = "Тебе знакомо это зло?",
    },
    [92021] = {
        name = "Сбор могильноцвета",
    },
    [92022] = {
        name = "Отравленное место",
    },
    [92023] = {
        name = "Подозрительные товары",
    },
    [92024] = {
        name = "Вызов на дом",
    },
    [92025] = {
        name = "Цветы для Амальтеи",
    },
    [92061] = {
        name = "Нарастающая буря",
    },
    [92084] = {
        name = "Хитрость Халаззи",
    },
    [92136] = {
        name = "Вселение надежды",
    },
    [92155] = {
        name = "Объективный экзорцизм",
    },
    [92156] = {
        name = "Оно идет за мной",
    },
    [92157] = {
        name = "Ритуальная активность",
    },
    [92158] = {
        name = "Впусти его",
    },
    [92159] = {
        name = "Пункт назначения",
    },
    [92163] = {
        name = "Лоа мурлоков",
    },
    [92164] = {
        name = "Безумие мурлоков",
    },
    [92165] = {
        name = "Рыбы – еда, а не друзья",
    },
    [92166] = {
        name = "Искусный подыгрыш",
    },
    [92167] = {
        name = "Останется только один",
    },
    [92390] = {
        name = "Риск ради науки",
    },
    [92396] = {
        name = "Просьба о помощи",
    },
    [92397] = {
        name = "Защита Утренней Звезды",
    },
    [92398] = {
        name = "И тут они двинулись",
    },
    [92408] = {
        name = "Материальные выгоды",
    },
    [92450] = {
        name = "Взрослеть – это сложно",
    },
    [92451] = {
        name = "Кажется, я смогу",
    },
    [92452] = {
        name = "Не по плану",
    },
    [92453] = {
        name = "Бесстрашие",
    },
    [92492] = {
        name = "Дань памяти жертвам",
    },
    [92493] = {
        name = "То, что осталось от Айдаго",
    },
    [92495] = {
        name = "Помешать Клинку",
    },
    [92496] = {
        name = "Копья против теней",
    },
    [92497] = {
        name = "Простенькая магия",
    },
    [92499] = {
        name = "Мудрые лидеры идут следом",
    },
    [92505] = {
        name = "Правда о прошлом",
    },
    [92506] = {
        name = "Цена души",
    },
    [92507] = {
        name = "Более сильный враг",
    },
    [92508] = {
        name = "Жертвенная метка",
    },
    [92509] = {
        name = "Острое орудие",
    },
    [92510] = {
        name = "Насыщение Тьмой",
    },
    [92511] = {
        name = "Горизонт событий",
    },
    [92512] = {
        name = "Пожиратель",
    },
    [92531] = {
        name = "Святилище лоа исцеления",
    },
    [92603] = {
        name = "Одинокая звезда",
    },
    [92604] = {
        name = "Язык крови",
    },
    [92605] = {
        name = "Прямой как кость",
    },
    [92606] = {
        name = "Прими свой дар",
    },
    [92607] = {
        name = "И вырезай новые формы",
    },
    [92616] = {
        name = "Грибная храбрость",
    },
    [92617] = {
        name = "Грибная стойкость",
    },
    [92618] = {
        name = "Грибная уверенность",
    },
    [92641] = {
        name = "Окровавленные равнины",
    },
    [92657] = {
        name = "Надвигающийся шторм",
    },
    [92658] = {
        name = "Тактический захват",
    },
    [92659] = {
        name = "Изъятие ресурсов",
    },
    [92660] = {
        name = "Нуль-инструменты",
    },
    [92661] = {
        name = "Меж молотом и наковальней",
    },
    [92662] = {
        name = "Коллапс ядра",
    },
    [92694] = {
        name = "Мрак среди красок",
    },
    [92695] = {
        name = "Мазки бури",
    },
    [92696] = {
        name = "Возрожденные цвета",
    },
    [92697] = {
        name = "Оттенки завтрашнего дня",
    },
    [92728] = {
        name = "Собачий погром",
    },
    [92729] = {
        name = "Собачьи неприятности",
    },
    [92732] = {
        name = "Волнение Света",
    },
    [92736] = {
        name = "Прогулка Света",
    },
    [92737] = {
        name = "Ярость Света",
    },
    [92738] = {
        name = "Бульбожаблики",
    },
    [92739] = {
        name = "Адзи все",
    },
    [92864] = {
        name = "Пусть скитаются в другом месте",
    },
    [92865] = {
        name = "Растительное питание",
    },
    [92866] = {
        name = "Ре-гидра-ция",
    },
    [92868] = {
        name = "Он побежал туда",
    },
    [92869] = {
        name = "Беда с солнцеусами",
    },
    [92870] = {
        name = "А теперь на место!",
    },
    [92882] = {
        name = "Мольба охотника",
    },
    [92883] = {
        name = "Долг охотника",
    },
    [92884] = {
        name = "Оружие охотника",
    },
    [92885] = {
        name = "Добыча охотника",
    },
    [92939] = {
        name = "Это не просто камень!",
    },
    [92944] = {
        name = "Копание в Бездне",
    },
    [92946] = {
        name = "Погребенные во тьме",
    },
    [92948] = {
        name = "Чрезмерно увлекшись",
    },
    [93047] = {
        name = "Основы разделки",
    },
    [93048] = {
        name = "Нет чувства ритма",
    },
    [93049] = {
        name = "Помощь с уроками",
    },
    [93050] = {
        name = "История алтарей",
    },
    [93051] = {
        name = "Последний экзамен",
    },
    [93093] = {
        name = "Трофеи дряздинов",
    },
    [93094] = {
        name = "Бескровная победа",
    },
    [93095] = {
        name = "Горькая ярость",
    },
    [93096] = {
        name = "Честь амани",
    },
    [93178] = {
        name = "Прерванная легкая прогулка",
    },
    [93179] = {
        name = "Детская преданность",
    },
    [93180] = {
        name = "Приготовления у святилища",
    },
    [93181] = {
        name = "Храм и чайник",
    },
    [93182] = {
        name = "Целительная сила дома",
    },
    [93257] = {
        name = "Опасность для Сломанного Клыка",
    },
    [93258] = {
        name = "Странности с крабами",
    },
    [93259] = {
        name = "Несговорчивые клешневики",
    },
    [93260] = {
        name = "Клетки для крабов",
    },
    [93261] = {
        name = "Необычно огромный краб",
    },
    [93396] = {
        name = "Треск по швам",
    },
    [93432] = {
        name = "Топор войны",
    },
    [93433] = {
        name = "Освящено, запечатано, доставлено",
    },
    [93435] = {
        name = "Четыре подстрекателя",
    },
    [93436] = {
        name = "Невинным – чары, виновным – хаос",
    },
    [93437] = {
        name = "Их же кровью",
    },
    [93440] = {
        name = "Личная история",
    },
    [93566] = {
        name = "Известность среди племени Амани",
    },
    [93651] = {
        name = "Слепящая долина: корни светоцвета",
    },
    [93667] = {
        name = "Галечный лагерь",
    },
    [93734] = {
        name = "Ценные безделушки",
    },
    [93801] = {
        name = "Расчетливое истребление",
    },
    [93811] = {
        name = "Известность при дворе Луносвета",
    },
    [94370] = {
        name = "Подползая ближе",
    },
    [94371] = {
        name = "Мечта следопыта",
    },
    [94388] = {
        name = "Второй раз – уже не случайность",
    },
    [94393] = {
        name = "Карьерные советы",
    },
    [94396] = {
        name = "С небес на землю",
    },
    [94677] = {
        name = "Пропавший корнестраж",
    },
    [94844] = {
        name = "Арена Шрама Бездны: за мою Орду",
    },
    [94845] = {
        name = "Арена Шрама Бездны: Бастион мощи",
    },
    [94848] = {
        name = "Арена Шрама Бездны: спровоцированная жестокость",
    },
    [94849] = {
        name = "Арена Шрама Бездны: давняя вражда",
    },
    [94855] = {
        name = "Арена Шрама Бездны: забытые распри",
    },
    [94867] = {
        name = "Заблудившиеся в Атал'Абаси",
    },
    [94871] = {
        name = "Вечная Песня",
    },
    [94993] = {
        name = "Приключения в Midnight",
    },
    [95008] = {
        name = "Приключения в Midnight",
    },
    [95276] = {
        name = "Последний рывок",
    },
})
]])()
