----- AUTO GENERATED - DO NOT EDIT

if GetLocale() ~= "koKR" then
    return
end

loadstring([[
BtWQuestsDatabase:UpdateQuestsTable({
    [86509] = {
        name = "친구든 적이든",
    },
    [86510] = {
        name = "압도적인 암영",
    },
    [86511] = {
        name = "심연의 끝자락",
    },
    [86512] = {
        name = "수확",
    },
    [86513] = {
        name = "파도에 맞서라",
    },
    [86514] = {
        name = "구덩이의 여인",
    },
    [86515] = {
        name = "속이 빈 허기",
    },
    [86516] = {
        name = "누구나 사냥감이 된다",
    },
    [86517] = {
        name = "공허 속에서 사라지다",
    },
    [86518] = {
        name = "포식의 견장",
    },
    [86519] = {
        name = "심연, 심연 속으로",
    },
    [86520] = {
        name = "빛 추적",
    },
    [86521] = {
        name = "공결탑 제나스: 일월식",
    },
    [86522] = {
        name = "도래하는 햇빛",
    },
    [86528] = {
        name = "금이 간 투영 열쇠",
    },
    [86530] = {
        name = "첫 번째, 외장재",
    },
    [86531] = {
        name = "작업 방해",
    },
    [86536] = {
        name = "믿음직한 적",
    },
    [86537] = {
        name = "불안한 연결망",
    },
    [86538] = {
        name = "두 번째, 연료",
    },
    [86539] = {
        name = "나루!",
    },
    [86540] = {
        name = "세 번째, 폭파",
    },
    [86541] = {
        name = "혹시 모르니까...",
    },
    [86542] = {
        name = "어둠 속의 깜빡임",
    },
    [86543] = {
        name = "마법학자의 정원: 귀환",
    },
    [86544] = {
        name = "사후 분석",
    },
    [86545] = {
        name = "빛의 낙인",
    },
    [86549] = {
        name = "어둠 따위 두렵지 않아",
    },
    [86557] = {
        name = "반목과 죽음의 문제",
    },
    [86558] = {
        name = "자그마한 마음의 평화",
    },
    [86559] = {
        name = "머나먼 경계",
    },
    [86561] = {
        name = "기묘하고 낯선 세계",
    },
    [86562] = {
        name = "죽음과의 춤",
    },
    [86565] = {
        name = "악인을 위한 기도는 없다",
    },
    [86621] = {
        name = "외고집 마법학자",
    },
    [86622] = {
        name = "우연한 만남",
    },
    [86623] = {
        name = "공허에 대한 호소",
    },
    [86624] = {
        name = "합리적인 사유",
    },
    [86626] = {
        name = "엉망이 된 실험실",
    },
    [86632] = {
        name = "트랜퀼리엔 전투",
    },
    [86633] = {
        name = "공허의 이해",
    },
    [86634] = {
        name = "과거는 시선을 거두지 않는다",
    },
    [86635] = {
        name = "데솔름으로",
    },
    [86636] = {
        name = "공허와 함께 춤을",
    },
    [86637] = {
        name = "안심할 틈은 없다",
    },
    [86638] = {
        name = "옥죄는 촉수",
    },
    [86639] = {
        name = "남은 것들",
    },
    [86640] = {
        name = "흉조",
    },
    [86641] = {
        name = "오래된 흉터",
    },
    [86642] = {
        name = "보이지 않는 적",
    },
    [86643] = {
        name = "뿌리를 따라서",
    },
    [86644] = {
        name = "눈앞의 신",
    },
    [86646] = {
        name = "난국",
    },
    [86647] = {
        name = "피가 울릴 때",
    },
    [86648] = {
        name = "빛이 우리를 인도하길",
    },
    [86649] = {
        name = "구원을 넘어",
    },
    [86650] = {
        name = "균열",
    },
    [86652] = {
        name = "어둠 속에 남겨지다",
    },
    [86653] = {
        name = "아마니의 길",
    },
    [86654] = {
        name = "혹부리나무족 타격",
    },
    [86655] = {
        name = "고대의 길",
    },
    [86656] = {
        name = "잔혹한 연회",
    },
    [86657] = {
        name = "그늘분지 감시터",
    },
    [86658] = {
        name = "안개 속 납골당",
    },
    [86659] = {
        name = "안개 돌파",
    },
    [86660] = {
        name = "어둠으로부터의 구원",
    },
    [86661] = {
        name = "죽은 로아의 석탄",
    },
    [86663] = {
        name = "화염의 불씨",
    },
    [86664] = {
        name = "선견지명인가, 화상인가",
    },
    [86665] = {
        name = "불을 직시하다",
    },
    [86666] = {
        name = "환생의 그림자 아래에서",
    },
    [86681] = {
        name = "날로라크의 소굴: 복수의 맛",
    },
    [86682] = {
        name = "날로라크의 소굴: 곰을 깨우다",
    },
    [86683] = {
        name = "하셰이의 등장",
    },
    [86684] = {
        name = "칼날의 끝자락",
    },
    [86685] = {
        name = "부수고 쪼개라",
    },
    [86686] = {
        name = "무분별한 빛",
    },
    [86687] = {
        name = "수송관의 위기",
    },
    [86692] = {
        name = "부서진 칼날",
    },
    [86693] = {
        name = "하셰이의 전설",
    },
    [86708] = {
        name = "줄아만의 관문",
    },
    [86710] = {
        name = "명명백백한 방어선",
    },
    [86711] = {
        name = "아마니의 부름",
    },
    [86712] = {
        name = "아마니는 무너지지 않으리라",
    },
    [86715] = {
        name = "의식 중단",
    },
    [86716] = {
        name = "빛의 무장",
    },
    [86717] = {
        name = "가치를 증명하라",
    },
    [86718] = {
        name = "황혼의 피",
    },
    [86719] = {
        name = "아마니 핵심 인물",
    },
    [86720] = {
        name = "칼날 부러뜨리기",
    },
    [86721] = {
        name = "우리의 희생과 노력",
    },
    [86722] = {
        name = "아마니의 심장",
    },
    [86723] = {
        name = "고립",
    },
    [86733] = {
        name = "실버문 협상 회담",
    },
    [86734] = {
        name = "외교",
    },
    [86735] = {
        name = "재로 덮인 길",
    },
    [86736] = {
        name = "재로 덮인 길",
    },
    [86737] = {
        name = "산들바람 아래 피어나는 빛",
    },
    [86738] = {
        name = "뾰족아귀",
    },
    [86739] = {
        name = "산들바람의 호의",
    },
    [86740] = {
        name = "떠도는 주민들",
    },
    [86741] = {
        name = "빛만개의 그림자",
    },
    [86742] = {
        name = "독특한 배양물",
    },
    [86743] = {
        name = "빛만개 손질",
    },
    [86744] = {
        name = "진실 추적",
    },
    [86745] = {
        name = "실버문에 소식 전하기",
    },
    [86769] = {
        name = "마지막 빛의 보루",
    },
    [86770] = {
        name = "쿠엘다나스의 용사",
    },
    [86780] = {
        name = "영웅의 항전",
    },
    [86781] = {
        name = "과거와의 대면",
    },
    [86805] = {
        name = "위기의 순간",
    },
    [86806] = {
        name = "빛나는 날개",
    },
    [86807] = {
        name = "관문",
    },
    [86808] = {
        name = "아리송한 전령",
    },
    [86809] = {
        name = "신념의 시험",
    },
    [86811] = {
        name = "에테리얼 박멸",
    },
    [86822] = {
        name = "마지막 성물",
    },
    [86823] = {
        name = "암흑 호드",
    },
    [86824] = {
        name = "무엇도 남기지 않는다",
    },
    [86825] = {
        name = "진실된 신도, 거짓된 대의",
    },
    [86826] = {
        name = "흉터의 나고쉬",
    },
    [86827] = {
        name = "응당한 인정",
    },
    [86828] = {
        name = "트롤의 파멸만이 아니야",
    },
    [86829] = {
        name = "중대한 순간",
    },
    [86830] = {
        name = "암흑 호드의 진정한 호드",
    },
    [86831] = {
        name = "전쟁군주가 없는 전사들",
    },
    [86832] = {
        name = "뛰어난 제련소",
    },
    [86833] = {
        name = "보루의 재탄생",
    },
    [86834] = {
        name = "공허살이 추방",
    },
    [86836] = {
        name = "사냥꾼의 기다림",
    },
    [86837] = {
        name = "태양샘 화합",
    },
    [86838] = {
        name = "지친 자에게 활력을",
    },
    [86839] = {
        name = "희망의 빛 예배당의 성물",
    },
    [86840] = {
        name = "꺼져가는 희망",
    },
    [86841] = {
        name = "옛 성기사의 유물들",
    },
    [86842] = {
        name = "붉은 힘",
    },
    [86843] = {
        name = "그릇된 빛의 방향",
    },
    [86844] = {
        name = "달라진 빛의 목적",
    },
    [86845] = {
        name = "태양길잡이의 길",
    },
    [86846] = {
        name = "보급원 재보급",
    },
    [86848] = {
        name = "빛의 무기고",
    },
    [86849] = {
        name = "분노 방출",
    },
    [86850] = {
        name = "부서진 태양",
    },
    [86851] = {
        name = "알른의 근간",
    },
    [86852] = {
        name = "빛의 마지막 저항",
    },
    [86855] = {
        name = "책무의 결과",
    },
    [86856] = {
        name = "부름 잠재우기",
    },
    [86857] = {
        name = "균열로의 하강",
    },
    [86858] = {
        name = "뿌리 깊은 광기",
    },
    [86859] = {
        name = "해결 방안 찾기",
    },
    [86860] = {
        name = "성장하기 전에",
    },
    [86861] = {
        name = "현신 몰이 사냥",
    },
    [86862] = {
        name = "거대한 알른",
    },
    [86864] = {
        name = "소굴 감시",
    },
    [86865] = {
        name = "문제를 찾아서",
    },
    [86866] = {
        name = "치유의 가능성",
    },
    [86867] = {
        name = "빛만개 속으로",
    },
    [86868] = {
        name = "선의의 유람",
    },
    [86874] = {
        name = "빛의 도태",
    },
    [86877] = {
        name = "정의로운 가지치기",
    },
    [86880] = {
        name = "사랑하는 이의 귀환",
    },
    [86881] = {
        name = "근원에서",
    },
    [86882] = {
        name = "알른가루의 정당한 주인",
    },
    [86883] = {
        name = "광기 어린 행진",
    },
    [86884] = {
        name = "통제된 방화",
    },
    [86885] = {
        name = "흐름 끊기",
    },
    [86887] = {
        name = "효율적인 후퇴",
    },
    [86890] = {
        name = "목격담",
    },
    [86891] = {
        name = "최후의 수단",
    },
    [86892] = {
        name = "생존",
    },
    [86894] = {
        name = "알른하라의 선물",
    },
    [86896] = {
        name = "빛은 길은 찾는 법",
    },
    [86897] = {
        name = "광란 진압",
    },
    [86898] = {
        name = "하라니르의 등장",
    },
    [86899] = {
        name = "뿌리 깊은 문제",
    },
    [86900] = {
        name = "하라시르를 향하여",
    },
    [86901] = {
        name = "균열과 소굴",
    },
    [86902] = {
        name = "유물 포기",
    },
    [86903] = {
        name = "아르칸티나",
    },
    [86907] = {
        name = "메아리의 소굴",
    },
    [86910] = {
        name = "쿠자트의 사원",
    },
    [86911] = {
        name = "메아리와 기억",
    },
    [86912] = {
        name = "뿌릿길을 따라",
    },
    [86913] = {
        name = "하르마라 오두막",
    },
    [86914] = {
        name = "하르마라 돌보기",
    },
    [86929] = {
        name = "의회 소집",
    },
    [86930] = {
        name = "씨앗 뿌리기",
    },
    [86942] = {
        name = "확산 저지",
    },
    [86944] = {
        name = "균열의 씨앗",
    },
    [86956] = {
        name = "움직이는 꽃",
    },
    [86973] = {
        name = "하르마라 구하기",
    },
    [86997] = {
        name = "마법책 실랑이",
    },
    [86998] = {
        name = "훈련 일대기",
    },
    [87002] = {
        name = "학술적 동경",
    },
    [87254] = {
        name = "저주 정화",
    },
    [87256] = {
        name = "대체 의학",
    },
    [87267] = {
        name = "충족되지 않은 수요",
    },
    [87268] = {
        name = "참회의 조건",
    },
    [87317] = {
        name = "거부의 거부",
    },
    [87388] = {
        name = "더 큰 야수",
    },
    [87391] = {
        name = "토착 생물 표본 채취",
    },
    [87392] = {
        name = "화물에 얽힌 음모",
    },
    [87393] = {
        name = "수색 영장",
    },
    [87394] = {
        name = "보급원 감시",
    },
    [87395] = {
        name = "소금물 날리기",
    },
    [87396] = {
        name = "현행범",
    },
    [87397] = {
        name = "화물 담보",
    },
    [87398] = {
        name = "밀수업자와의 대결",
    },
    [87399] = {
        name = "태양 앞에서",
    },
    [87400] = {
        name = "햇살 속에서 바스러지다",
    },
    [87401] = {
        name = "정원사 사고",
    },
    [87402] = {
        name = "빛의 은혜는 하해와 같아서",
    },
    [87455] = {
        name = "시련과 고난",
    },
    [87456] = {
        name = "흩어진 기념품",
    },
    [87457] = {
        name = "가장 잘하는 재주",
    },
    [87458] = {
        name = "채무 상환",
    },
    [87672] = {
        name = "온누리에 공허를",
    },
    [88653] = {
        name = "노른자는 내 것",
    },
    [88708] = {
        name = "격렬한 결과",
    },
    [88719] = {
        name = "빛이 전하는 목소리",
    },
    [88755] = {
        name = "학구적 열망",
    },
    [88768] = {
        name = "어둠의 하수인",
    },
    [88977] = {
        name = "범죄의 재구성",
    },
    [88978] = {
        name = "흔적을 따라서",
    },
    [88979] = {
        name = "현행범",
    },
    [88985] = {
        name = "수익 회수",
    },
    [88986] = {
        name = "좀도둑의 눈을 가리면",
    },
    [88987] = {
        name = "파괴 공작 수습",
    },
    [88988] = {
        name = "장인의 제자",
    },
    [88989] = {
        name = "또 한 놈이 톱밥을 먹네",
    },
    [89012] = {
        name = "안전한 길",
    },
    [89034] = {
        name = "불타는 씁쓸꽃",
    },
    [89035] = {
        name = "하라티 영예",
    },
    [89193] = {
        name = "아라토르",
    },
    [89199] = {
        name = "사소한 과제",
    },
    [89200] = {
        name = "수호물 해체 작업",
    },
    [89201] = {
        name = "뛰는 놈 위에 나는 놈 있다",
    },
    [89202] = {
        name = "둥지 휘젓기",
    },
    [89203] = {
        name = "공동의 혜택",
    },
    [89204] = {
        name = "절도범",
    },
    [89205] = {
        name = "열쇠를 깎다",
    },
    [89206] = {
        name = "강제 침입",
    },
    [89207] = {
        name = "쥐도 궁지에 몰리면",
    },
    [89208] = {
        name = "빚진 것",
    },
    [89230] = {
        name = "전사가 아닌 연인으로서",
    },
    [89231] = {
        name = "연인이 아닌 전사로서",
    },
    [89233] = {
        name = "사랑의 삼각관계",
    },
    [89249] = {
        name = "압도당함",
    },
    [89271] = {
        name = "우리 아들",
    },
    [89334] = {
        name = "문제에 앞서",
    },
    [89338] = {
        name = "농기구 모으기 운동",
    },
    [89383] = {
        name = "모험심 강한 어린이",
    },
    [89384] = {
        name = "굶주린 무리",
    },
    [89385] = {
        name = "부모의 세계, 그 첫걸음",
    },
    [89386] = {
        name = "횃대 개발",
    },
    [89388] = {
        name = "공허폭풍",
    },
    [89402] = {
        name = "하란다르",
    },
    [89503] = {
        name = "우울한 형제",
    },
    [89506] = {
        name = "탄탄한 관계",
    },
    [89513] = {
        name = "풍요의 덧불",
    },
    [89559] = {
        name = "무분별한 신앙",
    },
    [89560] = {
        name = "조용한 작별 인사",
    },
    [89565] = {
        name = "애도의 길",
    },
    [90094] = {
        name = "사냥의 메아리",
    },
    [90095] = {
        name = "부름의 메아리",
    },
    [90467] = {
        name = "하늘의 이야기",
    },
    [90468] = {
        name = "이런 잡일을 시키다니!",
    },
    [90469] = {
        name = "굳세어라, 질풍노도의 쿠리",
    },
    [90470] = {
        name = "하늘유리 수거",
    },
    [90474] = {
        name = "알른샤란의 전설",
    },
    [90481] = {
        name = "허가증도 받았어",
    },
    [90482] = {
        name = "요리의 유대",
    },
    [90483] = {
        name = "마른나무껍질의 이야기",
    },
    [90484] = {
        name = "관광객 스테고돈",
    },
    [90485] = {
        name = "유물 생각은 나중에",
    },
    [90486] = {
        name = "위험한 별미",
    },
    [90493] = {
        name = "트랜퀼리엔의 심장",
    },
    [90494] = {
        name = "사라진 마법학자",
    },
    [90509] = {
        name = "트랜퀼리엔의 배신자",
    },
    [90533] = {
        name = "오르웨냐를 찾아라!",
    },
    [90534] = {
        name = "하라니르의 고향",
    },
    [90535] = {
        name = "흔적 남기기",
    },
    [90537] = {
        name = "늦게 피는 꽃",
    },
    [90540] = {
        name = "루타니 구출",
    },
    [90544] = {
        name = "멍멍 도둑",
    },
    [90546] = {
        name = "사라진 성기사",
    },
    [90547] = {
        name = "사라진 성기사",
    },
    [90548] = {
        name = "황혼의 서신",
    },
    [90549] = {
        name = "다툼의 흔적",
    },
    [90550] = {
        name = "음울에 잠긴 태양",
    },
    [90551] = {
        name = "사로잡힌 정보",
    },
    [90552] = {
        name = "심문",
    },
    [90553] = {
        name = "칼날의 최후",
    },
    [90554] = {
        name = "잿더미로 얼룩진 자취",
    },
    [90555] = {
        name = "자유의 축복",
    },
    [90556] = {
        name = "우두머리를 쳐내라",
    },
    [90568] = {
        name = "뜻밖의 친구",
    },
    [90569] = {
        name = "다시 가방으로",
    },
    [90570] = {
        name = "데솔름 폐허로 이동",
    },
    [90571] = {
        name = "야수 전문가",
    },
    [90601] = {
        name = "광채버섯 채집",
    },
    [90602] = {
        name = "곰푸스타",
    },
    [90615] = {
        name = "원한과 응어리",
    },
    [90616] = {
        name = "강하다고?",
    },
    [90617] = {
        name = "유쾌한 친구들",
    },
    [90619] = {
        name = "죽지 않을 만큼의 고통은",
    },
    [90620] = {
        name = "투기장으로",
    },
    [90621] = {
        name = "꼬마 영웅의 여정",
    },
    [90622] = {
        name = "아직은 불패의 제왕",
    },
    [90669] = {
        name = "황금은 황금이다",
    },
    [90749] = {
        name = "공동의 적",
    },
    [90772] = {
        name = "높이 치솟는 불꽃",
    },
    [90782] = {
        name = "황천사자",
    },
    [90818] = {
        name = "죽음의 골목: 가벼운 입",
    },
    [90819] = {
        name = "죽음의 골목: 역할 수행",
    },
    [90821] = {
        name = "죽음의 골목: 잠든 비밀",
    },
    [90822] = {
        name = "죽음의 골목: 인세의 지옥",
    },
    [90824] = {
        name = "형제의 생존",
    },
    [90826] = {
        name = "아루아의 치유의 물",
    },
    [90827] = {
        name = "독성 부위 한정",
    },
    [90829] = {
        name = "스승과의 만남",
    },
    [90830] = {
        name = "스스로 드러나는 길",
    },
    [90831] = {
        name = "실천의 증명",
    },
    [90832] = {
        name = "그분의 목소리가 침묵에 잠기되",
    },
    [90833] = {
        name = "마지막 의식",
    },
    [90834] = {
        name = "이 시점 이후로",
    },
    [90835] = {
        name = "죽음의 골목: 파다한 소문",
    },
    [90837] = {
        name = "죽음의 골목: 지옥의 자취",
    },
    [90838] = {
        name = "맹세와 가보",
    },
    [90844] = {
        name = "번뜩이는 명료함",
    },
    [90845] = {
        name = "아득한 기억",
    },
    [90847] = {
        name = "힘에서 비롯된 진실",
    },
    [90848] = {
        name = "피워낸 불꽃",
    },
    [90851] = {
        name = "스스로를 좀먹다",
    },
    [90852] = {
        name = "마도공학 파동",
    },
    [90858] = {
        name = "억압자 탄압",
    },
    [90860] = {
        name = "멍에를 벗어던지고",
    },
    [90866] = {
        name = "만국 공통의 언어",
    },
    [90872] = {
        name = "적셔!",
    },
    [90873] = {
        name = "격정적인 기쁨",
    },
    [90874] = {
        name = "격렬한 최후",
    },
    [90875] = {
        name = "세계를 종횡무진하며",
    },
    [90907] = {
        name = "가장 먼저 알아야 할 사람",
    },
    [90910] = {
        name = "압도적인 어둠",
    },
    [90914] = {
        name = "타고난 살육자",
    },
    [90915] = {
        name = "공격 책략",
    },
    [90916] = {
        name = "파괴를 향한 갈망",
    },
    [90917] = {
        name = "야성의 수확자",
    },
    [90918] = {
        name = "용서받지 못한 자",
    },
    [90919] = {
        name = "실패한 악귀",
    },
    [90920] = {
        name = "영혼의 온기",
    },
    [90922] = {
        name = "몰락한 경야",
    },
    [90923] = {
        name = "공포의 양치기",
    },
    [90924] = {
        name = "악랄한 최후",
    },
    [90963] = {
        name = "틈새의 동굴",
    },
    [91000] = {
        name = "겸손한 종복",
    },
    [91001] = {
        name = "길을 열어라",
    },
    [91062] = {
        name = "부러진 다리",
    },
    [91063] = {
        name = "만개하는 격자",
    },
    [91065] = {
        name = "꽃잎 훔치기",
    },
    [91069] = {
        name = "톨바니의 복수",
    },
    [91070] = {
        name = "상품 되찾기",
    },
    [91071] = {
        name = "아탈아바시의 위협",
    },
    [91085] = {
        name = "뾰족한 꽃잎",
    },
    [91086] = {
        name = "새싹 꺾기",
    },
    [91087] = {
        name = "보고서 제출",
    },
    [91088] = {
        name = "폭포 뒤에는",
    },
    [91090] = {
        name = "성가신 해충들",
    },
    [91136] = {
        name = "바위에 새겨진 기억",
    },
    [91137] = {
        name = "빛 속의 방황",
    },
    [91145] = {
        name = "정복당한 영웅",
    },
    [91146] = {
        name = "꺼져가는 빛",
    },
    [91147] = {
        name = "줄을 끊다",
    },
    [91148] = {
        name = "군식구",
    },
    [91149] = {
        name = "나를 파묻지 않기를",
    },
    [91206] = {
        name = "로아의 동요",
    },
    [91270] = {
        name = "가장 중요한 것",
    },
    [91271] = {
        name = "생선!",
    },
    [91274] = {
        name = "공허를 끊어내다",
    },
    [91281] = {
        name = "한밤",
    },
    [91284] = {
        name = "아직 선택하지 않은 길",
    },
    [91288] = {
        name = "사냥의 시험",
    },
    [91291] = {
        name = "피의 시험",
    },
    [91292] = {
        name = "비전의 시험",
    },
    [91301] = {
        name = "제자를 가르치는 방법",
    },
    [91328] = {
        name = "비밀 재료",
    },
    [91339] = {
        name = "미리 싹을 뽑다",
    },
    [91340] = {
        name = "폭력을 위하여",
    },
    [91341] = {
        name = "무제한",
    },
    [91342] = {
        name = "정석",
    },
    [91343] = {
        name = "야심의 보상",
    },
    [91345] = {
        name = "북쪽 탑으로",
    },
    [91346] = {
        name = "여신의 자양분",
    },
    [91347] = {
        name = "순찰대의 쇄도",
    },
    [91348] = {
        name = "마나 지룡에 관하여",
    },
    [91349] = {
        name = "숲의 어두운 부분",
    },
    [91350] = {
        name = "진정한 과제",
    },
    [91359] = {
        name = "진균 덩굴손 퇴치제",
    },
    [91360] = {
        name = "잡초 뽑기",
    },
    [91361] = {
        name = "업무 복귀?",
    },
    [91363] = {
        name = "어둠의 수확",
    },
    [91375] = {
        name = "펑가라 마을의 침묵",
    },
    [91376] = {
        name = "작은 괴물",
    },
    [91377] = {
        name = "망자의 자손",
    },
    [91378] = {
        name = "너는 전설이다",
    },
    [91379] = {
        name = "부패한 땅",
    },
    [91380] = {
        name = "짐승의 뱃속",
    },
    [91381] = {
        name = "과묵한 악",
    },
    [91382] = {
        name = "강한 힘과 우월함",
    },
    [91383] = {
        name = "정리정돈",
    },
    [91384] = {
        name = "구조 임무",
    },
    [91385] = {
        name = "순찰자의 영혼",
    },
    [91386] = {
        name = "광기의 척도",
    },
    [91388] = {
        name = "특이한 실",
    },
    [91389] = {
        name = "옷이 사람을 만든다",
    },
    [91391] = {
        name = "계속되는 정찰",
    },
    [91403] = {
        name = "마비를 유발할 수도 있음",
    },
    [91404] = {
        name = "극악의 맹독",
    },
    [91405] = {
        name = "맹독 검증",
    },
    [91406] = {
        name = "동부 내륙지에서 저 멀리",
    },
    [91407] = {
        name = "로아의 눈",
    },
    [91408] = {
        name = "샤드라 탐색",
    },
    [91409] = {
        name = "거미의 꿈",
    },
    [91410] = {
        name = "공동의 로아",
    },
    [91411] = {
        name = "마이사라 동굴: 마이사라 깊은 곳",
    },
    [91412] = {
        name = "맹독 여왕의 귀환",
    },
    [91450] = {
        name = "준비는 끝났다",
    },
    [91452] = {
        name = "지식의 지평",
    },
    [91462] = {
        name = "중앙 탑으로",
    },
    [91463] = {
        name = "남쪽 탑으로",
    },
    [91493] = {
        name = "이런 걸 시킨 적 없는데",
    },
    [91494] = {
        name = "한 엘프의 쓰레기는 다른 엘프의 보물",
    },
    [91495] = {
        name = "위험에 처한 지인",
    },
    [91504] = {
        name = "비전력의 합일",
    },
    [91505] = {
        name = "등에 꽂힌 비수",
    },
    [91533] = {
        name = "우리가 남긴 것들",
    },
    [91535] = {
        name = "무덤까지 편안하게 모십니다",
    },
    [91536] = {
        name = "한 포기 잡초처럼",
    },
    [91537] = {
        name = "직시",
    },
    [91541] = {
        name = "굴레를 벗어난 감정",
    },
    [91542] = {
        name = "내 안의 마을",
    },
    [91543] = {
        name = "주도권 탈환",
    },
    [91544] = {
        name = "익숙한 마력",
    },
    [91545] = {
        name = "더 강해진 모습으로",
    },
    [91546] = {
        name = "찾아오는 변화",
    },
    [91550] = {
        name = "침묵과 어둠의 유희",
    },
    [91551] = {
        name = "둥지 시위",
    },
    [91552] = {
        name = "깃털의 분노",
    },
    [91553] = {
        name = "하라니르의 사전에 죽음은 없다!",
    },
    [91556] = {
        name = "로아의 불꽃",
    },
    [91557] = {
        name = "허물로 보내는 전언",
    },
    [91558] = {
        name = "치명적인 꽃잎",
    },
    [91559] = {
        name = "악성 해충",
    },
    [91560] = {
        name = "탐험가 제거",
    },
    [91561] = {
        name = "피살이 병원체",
    },
    [91563] = {
        name = "할라지의 사냥",
    },
    [91565] = {
        name = "공허흉터 투기장: 비탄의 첨탑",
    },
    [91566] = {
        name = "공허흉터 투기장: 증오의 첨탑",
    },
    [91583] = {
        name = "공허흉터 투기장: 용맹의 보루",
    },
    [91585] = {
        name = "싹트는 정원",
    },
    [91586] = {
        name = "토양 기반 대체재",
    },
    [91587] = {
        name = "사체 요리",
    },
    [91588] = {
        name = "하란다르의 주방",
    },
    [91589] = {
        name = "뿌리 질주 배달",
    },
    [91597] = {
        name = "공허흉터 투기장: 나의 얼라이언스를 위하여",
    },
    [91598] = {
        name = "공허흉터 투기장: 폭력의 도발",
    },
    [91599] = {
        name = "공허흉터 투기장: 친숙한 원한",
    },
    [91600] = {
        name = "공허흉터 투기장: 무시 일변도",
    },
    [91603] = {
        name = "공허흉터 투기장: 2 대 1",
    },
    [91605] = {
        name = "공허흉터 투기장: 잘못된 편",
    },
    [91606] = {
        name = "공허흉터 투기장: 집 청소",
    },
    [91630] = {
        name = "도둑맞은 시야",
    },
    [91694] = {
        name = "공허흉터 투기장: 무너지는 3인방",
    },
    [91726] = {
        name = "막을 수 없는 힘",
    },
    [91747] = {
        name = "날로라크와는 다르다, 날로라크와는!",
    },
    [91748] = {
        name = "무수한 황혼의 세례",
    },
    [91749] = {
        name = "불의의 현장",
    },
    [91750] = {
        name = "신뢰의 위기",
    },
    [91787] = {
        name = "여정의 끝",
    },
    [91813] = {
        name = "영혼발바닥",
    },
    [91833] = {
        name = "지저분한 심연",
    },
    [91835] = {
        name = "귀가 조치",
    },
    [91836] = {
        name = "토템을 존중하라",
    },
    [91838] = {
        name = "부정의 퇴화",
    },
    [91839] = {
        name = "거부당한 희생",
    },
    [91840] = {
        name = "일어나지 못하는 자",
    },
    [91842] = {
        name = "암흑 호드 무장 해제",
    },
    [91854] = {
        name = "깊어지는 어둠",
    },
    [91872] = {
        name = "선대 뿌리감시관",
    },
    [91873] = {
        name = "완충 지대",
    },
    [91874] = {
        name = "타오르는 불빛",
    },
    [91875] = {
        name = "천연 치료제",
    },
    [91876] = {
        name = "희망을 가꾸다",
    },
    [91884] = {
        name = "움직임의 환영",
    },
    [91885] = {
        name = "동화 작용",
    },
    [91886] = {
        name = "불길한 징조의 목소리",
    },
    [91887] = {
        name = "기만의 지배",
    },
    [91958] = {
        name = "날로라크의 소굴: 용서받지 못한 자",
    },
    [91963] = {
        name = "미친 듯이 날뛰다",
    },
    [91967] = {
        name = "악과의 만남",
    },
    [92021] = {
        name = "무덤꽃 원예",
    },
    [92022] = {
        name = "유독한 소명",
    },
    [92023] = {
        name = "수상한 잡화점",
    },
    [92024] = {
        name = "방문 치료",
    },
    [92025] = {
        name = "아말테아를 위한 꽃",
    },
    [92061] = {
        name = "치솟는 폭풍",
    },
    [92084] = {
        name = "할라지의 간계",
    },
    [92136] = {
        name = "깃드는 희망",
    },
    [92155] = {
        name = "물체 퇴마",
    },
    [92156] = {
        name = "뒤따라오는 것",
    },
    [92157] = {
        name = "의식 활동",
    },
    [92158] = {
        name = "수용",
    },
    [92159] = {
        name = "최종 목적지",
    },
    [92163] = {
        name = "멀록의 로아",
    },
    [92164] = {
        name = "멀록의 광기",
    },
    [92165] = {
        name = "생선은 음식이지 친구가 아니야",
    },
    [92166] = {
        name = "선례를 따라",
    },
    [92167] = {
        name = "오직 하나만이 살아남는다.",
    },
    [92390] = {
        name = "연구 위기",
    },
    [92396] = {
        name = "지원군 요청",
    },
    [92397] = {
        name = "돈스타 방어",
    },
    [92398] = {
        name = "그리고 그들이 왔다",
    },
    [92408] = {
        name = "재료 확보",
    },
    [92450] = {
        name = "성장통",
    },
    [92451] = {
        name = "못 할 것도 없지",
    },
    [92452] = {
        name = "이게... 아닌데...",
    },
    [92453] = {
        name = "용맹",
    },
    [92492] = {
        name = "희생 존중",
    },
    [92493] = {
        name = "이다고의 잔재",
    },
    [92495] = {
        name = "칼날단 교란",
    },
    [92496] = {
        name = "어둠에 맞서는 창",
    },
    [92497] = {
        name = "마법 그 자체",
    },
    [92499] = {
        name = "현명한 지도자를 따라서",
    },
    [92505] = {
        name = "과거의 진실",
    },
    [92506] = {
        name = "영혼의 값",
    },
    [92507] = {
        name = "강력한 적",
    },
    [92508] = {
        name = "희생의 징표",
    },
    [92509] = {
        name = "잔혹한 도구",
    },
    [92510] = {
        name = "암흑 주입",
    },
    [92511] = {
        name = "사건의 지평선",
    },
    [92512] = {
        name = "포식자",
    },
    [92531] = {
        name = "의술의 로아의 제단",
    },
    [92603] = {
        name = "외롭고 고독한 별 하나",
    },
    [92604] = {
        name = "피로 말하다",
    },
    [92605] = {
        name = "노골적인 솔직함",
    },
    [92606] = {
        name = "선물을 받아들이다",
    },
    [92607] = {
        name = "새로운 형상을 빚다",
    },
    [92616] = {
        name = "버섯의 용기",
    },
    [92617] = {
        name = "버섯의 탄력",
    },
    [92618] = {
        name = "버섯의 자신감",
    },
    [92641] = {
        name = "피로 물드는 평원",
    },
    [92657] = {
        name = "끓어오르는 폭풍",
    },
    [92658] = {
        name = "전술적 취득",
    },
    [92659] = {
        name = "자원 차단",
    },
    [92660] = {
        name = "무위의 도구",
    },
    [92661] = {
        name = "망치와 모루의 만남",
    },
    [92662] = {
        name = "핵 붕괴",
    },
    [92694] = {
        name = "안료의 황혼",
    },
    [92695] = {
        name = "폭풍이 몰아친다",
    },
    [92696] = {
        name = "새로 태어난 색채",
    },
    [92697] = {
        name = "미래의 빛깔",
    },
    [92728] = {
        name = "완강한 방해",
    },
    [92729] = {
        name = "번거롭고 귀찮은",
    },
    [92732] = {
        name = "빛의 분란",
    },
    [92736] = {
        name = "빛의 산보",
    },
    [92737] = {
        name = "빛의 살육",
    },
    [92738] = {
        name = "어린 감자꺼비",
    },
    [92739] = {
        name = "요즘 꽃은 말이야...",
    },
    [92864] = {
        name = "저 강물을 거슬러 오르는",
    },
    [92865] = {
        name = "꽃봉오리의 양분",
    },
    [92866] = {
        name = "히드라 양육 일기",
    },
    [92868] = {
        name = "저쪽으로 갔어요",
    },
    [92869] = {
        name = "수상한 낙심",
    },
    [92870] = {
        name = "촐랑촐랑",
    },
    [92882] = {
        name = "사냥꾼의 고난",
    },
    [92883] = {
        name = "사냥꾼의 책무",
    },
    [92884] = {
        name = "사냥꾼의 무기",
    },
    [92885] = {
        name = "사냥꾼의 먹잇감",
    },
    [92939] = {
        name = "평범한 돌이 아니야!",
    },
    [92944] = {
        name = "공허를 솎아내는 방법",
    },
    [92946] = {
        name = "어둠 속에 파묻히다",
    },
    [92948] = {
        name = "능력 밖의 일",
    },
    [93047] = {
        name = "도축의 기본",
    },
    [93048] = {
        name = "사라진 박자감",
    },
    [93049] = {
        name = "숙제 돕기",
    },
    [93050] = {
        name = "제단의 역사",
    },
    [93051] = {
        name = "기말고사",
    },
    [93093] = {
        name = "혹부리나무족 노획품",
    },
    [93094] = {
        name = "수습한 승리",
    },
    [93095] = {
        name = "씁쓸한 분노",
    },
    [93096] = {
        name = "아마니의 명예",
    },
    [93178] = {
        name = "방해받은 고요한 산책",
    },
    [93179] = {
        name = "유치한 헌신",
    },
    [93180] = {
        name = "제단 준비",
    },
    [93181] = {
        name = "사원과 찻주전자",
    },
    [93182] = {
        name = "치유의 터전",
    },
    [93257] = {
        name = "위기의 깨진엄니",
    },
    [93258] = {
        name = "게와 단서",
    },
    [93259] = {
        name = "게 두드려 패기",
    },
    [93260] = {
        name = "게 사로잡기",
    },
    [93261] = {
        name = "비정상적인 크기의 게",
    },
    [93396] = {
        name = "틈새의 파열",
    },
    [93432] = {
        name = "검에서 농기구로",
    },
    [93433] = {
        name = "제단, 봉인, 구원",
    },
    [93435] = {
        name = "네 선동자",
    },
    [93436] = {
        name = "무고한 자에게 사술을, 죄인에게 혼란을",
    },
    [93437] = {
        name = "스스로의 피로",
    },
    [93440] = {
        name = "개인사",
    },
    [93566] = {
        name = "아마니 부족 영예",
    },
    [93651] = {
        name = "눈부신 골짜기: 빛만개의 뿌리",
    },
    [93667] = {
        name = "돌연마 야영지",
    },
    [93734] = {
        name = "소중한 장신구",
    },
    [93801] = {
        name = "계산적인 개체수 조절",
    },
    [93811] = {
        name = "실버문 궁정 영예",
    },
    [94370] = {
        name = "스멀스멀 더 가까이",
    },
    [94371] = {
        name = "순찰자의 꿈",
    },
    [94388] = {
        name = "두 번째 선택",
    },
    [94393] = {
        name = "경력 상담",
    },
    [94396] = {
        name = "고정하는 못",
    },
    [94677] = {
        name = "사라진 뿌리감시관",
    },
    [94844] = {
        name = "공허흉터 투기장: 나의 호드를 위하여",
    },
    [94845] = {
        name = "공허흉터 투기장: 힘의 보루",
    },
    [94848] = {
        name = "공허흉터 투기장: 폭력의 도발",
    },
    [94849] = {
        name = "공허흉터 투기장: 친숙한 원한",
    },
    [94855] = {
        name = "공허흉터 투기장: 무시 일변도",
    },
    [94867] = {
        name = "아탈아바시의 미아",
    },
    [94871] = {
        name = "영원노래",
    },
    [94993] = {
        name = "한밤 모험",
    },
    [95008] = {
        name = "한밤 모험",
    },
    [95276] = {
        name = "최후의 진격",
    },
})
]])()
