----- AUTO GENERATED - DO NOT EDIT

if GetLocale() ~= "zhCN" then
    return
end

loadstring([[
BtWQuestsDatabase:UpdateQuestsTable({
    [86509] = {
        name = "魔鬼还是朋友",
    },
    [86510] = {
        name = "幽影之居",
    },
    [86511] = {
        name = "深渊尽头",
    },
    [86512] = {
        name = "收割开始",
    },
    [86513] = {
        name = "直面战局",
    },
    [86514] = {
        name = "深渊女王",
    },
    [86515] = {
        name = "空洞的饥渴",
    },
    [86516] = {
        name = "全都成为猎物",
    },
    [86517] = {
        name = "消失于虚空",
    },
    [86518] = {
        name = "掠食披肩",
    },
    [86519] = {
        name = "深渊竞技场",
    },
    [86520] = {
        name = "追猎圣光",
    },
    [86521] = {
        name = "节点希纳斯：月蚀",
    },
    [86522] = {
        name = "破晓残光",
    },
    [86528] = {
        name = "开裂的全息钥匙",
    },
    [86530] = {
        name = "首先是弹壳",
    },
    [86531] = {
        name = "干扰工作",
    },
    [86536] = {
        name = "可靠的敌人",
    },
    [86537] = {
        name = "网络不安全",
    },
    [86538] = {
        name = "然后是燃料",
    },
    [86539] = {
        name = "一个纳鲁！",
    },
    [86540] = {
        name = "接着就是引爆",
    },
    [86541] = {
        name = "防患于未然……",
    },
    [86542] = {
        name = "黑暗中的闪光",
    },
    [86543] = {
        name = "魔导师平台：落叶归根",
    },
    [86544] = {
        name = "事后剖析",
    },
    [86545] = {
        name = "圣光之印",
    },
    [86549] = {
        name = "无惧黑暗",
    },
    [86557] = {
        name = "纷争与死亡",
    },
    [86558] = {
        name = "一片安心",
    },
    [86559] = {
        name = "远方的前线",
    },
    [86561] = {
        name = "陌生的异世界",
    },
    [86562] = {
        name = "与死亡共舞",
    },
    [86565] = {
        name = "恶有恶报",
    },
    [86621] = {
        name = "歧路魔导师",
    },
    [86622] = {
        name = "偶遇",
    },
    [86623] = {
        name = "呼唤虚空",
    },
    [86624] = {
        name = "合理解释",
    },
    [86626] = {
        name = "被袭击的实验室",
    },
    [86632] = {
        name = "塔奎林之战",
    },
    [86633] = {
        name = "理解虚空",
    },
    [86634] = {
        name = "过往仍在守望",
    },
    [86635] = {
        name = "前往戴索姆",
    },
    [86636] = {
        name = "虚空同行",
    },
    [86637] = {
        name = "片刻不容喘息",
    },
    [86638] = {
        name = "窒息触须",
    },
    [86639] = {
        name = "救援幸存者",
    },
    [86640] = {
        name = "预兆",
    },
    [86641] = {
        name = "远古伤痕",
    },
    [86642] = {
        name = "未现之敌",
    },
    [86643] = {
        name = "追踪根源",
    },
    [86644] = {
        name = "神灵在前",
    },
    [86646] = {
        name = "僵局",
    },
    [86647] = {
        name = "血脉之律",
    },
    [86648] = {
        name = "圣光指引",
    },
    [86649] = {
        name = "无可救赎",
    },
    [86650] = {
        name = "分崩离析",
    },
    [86652] = {
        name = "暗影遗民",
    },
    [86653] = {
        name = "阿曼尼之路",
    },
    [86654] = {
        name = "痛击纳拉丁",
    },
    [86655] = {
        name = "远古之路",
    },
    [86656] = {
        name = "野蛮盛宴",
    },
    [86657] = {
        name = "影盆岗哨",
    },
    [86658] = {
        name = "迷雾墓穴",
    },
    [86659] = {
        name = "穿越迷雾",
    },
    [86660] = {
        name = "暗影营救",
    },
    [86661] = {
        name = "神灵残焰",
    },
    [86663] = {
        name = "余烬重燃",
    },
    [86664] = {
        name = "火中显未来",
    },
    [86665] = {
        name = "赤焰面容",
    },
    [86666] = {
        name = "复生的阴影",
    },
    [86681] = {
        name = "纳洛拉克的洞穴：复仇的滋味",
    },
    [86682] = {
        name = "纳洛拉克的洞穴：唤醒战熊",
    },
    [86683] = {
        name = "哈谢之路",
    },
    [86684] = {
        name = "锋刃险途",
    },
    [86685] = {
        name = "碎剑折刃",
    },
    [86686] = {
        name = "圣光普照",
    },
    [86687] = {
        name = "导体危机",
    },
    [86692] = {
        name = "利刃粉碎",
    },
    [86693] = {
        name = "哈谢的传奇",
    },
    [86708] = {
        name = "祖阿曼之门",
    },
    [86710] = {
        name = "底线在此",
    },
    [86711] = {
        name = "阿曼尼的号召",
    },
    [86712] = {
        name = "阿曼尼永不屈服",
    },
    [86715] = {
        name = "仪式终结",
    },
    [86716] = {
        name = "光明武装",
    },
    [86717] = {
        name = "证明你的价值",
    },
    [86718] = {
        name = "暮光泣血",
    },
    [86719] = {
        name = "阿曼尼之魂",
    },
    [86720] = {
        name = "击碎利刃",
    },
    [86721] = {
        name = "心血所系",
    },
    [86722] = {
        name = "阿曼尼之心",
    },
    [86723] = {
        name = "孤立无援",
    },
    [86733] = {
        name = "银月城谈判",
    },
    [86734] = {
        name = "外交手腕",
    },
    [86735] = {
        name = "灰烬之路",
    },
    [86736] = {
        name = "灰烬之路",
    },
    [86737] = {
        name = "晴风光绽",
    },
    [86738] = {
        name = "锐齿之喉",
    },
    [86739] = {
        name = "晴风的谢礼",
    },
    [86740] = {
        name = "流离之兽",
    },
    [86741] = {
        name = "光绽涌动",
    },
    [86742] = {
        name = "奇异栽培",
    },
    [86743] = {
        name = "修剪光绽",
    },
    [86744] = {
        name = "探寻真相",
    },
    [86745] = {
        name = "银月必知",
    },
    [86769] = {
        name = "圣光最后的壁垒",
    },
    [86770] = {
        name = "奎尔丹纳斯的勇士",
    },
    [86780] = {
        name = "英雄屹立之地",
    },
    [86781] = {
        name = "直面过往",
    },
    [86805] = {
        name = "危急时刻",
    },
    [86806] = {
        name = "辉光之翼",
    },
    [86807] = {
        name = "城门集结",
    },
    [86808] = {
        name = "谜语神谕者",
    },
    [86809] = {
        name = "信念试炼",
    },
    [86811] = {
        name = "灭杀虚灵",
    },
    [86822] = {
        name = "最后的遗物",
    },
    [86823] = {
        name = "黑暗部落",
    },
    [86824] = {
        name = "偃旗息鼓",
    },
    [86825] = {
        name = "真仆侍伪业",
    },
    [86826] = {
        name = "战痕英雄纳格什",
    },
    [86827] = {
        name = "实至名归",
    },
    [86828] = {
        name = "不仅仅是巨魔杀手",
    },
    [86829] = {
        name = "里程碑时刻",
    },
    [86830] = {
        name = "黑暗部落的散兵游勇",
    },
    [86831] = {
        name = "无督之军",
    },
    [86832] = {
        name = "良匠配神兵",
    },
    [86833] = {
        name = "重铸壁垒",
    },
    [86834] = {
        name = "放逐虚脉",
    },
    [86836] = {
        name = "潜伏的猎手",
    },
    [86837] = {
        name = "太阳之井的会面",
    },
    [86838] = {
        name = "注入力量",
    },
    [86839] = {
        name = "圣光之愿的遗物",
    },
    [86840] = {
        name = "摇曳的希望",
    },
    [86841] = {
        name = "圣骑士的历史圣物",
    },
    [86842] = {
        name = "血色之力",
    },
    [86843] = {
        name = "被误用的圣光",
    },
    [86844] = {
        name = "圣光的正途",
    },
    [86845] = {
        name = "烈日行者之道",
    },
    [86846] = {
        name = "补充补给",
    },
    [86848] = {
        name = "圣光军械",
    },
    [86849] = {
        name = "释放愤怒",
    },
    [86850] = {
        name = "破碎残阳",
    },
    [86851] = {
        name = "艾林的根基",
    },
    [86852] = {
        name = "圣光的殊死一搏",
    },
    [86855] = {
        name = "职责的后果",
    },
    [86856] = {
        name = "压制呼唤",
    },
    [86857] = {
        name = "进入裂隙",
    },
    [86858] = {
        name = "根深蒂固的疯狂",
    },
    [86859] = {
        name = "磨菇就是解法",
    },
    [86860] = {
        name = "从小抓起",
    },
    [86861] = {
        name = "具象牧者",
    },
    [86862] = {
        name = "艾林的大义",
    },
    [86864] = {
        name = "看守大巢穴",
    },
    [86865] = {
        name = "搜寻问题",
    },
    [86866] = {
        name = "我们能治愈他们吗？",
    },
    [86867] = {
        name = "进入光绽",
    },
    [86868] = {
        name = "友好访问",
    },
    [86874] = {
        name = "净除光绽",
    },
    [86877] = {
        name = "正义修剪",
    },
    [86880] = {
        name = "钟爱之物，物归原主",
    },
    [86881] = {
        name = "根源之处",
    },
    [86882] = {
        name = "善用艾林之尘",
    },
    [86883] = {
        name = "狂暴进军",
    },
    [86884] = {
        name = "清除与焚烧",
    },
    [86885] = {
        name = "力挽狂澜",
    },
    [86887] = {
        name = "迅疾撤退",
    },
    [86890] = {
        name = "分享所见所闻",
    },
    [86891] = {
        name = "最终一搏",
    },
    [86892] = {
        name = "活下来",
    },
    [86894] = {
        name = "艾林哈籁的馈赠",
    },
    [86896] = {
        name = "圣光自会找到出路",
    },
    [86897] = {
        name = "熄灭狂热",
    },
    [86898] = {
        name = "哈籁尼尔的崛起",
    },
    [86899] = {
        name = "根本问题",
    },
    [86900] = {
        name = "前往哈拉希尔",
    },
    [86901] = {
        name = "裂隙与巢穴",
    },
    [86902] = {
        name = "重塑圣物",
    },
    [86903] = {
        name = "奥术秘社",
    },
    [86907] = {
        name = "回响之穴",
    },
    [86910] = {
        name = "库扎特的践踏",
    },
    [86911] = {
        name = "回响与记忆",
    },
    [86912] = {
        name = "深入林根之路",
    },
    [86913] = {
        name = "哈尔玛拉的陋居",
    },
    [86914] = {
        name = "呵护哈尔玛拉",
    },
    [86929] = {
        name = "议会集结",
    },
    [86930] = {
        name = "播下种子",
    },
    [86942] = {
        name = "遏制传染",
    },
    [86944] = {
        name = "裂隙之种",
    },
    [86956] = {
        name = "行商之花",
    },
    [86973] = {
        name = "保护哈尔玛拉",
    },
    [86997] = {
        name = "法术书页争夺战",
    },
    [86998] = {
        name = "逐步训练",
    },
    [87002] = {
        name = "象牙塔中的志向",
    },
    [87254] = {
        name = "诅咒净化法",
    },
    [87256] = {
        name = "备选药物",
    },
    [87267] = {
        name = "未满足的需求",
    },
    [87268] = {
        name = "必要的忏悔",
    },
    [87317] = {
        name = "死则死矣",
    },
    [87388] = {
        name = "一头更大的野兽",
    },
    [87391] = {
        name = "就地取材",
    },
    [87392] = {
        name = "货运阴谋",
    },
    [87393] = {
        name = "依法搜查",
    },
    [87394] = {
        name = "供应商监控",
    },
    [87395] = {
        name = "深海之下",
    },
    [87396] = {
        name = "死得其所",
    },
    [87397] = {
        name = "货运抵押",
    },
    [87398] = {
        name = "严惩走私者",
    },
    [87399] = {
        name = "面对太阳",
    },
    [87400] = {
        name = "散落于阳光中",
    },
    [87401] = {
        name = "园丁事故",
    },
    [87402] = {
        name = "圣光的恩泽",
    },
    [87455] = {
        name = "考验与清算",
    },
    [87456] = {
        name = "散落的纪念品",
    },
    [87457] = {
        name = "看家本事",
    },
    [87458] = {
        name = "还清债务",
    },
    [87672] = {
        name = "虚空弥漫",
    },
    [88653] = {
        name = "蛋液飞溅",
    },
    [88708] = {
        name = "暴力结论",
    },
    [88719] = {
        name = "圣光之音",
    },
    [88755] = {
        name = "学术追击",
    },
    [88768] = {
        name = "黑暗代理人",
    },
    [88977] = {
        name = "重现罪行",
    },
    [88978] = {
        name = "寻找踪迹",
    },
    [88979] = {
        name = "逮个正着",
    },
    [88985] = {
        name = "恢复收益",
    },
    [88986] = {
        name = "致盲恶徒",
    },
    [88987] = {
        name = "回收残件",
    },
    [88988] = {
        name = "工匠的学徒",
    },
    [88989] = {
        name = "败者食木屑",
    },
    [89012] = {
        name = "安全通路",
    },
    [89034] = {
        name = "辣手烧花",
    },
    [89035] = {
        name = "哈籁提名望",
    },
    [89193] = {
        name = "阿拉托尔",
    },
    [89199] = {
        name = "小差事",
    },
    [89200] = {
        name = "拆解结界",
    },
    [89201] = {
        name = "机关算尽",
    },
    [89202] = {
        name = "进入鼠窝",
    },
    [89203] = {
        name = "互惠互利",
    },
    [89204] = {
        name = "顺手牵羊",
    },
    [89205] = {
        name = "制作钥匙",
    },
    [89206] = {
        name = "破门而入",
    },
    [89207] = {
        name = "老鼠也会咬人",
    },
    [89208] = {
        name = "我们应得的",
    },
    [89230] = {
        name = "不通武艺的情人",
    },
    [89231] = {
        name = "不解风情的战士",
    },
    [89233] = {
        name = "三角恋",
    },
    [89249] = {
        name = "不堪重负",
    },
    [89271] = {
        name = "骨肉至亲",
    },
    [89334] = {
        name = "先下首为强",
    },
    [89338] = {
        name = "采集犁锄",
    },
    [89383] = {
        name = "勇于冒险的雏鸟",
    },
    [89384] = {
        name = "饥肠辘辘的鸟群",
    },
    [89385] = {
        name = "为人父母的第一步",
    },
    [89386] = {
        name = "巢居新生",
    },
    [89388] = {
        name = "虚影风暴",
    },
    [89402] = {
        name = "哈籁恩达尔",
    },
    [89503] = {
        name = "忧伤的手足",
    },
    [89506] = {
        name = "血脉相连",
    },
    [89513] = {
        name = "柴火充足",
    },
    [89559] = {
        name = "无因的崇拜",
    },
    [89560] = {
        name = "安静的道别",
    },
    [89565] = {
        name = "悼念之路",
    },
    [90094] = {
        name = "狩猎回响",
    },
    [90095] = {
        name = "召唤的回响",
    },
    [90467] = {
        name = "天穹传说",
    },
    [90468] = {
        name = "呃，烦人的杂务！",
    },
    [90469] = {
        name = "前进吧，任性的库利",
    },
    [90470] = {
        name = "搜寻天穹玻璃",
    },
    [90474] = {
        name = "艾林莎兰的传说",
    },
    [90481] = {
        name = "我有批准信",
    },
    [90482] = {
        name = "美食通天下",
    },
    [90483] = {
        name = "枯木故事",
    },
    [90484] = {
        name = "观光甲龙",
    },
    [90485] = {
        name = "事后遗珍",
    },
    [90486] = {
        name = "致命佳肴",
    },
    [90493] = {
        name = "塔奎林之心",
    },
    [90494] = {
        name = "失踪的魔导师",
    },
    [90509] = {
        name = "塔奎林的叛徒们",
    },
    [90533] = {
        name = "去找奥威娜！",
    },
    [90534] = {
        name = "哈籁尼尔的家园",
    },
    [90535] = {
        name = "留下你的印记",
    },
    [90537] = {
        name = "大器晚成",
    },
    [90540] = {
        name = "营救芦塔尼",
    },
    [90544] = {
        name = "狂吠之贼",
    },
    [90546] = {
        name = "失踪的圣骑士",
    },
    [90547] = {
        name = "失踪的圣骑士",
    },
    [90548] = {
        name = "暮光公函",
    },
    [90549] = {
        name = "争斗的痕迹",
    },
    [90550] = {
        name = "黄昏之日",
    },
    [90551] = {
        name = "俘获信息",
    },
    [90552] = {
        name = "审讯",
    },
    [90553] = {
        name = "执刃行动",
    },
    [90554] = {
        name = "在你身后留下灰烬",
    },
    [90555] = {
        name = "自由祝福",
    },
    [90556] = {
        name = "斩首行动",
    },
    [90568] = {
        name = "意想不到的朋友",
    },
    [90569] = {
        name = "重回口袋",
    },
    [90570] = {
        name = "前往戴索姆废墟",
    },
    [90571] = {
        name = "野兽视界",
    },
    [90601] = {
        name = "采集光亮蘑",
    },
    [90602] = {
        name = "螺菌",
    },
    [90615] = {
        name = "积怨难消",
    },
    [90616] = {
        name = "你很强？",
    },
    [90617] = {
        name = "几个开心果",
    },
    [90619] = {
        name = "历经试炼",
    },
    [90620] = {
        name = "前往竞技场",
    },
    [90621] = {
        name = "小小英雄的旅程",
    },
    [90622] = {
        name = "尚未落败的勇士",
    },
    [90669] = {
        name = "生意是生意",
    },
    [90749] = {
        name = "共同的敌人",
    },
    [90772] = {
        name = "烈焰升腾",
    },
    [90782] = {
        name = "虚空来客",
    },
    [90818] = {
        name = "密谋小径：隔墙有耳",
    },
    [90819] = {
        name = "密谋小径：本色出演",
    },
    [90821] = {
        name = "密谋小径：港口的秘密",
    },
    [90822] = {
        name = "密谋小径：一举歼灭",
    },
    [90824] = {
        name = "我哥哥还活着！",
    },
    [90826] = {
        name = "奥露阿的治愈之水",
    },
    [90827] = {
        name = "只取有毒的部分",
    },
    [90829] = {
        name = "与我的导师见面",
    },
    [90830] = {
        name = "其路自现",
    },
    [90831] = {
        name = "行动即成就",
    },
    [90832] = {
        name = "当她的声音终归沉寂",
    },
    [90833] = {
        name = "最终的仪式",
    },
    [90834] = {
        name = "从今往后",
    },
    [90835] = {
        name = "密谋小径：流言四起",
    },
    [90837] = {
        name = "密谋小径：邪能的踪迹",
    },
    [90838] = {
        name = "誓言与传承",
    },
    [90844] = {
        name = "清醒时分",
    },
    [90845] = {
        name = "遥远的回忆",
    },
    [90847] = {
        name = "真相来自力量",
    },
    [90848] = {
        name = "她点燃了火焰",
    },
    [90851] = {
        name = "自食其果",
    },
    [90852] = {
        name = "技术电磁脉冲",
    },
    [90858] = {
        name = "反抗镇压",
    },
    [90860] = {
        name = "摆脱枷锁",
    },
    [90866] = {
        name = "通用语言",
    },
    [90872] = {
        name = "沐浴其中",
    },
    [90873] = {
        name = "暴力之悦",
    },
    [90874] = {
        name = "暴力终结",
    },
    [90875] = {
        name = "诸界猎手",
    },
    [90907] = {
        name = "首位知情人",
    },
    [90910] = {
        name = "无尽黑暗",
    },
    [90914] = {
        name = "天生杀手",
    },
    [90915] = {
        name = "侵袭造物",
    },
    [90916] = {
        name = "寻求毁灭",
    },
    [90917] = {
        name = "野蛮的收割",
    },
    [90918] = {
        name = "不可宽恕者",
    },
    [90919] = {
        name = "失败的魔鬼",
    },
    [90920] = {
        name = "温暖灵魂",
    },
    [90922] = {
        name = "逝者的苏醒",
    },
    [90923] = {
        name = "恐惧牧者",
    },
    [90924] = {
        name = "邪恶终局",
    },
    [90963] = {
        name = "裂隙洞穴",
    },
    [91000] = {
        name = "无声助力",
    },
    [91001] = {
        name = "开辟通路",
    },
    [91062] = {
        name = "桥断情伤",
    },
    [91063] = {
        name = "盛放晶格",
    },
    [91065] = {
        name = "行窃的花瓣",
    },
    [91069] = {
        name = "托尔巴尼的血仇",
    },
    [91070] = {
        name = "夺回货物",
    },
    [91071] = {
        name = "阿塔阿巴希的威胁",
    },
    [91085] = {
        name = "花羽细毫",
    },
    [91086] = {
        name = "除蕾行动",
    },
    [91087] = {
        name = "报告送达",
    },
    [91088] = {
        name = "瀑布之后",
    },
    [91090] = {
        name = "烦人的虫子",
    },
    [91136] = {
        name = "石中记忆",
    },
    [91137] = {
        name = "迷失于光芒",
    },
    [91145] = {
        name = "被征服的英雄",
    },
    [91146] = {
        name = "摇曳之光",
    },
    [91147] = {
        name = "切断控制",
    },
    [91148] = {
        name = "提线傀儡",
    },
    [91149] = {
        name = "不要埋葬我",
    },
    [91206] = {
        name = "洛阿神灵的侵扰",
    },
    [91270] = {
        name = "最重要的事",
    },
    [91271] = {
        name = "一条鱼！",
    },
    [91274] = {
        name = "斩断虚空",
    },
    [91281] = {
        name = "至暗之夜",
    },
    [91284] = {
        name = "未定之路",
    },
    [91288] = {
        name = "狩猎试炼",
    },
    [91291] = {
        name = "血之试炼",
    },
    [91292] = {
        name = "奥术试炼",
    },
    [91301] = {
        name = "为人师表",
    },
    [91328] = {
        name = "秘密配方",
    },
    [91339] = {
        name = "窒息摇篮",
    },
    [91340] = {
        name = "以暴力之名",
    },
    [91341] = {
        name = "不可限量",
    },
    [91342] = {
        name = "一屋不扫",
    },
    [91343] = {
        name = "野心的奖赏",
    },
    [91345] = {
        name = "前往北点哨塔",
    },
    [91346] = {
        name = "女神的祈求者",
    },
    [91347] = {
        name = "奔踏的陆行鸟",
    },
    [91348] = {
        name = "来自浮龙的法力",
    },
    [91349] = {
        name = "森林的阴影",
    },
    [91350] = {
        name = "真正的嘱托",
    },
    [91359] = {
        name = "真菌鞭笞者清剿行动",
    },
    [91360] = {
        name = "清剿不速之草",
    },
    [91361] = {
        name = "重返岗位？",
    },
    [91363] = {
        name = "黑暗收割",
    },
    [91375] = {
        name = "芬加拉村的沉寂",
    },
    [91376] = {
        name = "小怪物们",
    },
    [91377] = {
        name = "死者衍生",
    },
    [91378] = {
        name = "你是传奇",
    },
    [91379] = {
        name = "腐朽之地",
    },
    [91380] = {
        name = "野兽之腹",
    },
    [91381] = {
        name = "蕈化危机",
    },
    [91382] = {
        name = "卓尔不群",
    },
    [91383] = {
        name = "大扫除",
    },
    [91384] = {
        name = "寻回任务",
    },
    [91385] = {
        name = "游侠的灵魂",
    },
    [91386] = {
        name = "裁缝不好当",
    },
    [91388] = {
        name = "不同寻常的丝线",
    },
    [91389] = {
        name = "人靠衣装",
    },
    [91391] = {
        name = "继续侦察",
    },
    [91403] = {
        name = "可能致瘫",
    },
    [91404] = {
        name = "致命剧毒",
    },
    [91405] = {
        name = "验证毒性",
    },
    [91406] = {
        name = "遥远的辛特兰",
    },
    [91407] = {
        name = "洛阿神灵之眼",
    },
    [91408] = {
        name = "寻找沙德拉",
    },
    [91409] = {
        name = "蛛群之梦",
    },
    [91410] = {
        name = "共尊神灵",
    },
    [91411] = {
        name = "迈萨拉洞窟：深入迈萨拉",
    },
    [91412] = {
        name = "毒蜘蛛女王归来",
    },
    [91450] = {
        name = "准备迎战",
    },
    [91452] = {
        name = "知识的疆界",
    },
    [91462] = {
        name = "前往中央塔楼",
    },
    [91463] = {
        name = "前往南部塔楼",
    },
    [91493] = {
        name = "货不对板",
    },
    [91494] = {
        name = "弃之敝屣，拾之珠玉",
    },
    [91495] = {
        name = "危难中的故人",
    },
    [91504] = {
        name = "奥能汇聚",
    },
    [91505] = {
        name = "如芒在背",
    },
    [91533] = {
        name = "难以割舍",
    },
    [91535] = {
        name = "甜蜜坟墓",
    },
    [91536] = {
        name = "野草般蔓延",
    },
    [91537] = {
        name = "面对自我",
    },
    [91541] = {
        name = "失控的情绪",
    },
    [91542] = {
        name = "心中的城镇",
    },
    [91543] = {
        name = "重掌控制权",
    },
    [91544] = {
        name = "熟悉的能量",
    },
    [91545] = {
        name = "比以前更强壮",
    },
    [91546] = {
        name = "有待改变",
    },
    [91550] = {
        name = "沉默与隐匿游戏",
    },
    [91551] = {
        name = "除巢大作战",
    },
    [91552] = {
        name = "冲冠一怒",
    },
    [91553] = {
        name = "哈籁尼尔永不言败！",
    },
    [91556] = {
        name = "神灵之焰",
    },
    [91557] = {
        name = "蜕躯之原的口信",
    },
    [91558] = {
        name = "疫病花瓣",
    },
    [91559] = {
        name = "剧毒害兽",
    },
    [91560] = {
        name = "清理探险者",
    },
    [91561] = {
        name = "源血病原体",
    },
    [91563] = {
        name = "哈尔拉兹的狩猎",
    },
    [91565] = {
        name = "虚空之痕竞技场：哀痛尖塔",
    },
    [91566] = {
        name = "虚空之痕竞技场：憎恨尖塔",
    },
    [91583] = {
        name = "虚空之痕竞技场：英勇堡垒",
    },
    [91585] = {
        name = "田园时蔬",
    },
    [91586] = {
        name = "土质替代方案",
    },
    [91587] = {
        name = "死亡盛宴",
    },
    [91588] = {
        name = "哈籁恩达尔的厨房",
    },
    [91589] = {
        name = "根须冲刺速递",
    },
    [91597] = {
        name = "虚空之痕竞技场：为了我的联盟",
    },
    [91598] = {
        name = "虚空之痕竞技场：蓄意暴行",
    },
    [91599] = {
        name = "虚空之痕竞技场：宿仇",
    },
    [91600] = {
        name = "虚空之痕竞技场：放在一边",
    },
    [91603] = {
        name = "虚空之痕竞技场：二打一",
    },
    [91605] = {
        name = "虚空之痕竞技场：站错队",
    },
    [91606] = {
        name = "虚空之痕竞技场：清理房间",
    },
    [91630] = {
        name = "失窃圣眼",
    },
    [91694] = {
        name = "虚空之痕竞技场：三人不成行",
    },
    [91726] = {
        name = "无坚不摧之力",
    },
    [91747] = {
        name = "伪造圣物",
    },
    [91748] = {
        name = "暮光过盛",
    },
    [91749] = {
        name = "背离正道",
    },
    [91750] = {
        name = "信任之祸",
    },
    [91787] = {
        name = "征程落幕",
    },
    [91813] = {
        name = "灵爪部族",
    },
    [91833] = {
        name = "污秽深渊",
    },
    [91835] = {
        name = "护送归乡",
    },
    [91836] = {
        name = "捍卫图腾",
    },
    [91838] = {
        name = "邪能溃散",
    },
    [91839] = {
        name = "终止献祭",
    },
    [91840] = {
        name = "永不复生",
    },
    [91842] = {
        name = "缴械黑暗部落",
    },
    [91854] = {
        name = "暗影渐深",
    },
    [91872] = {
        name = "前护根者",
    },
    [91873] = {
        name = "缓冲区域",
    },
    [91874] = {
        name = "烈焰骤燃",
    },
    [91875] = {
        name = "自然疗法",
    },
    [91876] = {
        name = "守护希望",
    },
    [91884] = {
        name = "移动之影",
    },
    [91885] = {
        name = "吸取殆尽",
    },
    [91886] = {
        name = "预兆之声",
    },
    [91887] = {
        name = "欺诳领域",
    },
    [91958] = {
        name = "纳洛拉克的洞穴：未获宽恕",
    },
    [91963] = {
        name = "肆意妄为",
    },
    [91967] = {
        name = "你认识这恶人？",
    },
    [92021] = {
        name = "墓生花园艺",
    },
    [92022] = {
        name = "剧毒职责",
    },
    [92023] = {
        name = "可疑的杂物",
    },
    [92024] = {
        name = "上门服务",
    },
    [92025] = {
        name = "阿曼茜雅的花",
    },
    [92061] = {
        name = "升腾的风暴",
    },
    [92084] = {
        name = "哈尔拉兹的诡计",
    },
    [92136] = {
        name = "希望的注入",
    },
    [92155] = {
        name = "物件驱邪",
    },
    [92156] = {
        name = "如影随形",
    },
    [92157] = {
        name = "仪式行为",
    },
    [92158] = {
        name = "请君入瓮",
    },
    [92159] = {
        name = "终极宿命",
    },
    [92163] = {
        name = "鱼人之神",
    },
    [92164] = {
        name = "鱼人狂潮",
    },
    [92165] = {
        name = "鱼是食物，并非伙伴",
    },
    [92166] = {
        name = "有样学样",
    },
    [92167] = {
        name = "一山不容二虎",
    },
    [92390] = {
        name = "研究的风险",
    },
    [92396] = {
        name = "骑兵的召唤",
    },
    [92397] = {
        name = "保卫晨星",
    },
    [92398] = {
        name = "敌袭来临",
    },
    [92408] = {
        name = "材料收益",
    },
    [92450] = {
        name = "成长的烦恼",
    },
    [92451] = {
        name = "我想我能行",
    },
    [92452] = {
        name = "计划生变",
    },
    [92453] = {
        name = "无所畏惧",
    },
    [92492] = {
        name = "纪念牺牲者",
    },
    [92493] = {
        name = "艾达戈的遗物",
    },
    [92495] = {
        name = "重创暮光之刃",
    },
    [92496] = {
        name = "以长矛刺破暗影",
    },
    [92497] = {
        name = "极简魔法",
    },
    [92499] = {
        name = "兼听则明",
    },
    [92505] = {
        name = "往昔真相",
    },
    [92506] = {
        name = "灵魂代价",
    },
    [92507] = {
        name = "强敌再现",
    },
    [92508] = {
        name = "牺牲印记",
    },
    [92509] = {
        name = "残酷器具",
    },
    [92510] = {
        name = "黑暗灌注",
    },
    [92511] = {
        name = "黑洞视界",
    },
    [92512] = {
        name = "吞噬者",
    },
    [92531] = {
        name = "医药之神的神殿",
    },
    [92603] = {
        name = "孤星",
    },
    [92604] = {
        name = "鲜血之语",
    },
    [92605] = {
        name = "赤诚之意",
    },
    [92606] = {
        name = "接纳你的赠礼",
    },
    [92607] = {
        name = "雕琢新形态",
    },
    [92616] = {
        name = "菌子的勇气",
    },
    [92617] = {
        name = "菌子的坚韧",
    },
    [92618] = {
        name = "菌子的自信",
    },
    [92641] = {
        name = "血染平原",
    },
    [92657] = {
        name = "山雨欲来",
    },
    [92658] = {
        name = "战术夺取",
    },
    [92659] = {
        name = "资源断供",
    },
    [92660] = {
        name = "虚无器具",
    },
    [92661] = {
        name = "针锋相对",
    },
    [92662] = {
        name = "核心坍缩",
    },
    [92694] = {
        name = "画染薄暝",
    },
    [92695] = {
        name = "风暴画笔",
    },
    [92696] = {
        name = "彩焕新初",
    },
    [92697] = {
        name = "明日色调",
    },
    [92728] = {
        name = "狗狗闹翻天",
    },
    [92729] = {
        name = "追狗大作战",
    },
    [92732] = {
        name = "圣光侵扰",
    },
    [92736] = {
        name = "圣光漫步",
    },
    [92737] = {
        name = "圣光屠戮",
    },
    [92738] = {
        name = "薯身蟾幼崽",
    },
    [92739] = {
        name = "开花能手",
    },
    [92864] = {
        name = "荡除漂流者",
    },
    [92865] = {
        name = "花蕾培育新生",
    },
    [92866] = {
        name = "多头花归巢",
    },
    [92868] = {
        name = "他往那边跑了",
    },
    [92869] = {
        name = "鱼池骚动",
    },
    [92870] = {
        name = "快追小蹿蹿",
    },
    [92882] = {
        name = "猎人的渴望",
    },
    [92883] = {
        name = "猎人的职责",
    },
    [92884] = {
        name = "猎人的武器",
    },
    [92885] = {
        name = "猎人的猎物",
    },
    [92939] = {
        name = "不只是石头！",
    },
    [92944] = {
        name = "虚空筛选",
    },
    [92946] = {
        name = "深埋黑暗",
    },
    [92948] = {
        name = "力不从心",
    },
    [93047] = {
        name = "屠宰入门",
    },
    [93048] = {
        name = "舞步混乱",
    },
    [93049] = {
        name = "作业援助",
    },
    [93050] = {
        name = "祭坛的历史",
    },
    [93051] = {
        name = "最终大考",
    },
    [93093] = {
        name = "纳拉丁战利品",
    },
    [93094] = {
        name = "拾来的胜利",
    },
    [93095] = {
        name = "苦痛狂怒",
    },
    [93096] = {
        name = "阿曼尼的荣耀",
    },
    [93178] = {
        name = "被打断的宁静漫步",
    },
    [93179] = {
        name = "赤子虔心",
    },
    [93180] = {
        name = "神殿整备",
    },
    [93181] = {
        name = "神庙与茶壶",
    },
    [93182] = {
        name = "疗愈归途",
    },
    [93257] = {
        name = "恶齿危机",
    },
    [93258] = {
        name = "蟹影迷踪",
    },
    [93259] = {
        name = "横扫蟹群",
    },
    [93260] = {
        name = "引蟹入笼",
    },
    [93261] = {
        name = "异变巨蟹",
    },
    [93396] = {
        name = "濒临崩溃",
    },
    [93432] = {
        name = "化干戈为玉帛",
    },
    [93433] = {
        name = "神龛已封，万事大吉",
    },
    [93435] = {
        name = "四大教唆者",
    },
    [93436] = {
        name = "诅咒无辜，扰乱罪人",
    },
    [93437] = {
        name = "以彼之血",
    },
    [93440] = {
        name = "私人历史",
    },
    [93566] = {
        name = "阿曼尼部族名望",
    },
    [93651] = {
        name = "夺目谷：光绽根须",
    },
    [93667] = {
        name = "石洗营地",
    },
    [93734] = {
        name = "珍贵的饰品",
    },
    [93801] = {
        name = "小心遏制",
    },
    [93811] = {
        name = "银月宫廷名望",
    },
    [94370] = {
        name = "悄然逼近",
    },
    [94371] = {
        name = "游侠的美梦",
    },
    [94388] = {
        name = "再犯便是自选",
    },
    [94393] = {
        name = "职业指导",
    },
    [94396] = {
        name = "挫其锋芒",
    },
    [94677] = {
        name = "失踪的护根者",
    },
    [94844] = {
        name = "虚空之痕竞技场：为我部落",
    },
    [94845] = {
        name = "虚空之痕竞技场：力量堡垒",
    },
    [94848] = {
        name = "虚空之痕竞技场：蓄意暴行",
    },
    [94849] = {
        name = "虚空之痕竞技场：宿仇",
    },
    [94855] = {
        name = "虚空之痕竞技场：放在一边",
    },
    [94867] = {
        name = "迷失阿塔阿巴希",
    },
    [94871] = {
        name = "永歌森林",
    },
    [94993] = {
        name = "至暗之夜冒险",
    },
    [95008] = {
        name = "至暗之夜冒险",
    },
    [95276] = {
        name = "决胜一击",
    },
})
]])()
