----- AUTO GENERATED - DO NOT EDIT

if GetLocale() ~= "zhCN" then
    return
end

loadstring([[
BtWQuestsDatabase:UpdateNPCsTable({
    [20448] = {
        name = "指挥官阿米尔",
    },
    [20482] = {
        name = "指挥官阿米尔的影像",
    },
    [20907] = {
        name = "达比雷教授",
    },
    [27314] = {
        name = "幻象师瑟里格",
    },
    [130133] = {
        name = "女伯爵莉亚德琳",
    },
    [145005] = {
        name = "精英远行者",
    },
    [145015] = {
        name = "洛瑟玛·塞隆",
    },
    [145793] = {
        name = "女伯爵莉亚德琳",
    },
    [156688] = {
        name = "东道主塔·雷拉",
    },
    [162804] = {
        name = "威·娜莉",
    },
    [206528] = {
        name = "阿丽亚·希尔海姆",
    },
    [207471] = {
        name = "寡妇阿拉克奈",
    },
    [208782] = {
        name = "执行官尼兹雷克",
    },
    [209918] = {
        name = "农场主斯滕斯波",
    },
    [211351] = {
        name = "安度因·乌瑞恩",
    },
    [211399] = {
        name = "蒙特·加兹鲁维",
    },
    [211409] = {
        name = "菲琳·洛萨",
    },
    [211444] = {
        name = "弗林·法温德",
    },
    [211499] = {
        name = "执行官尼兹雷克",
    },
    [211652] = {
        name = "绿语者纳莱洛",
    },
    [211699] = {
        name = "菲琳",
    },
    [211721] = {
        name = "乔纳杉·图哈特爵士",
    },
    [211740] = {
        name = "雷鸫看护者鲁弗瑟拉",
    },
    [211752] = {
        name = "奥蕾莉亚·风行者",
    },
    [211859] = {
        name = "贝尔格里姆",
    },
    [211993] = {
        name = "萨尔",
    },
    [211994] = {
        name = "吉安娜·普罗德摩尔",
    },
    [212076] = {
        name = "斯蒂泰克将军",
    },
    [212269] = {
        name = "斯基特",
    },
    [212295] = {
        name = "文布兰德",
    },
    [212450] = {
        name = "安度因·乌瑞恩",
    },
    [212519] = {
        name = "代言人布琳泽",
    },
    [212592] = {
        name = "代言人布琳泽",
    },
    [212695] = {
        name = "机械师吉特林",
    },
    [212700] = {
        name = "荒原看护者伊格里斯",
    },
    [212708] = {
        name = "芙誓者克鲁顿",
    },
    [212741] = {
        name = "代言人布琳泽",
    },
    [212742] = {
        name = "茉艾拉·索瑞森",
    },
    [212747] = {
        name = "贝尔格里姆",
    },
    [212749] = {
        name = "贝尔格里姆",
    },
    [212750] = {
        name = "文布兰德",
    },
    [212756] = {
        name = "贝尔格里姆",
    },
    [212829] = {
        name = "吉安娜·普罗德摩尔",
    },
    [212991] = {
        name = "斯基特",
    },
    [212992] = {
        name = "代言人布琳泽",
    },
    [213107] = {
        name = "菲琳·洛萨",
    },
    [213108] = {
        name = "斯蒂泰克将军",
    },
    [213116] = {
        name = "菲琳·洛萨",
    },
    [213120] = {
        name = "安度因·乌瑞恩",
    },
    [213145] = {
        name = "奥拉莉亚·斯蒂泰克",
    },
    [213152] = {
        name = "斯基特",
    },
    [213184] = {
        name = "寇尔甘",
    },
    [213187] = {
        name = "乌尔塔戈",
    },
    [213569] = {
        name = "代言人布琳泽",
    },
    [213612] = {
        name = "麦格尼·铜须",
    },
    [213613] = {
        name = "艾米拉·阿克顿",
    },
    [213614] = {
        name = "泰纳尔·斯托戈兹",
    },
    [213620] = {
        name = "萨尔",
    },
    [213624] = {
        name = "麦格尼·铜须",
    },
    [213625] = {
        name = "吉安娜·普罗德摩尔",
    },
    [213627] = {
        name = "大法师卡德加",
    },
    [213634] = {
        name = "达格兰·索瑞森二世",
    },
    [213687] = {
        name = "乌尔塔戈",
    },
    [213688] = {
        name = "乌尔塔戈",
    },
    [213691] = {
        name = "哈尔摩特",
    },
    [213763] = {
        name = "茉艾拉·索瑞森",
    },
    [213787] = {
        name = "威尔汉公爵",
    },
    [213796] = {
        name = "茉艾拉·索瑞森",
    },
    [213840] = {
        name = "旅店老板布拉克斯",
    },
    [213869] = {
        name = "看护者托基",
    },
    [213983] = {
        name = "安度因·乌瑞恩",
    },
    [214019] = {
        name = "艾戈尔·艾林邦德",
    },
    [214076] = {
        name = "斯凯吉特·烬轰",
    },
    [214168] = {
        name = "斯凯吉特·烬轰",
    },
    [214271] = {
        name = "斯蒂泰克将军",
    },
    [214273] = {
        name = "安度因·乌瑞恩",
    },
    [214276] = {
        name = "吉安娜·普罗德摩尔",
    },
    [214296] = {
        name = "舞台监督修博塔",
    },
    [214356] = {
        name = "维克斯阿隆",
    },
    [214359] = {
        name = "基什纳尔",
    },
    [214376] = {
        name = "斯蒂泰克将军",
    },
    [214378] = {
        name = "菲琳",
    },
    [214380] = {
        name = "拉恩·道卡瓦利",
    },
    [214402] = {
        name = "奥蕾莉亚·风行者",
    },
    [214404] = {
        name = "菲琳·洛萨",
    },
    [214405] = {
        name = "奥蕾莉亚·风行者",
    },
    [214413] = {
        name = "菲琳·洛萨",
    },
    [214444] = {
        name = "阿加尔萨",
    },
    [214651] = {
        name = "茉艾拉·索瑞森",
    },
    [214663] = {
        name = "高阶代言人布琳泽",
    },
    [214665] = {
        name = "大法师德伦登",
    },
    [214669] = {
        name = "布莱恩·铜须",
    },
    [214890] = {
        name = "载钢保镖",
    },
    [214892] = {
        name = "达格兰·索瑞森二世",
    },
    [214908] = {
        name = "奥蕾莉亚·风行者",
    },
    [214916] = {
        name = "麦里克斯",
    },
    [214917] = {
        name = "茉艾拉·索瑞森",
    },
    [214919] = {
        name = "萨尔",
    },
    [214921] = {
        name = "哈尔摩特",
    },
    [214922] = {
        name = "收割者法尔妮",
    },
    [214995] = {
        name = "欧尔巴里格",
    },
    [215037] = {
        name = "威提维利安",
    },
    [215039] = {
        name = "雷鸫看护者鲁弗瑟拉",
    },
    [215041] = {
        name = "泽地谋杀之爪",
    },
    [215113] = {
        name = "奥威娜",
    },
    [215187] = {
        name = "盖亚拉大王",
    },
    [215201] = {
        name = "阿加尔萨",
    },
    [215208] = {
        name = "欧森兹",
    },
    [215209] = {
        name = "蒙戴鲁特",
    },
    [215211] = {
        name = "库德兰·蛮锤",
    },
    [215234] = {
        name = "菲达戈尔",
    },
    [215237] = {
        name = "阿丽扎·博布雷兹",
    },
    [215254] = {
        name = "阿丽扎·博布雷兹",
    },
    [215277] = {
        name = "艾德贡",
    },
    [215301] = {
        name = "欣达·科里派克",
    },
    [215306] = {
        name = "恩迪里·道恩瑟基",
    },
    [215327] = {
        name = "阿加尔萨",
    },
    [215331] = {
        name = "菲琳·洛萨",
    },
    [215335] = {
        name = "斯蒂泰克将军",
    },
    [215341] = {
        name = "崇高者凯隆",
    },
    [215349] = {
        name = "大妖术师奥霍多",
    },
    [215413] = {
        name = "蒙特·加兹鲁维",
    },
    [215527] = {
        name = "凯拉·弗雷斯通",
    },
    [215625] = {
        name = "莉莉安·沃斯",
    },
    [215626] = {
        name = "莉莉安·沃斯",
    },
    [215628] = {
        name = "莉莉安·沃斯",
    },
    [215637] = {
        name = "伊泰基",
    },
    [215659] = {
        name = "伊泰基",
    },
    [215661] = {
        name = "莉莉安·沃斯",
    },
    [215662] = {
        name = "莉莉安·沃斯",
    },
    [215672] = {
        name = "斯基特",
    },
    [215724] = {
        name = "奈雷亚",
    },
    [215737] = {
        name = "奈布",
    },
    [215744] = {
        name = "波克霍特",
    },
    [215745] = {
        name = "拉巴恩",
    },
    [215748] = {
        name = "文戴琳",
    },
    [215781] = {
        name = "茉艾拉·索瑞森",
    },
    [215788] = {
        name = "流光者贝伦德",
    },
    [215821] = {
        name = "茉艾拉·索瑞森",
    },
    [215822] = {
        name = "流光者贝伦德",
    },
    [215824] = {
        name = "茉艾拉·索瑞森",
    },
    [215836] = {
        name = "流光者贝伦德",
    },
    [215845] = {
        name = "蒙特·加兹鲁维",
    },
    [215944] = {
        name = "奥威娜",
    },
    [216001] = {
        name = "索菲塔·林弗莱姆",
    },
    [216025] = {
        name = "暴怒的元素",
    },
    [216046] = {
        name = "特卡克塔兹",
    },
    [216061] = {
        name = "图弗雷姆队长",
    },
    [216063] = {
        name = "斥候威歇尔姆",
    },
    [216085] = {
        name = "茉艾拉·索瑞森",
    },
    [216094] = {
        name = "考顿",
    },
    [216149] = {
        name = "茉艾拉·索瑞森",
    },
    [216167] = {
        name = "萨尔",
    },
    [216168] = {
        name = "吉安娜·普罗德摩尔",
    },
    [216169] = {
        name = "寇尔甘",
    },
    [216173] = {
        name = "乌尔塔戈",
    },
    [216213] = {
        name = "轴虫",
    },
    [216311] = {
        name = "克莱夫·德基兹莫",
    },
    [216438] = {
        name = "西波姥姥",
    },
    [216479] = {
        name = "麦格尼·铜须",
    },
    [216480] = {
        name = "达格兰·索瑞森二世",
    },
    [216566] = {
        name = "绿油骑士",
    },
    [216567] = {
        name = "加恩基",
    },
    [216568] = {
        name = "“土头”格莱姆斯",
    },
    [216628] = {
        name = "贝尔格里姆",
    },
    [216878] = {
        name = "乌尔塔戈",
    },
    [216994] = {
        name = "杰妮·轰扣",
    },
    [216996] = {
        name = "鲁巴恩",
    },
    [217029] = {
        name = "蒙特·加兹鲁维",
    },
    [217069] = {
        name = "麦里克斯",
    },
    [217072] = {
        name = "贝弗露西",
    },
    [217091] = {
        name = "沃克格雷",
    },
    [217095] = {
        name = "麦里克斯",
    },
    [217097] = {
        name = "麦里克斯",
    },
    [217128] = {
        name = "代言人库尔达斯",
    },
    [217131] = {
        name = "“土头”格莱姆斯",
    },
    [217133] = {
        name = "卡尔·斯莫德博",
    },
    [217152] = {
        name = "斥颌",
    },
    [217245] = {
        name = "高阶代言人布琳泽",
    },
    [217248] = {
        name = "艾尔玛",
    },
    [217255] = {
        name = "阿格萨克斯",
    },
    [217330] = {
        name = "阿努巴扎尔",
    },
    [217331] = {
        name = "达格兰·索瑞森二世",
    },
    [217355] = {
        name = "克拉斯金",
    },
    [217356] = {
        name = "阿拉克丝妮",
    },
    [217385] = {
        name = "奥蕾莉亚·风行者",
    },
    [217386] = {
        name = "安度因·乌瑞恩",
    },
    [217398] = {
        name = "艾特娜·布雷兹修女",
    },
    [217402] = {
        name = "格里格",
    },
    [217424] = {
        name = "西贝斯坦·布朗派克男爵",
    },
    [217426] = {
        name = "瑟勒昂·布朗派克爵士",
    },
    [217474] = {
        name = "凯尔达兹",
    },
    [217565] = {
        name = "阿库比安",
    },
    [217598] = {
        name = "茉艾拉·索瑞森",
    },
    [217609] = {
        name = "巴拉尔·林弗莱姆",
    },
    [217640] = {
        name = "阿尔伯特",
    },
    [217656] = {
        name = "图贝罗斯",
    },
    [217659] = {
        name = "萨雷莎·日缕",
    },
    [217692] = {
        name = "阿尔辛",
    },
    [217724] = {
        name = "稚年噬螈",
    },
    [217763] = {
        name = "拉南·科伦",
    },
    [217766] = {
        name = "贝尔格里姆",
    },
    [217828] = {
        name = "拉南·科伦",
    },
    [217849] = {
        name = "艾德贡",
    },
    [217852] = {
        name = "贝尔格里姆",
    },
    [217854] = {
        name = "麦里克斯",
    },
    [217857] = {
        name = "代言人布琳泽",
    },
    [217861] = {
        name = "麦里克斯",
    },
    [217864] = {
        name = "茉艾拉·索瑞森",
    },
    [217878] = {
        name = "茉艾拉·索瑞森",
    },
    [217879] = {
        name = "艾德贡",
    },
    [217880] = {
        name = "麦里克斯",
    },
    [217881] = {
        name = "贝尔格里姆",
    },
    [217887] = {
        name = "茉艾拉·索瑞森",
    },
    [217898] = {
        name = "茉艾拉·索瑞森",
    },
    [217904] = {
        name = "麦里克斯",
    },
    [217961] = {
        name = "赫雷卡",
    },
    [217994] = {
        name = "阿尔伯特",
    },
    [218062] = {
        name = "阿丽扎·博布雷兹",
    },
    [218171] = {
        name = "夏尔巴",
    },
    [218182] = {
        name = "奥蕾莉亚·风行者",
    },
    [218267] = {
        name = "菲琳·洛萨",
    },
    [218290] = {
        name = "工头乌兹贾克斯",
    },
    [218333] = {
        name = "荒原看护者伊格里斯",
    },
    [218508] = {
        name = "约瑟夫·布雷弗玛",
    },
    [218535] = {
        name = "杰尔米拉",
    },
    [218541] = {
        name = "安度因·乌瑞恩",
    },
    [218714] = {
        name = "茉艾拉·索瑞森",
    },
    [218715] = {
        name = "代言人布琳泽",
    },
    [218837] = {
        name = "亚弗",
    },
    [218864] = {
        name = "鸥首",
    },
    [218866] = {
        name = "沃克梅",
    },
    [218878] = {
        name = "玛莱恩",
    },
    [219135] = {
        name = "文伦·阿萨尔",
    },
    [219173] = {
        name = "文伦·阿萨尔",
    },
    [219252] = {
        name = "奥蕾莉亚·风行者",
    },
    [219357] = {
        name = "演说者特克西特克",
    },
    [219393] = {
        name = "阿尔德拉",
    },
    [219394] = {
        name = "维和者克拉加德",
    },
    [219400] = {
        name = "麦里克斯",
    },
    [219430] = {
        name = "奇特之鱼",
    },
    [219437] = {
        name = "多恩诺嘉尔市民",
    },
    [219452] = {
        name = "麦格尼·铜须",
    },
    [219475] = {
        name = "钢脉",
    },
    [219674] = {
        name = "加恩基",
    },
    [219784] = {
        name = "巴兹瓦拉",
    },
    [219885] = {
        name = "安度因·乌瑞恩",
    },
    [219899] = {
        name = "巴兹瓦拉",
    },
    [220051] = {
        name = "弗林·法温德",
    },
    [220124] = {
        name = "菲琳·洛萨",
    },
    [220220] = {
        name = "流光者贝伦德",
    },
    [220406] = {
        name = "菲琳·洛萨",
    },
    [220415] = {
        name = "赫兰达兹",
    },
    [220417] = {
        name = "卡格弗里扎",
    },
    [220446] = {
        name = "斯考萨兹",
    },
    [220595] = {
        name = "奥威娜",
    },
    [220597] = {
        name = "布雷诺克",
    },
    [220600] = {
        name = "海马兹",
    },
    [220603] = {
        name = "奥威娜",
    },
    [220608] = {
        name = "哈南",
    },
    [220610] = {
        name = "奥威娜",
    },
    [220688] = {
        name = "奥蕾莉亚·风行者",
    },
    [220690] = {
        name = "克拉斯金",
    },
    [220718] = {
        name = "麦拉·阿希尔德",
    },
    [220784] = {
        name = "巴兹瓦拉",
    },
    [220928] = {
        name = "高阶代言人布琳泽",
    },
    [221043] = {
        name = "诺里·玛尔伦",
    },
    [221092] = {
        name = "演说者特克西特克",
    },
    [221093] = {
        name = "演说者特克西特克",
    },
    [221100] = {
        name = "菲琳",
    },
    [221355] = {
        name = "乌尔塔戈",
    },
    [221390] = {
        name = "蜡贩斯奎克",
    },
    [221492] = {
        name = "隐修院骑士",
    },
    [221550] = {
        name = "朗克哈特",
    },
    [221557] = {
        name = "大正纺师安图里克斯",
    },
    [221733] = {
        name = "菲琳·洛萨",
    },
    [221842] = {
        name = "炼金师塔尔巴克斯",
    },
    [221948] = {
        name = "苏姆拉萨",
    },
    [221961] = {
        name = "菲琳·洛萨",
    },
    [221977] = {
        name = "蒙特·加兹鲁维",
    },
    [221980] = {
        name = "阿拉希复仇者",
    },
    [222132] = {
        name = "忒兹",
    },
    [222136] = {
        name = "忒兹",
    },
    [222224] = {
        name = "维和者雷弗",
    },
    [222234] = {
        name = "斯克里特",
    },
    [222239] = {
        name = "斯克里特",
    },
    [222268] = {
        name = "维和者雷弗",
    },
    [222314] = {
        name = "维和者雷弗",
    },
    [222352] = {
        name = "燃灯者凯尔特",
    },
    [222356] = {
        name = "燃灯者凯尔特",
    },
    [222358] = {
        name = "维和者雷弗",
    },
    [222360] = {
        name = "燃灯者凯尔特",
    },
    [222362] = {
        name = "维和者雷弗",
    },
    [222363] = {
        name = "维和者雷弗",
    },
    [222364] = {
        name = "燃灯者凯尔特",
    },
    [222555] = {
        name = "贝尔格里姆",
    },
    [222683] = {
        name = "海尔穆特·艾吉萨克斯",
    },
    [222790] = {
        name = "加特乌苏",
    },
    [222803] = {
        name = "斯基特",
    },
    [223000] = {
        name = "凯尔达兹",
    },
    [223166] = {
        name = "大法师艾萨斯·夺日者",
    },
    [223184] = {
        name = "加尔弗·轮哨",
    },
    [223205] = {
        name = "大主教图拉扬",
    },
    [223267] = {
        name = "奥拉莉亚·斯蒂泰克",
    },
    [223268] = {
        name = "斯蒂泰克将军",
    },
    [223285] = {
        name = "奥威娜",
    },
    [223286] = {
        name = "哈南",
    },
    [223467] = {
        name = "菲琳·洛萨",
    },
    [223637] = {
        name = "纳塔莉亚·皮尔斯",
    },
    [223723] = {
        name = "向日葵先生",
    },
    [223754] = {
        name = "利妮·铅指",
    },
    [223759] = {
        name = "辛鲁娜",
    },
    [223760] = {
        name = "乌科斯威亚",
    },
    [223875] = {
        name = "菲琳·洛萨",
    },
    [223920] = {
        name = "欧伦·麦辛",
    },
    [223924] = {
        name = "纳塔莉亚·皮尔斯",
    },
    [223944] = {
        name = "奥蕾莉亚·风行者",
    },
    [224154] = {
        name = "斯蒂泰克将军",
    },
    [224310] = {
        name = "崇高者凯隆",
    },
    [224345] = {
        name = "阿努巴扎尔",
    },
    [224362] = {
        name = "巴兹瓦拉",
    },
    [224378] = {
        name = "欧伦·麦辛",
    },
    [224379] = {
        name = "欧伦·麦辛",
    },
    [224392] = {
        name = "欧尔巴里格",
    },
    [224394] = {
        name = "哈尔摩特",
    },
    [224395] = {
        name = "奥威娜",
    },
    [224397] = {
        name = "哈南",
    },
    [224602] = {
        name = "达纳格",
    },
    [224618] = {
        name = "达纳格的齿轮行者",
    },
    [224707] = {
        name = "阿尔威加",
    },
    [224708] = {
        name = "森德拉格",
    },
    [224729] = {
        name = "阿努波基",
    },
    [224740] = {
        name = "奥威娜",
    },
    [224741] = {
        name = "多雷娜",
    },
    [224857] = {
        name = "蒙特·加兹鲁维",
    },
    [224866] = {
        name = "奥威娜",
    },
    [224874] = {
        name = "蒙特·加兹鲁维",
    },
    [224913] = {
        name = "“剃刀”雷吉克",
    },
    [224930] = {
        name = "乌尔塔戈",
    },
    [224945] = {
        name = "菲琳·洛萨",
    },
    [224946] = {
        name = "崇高者凯隆",
    },
    [224966] = {
        name = "敏迪·麦克斯洛夫",
    },
    [225188] = {
        name = "斯蒂泰克将军",
    },
    [225426] = {
        name = "萨拉蒂",
    },
    [225451] = {
        name = "达格兰·索瑞森二世",
    },
    [225453] = {
        name = "达格兰·索瑞森二世",
    },
    [225454] = {
        name = "维和者海克泰",
    },
    [225472] = {
        name = "达格兰·索瑞森二世",
    },
    [225478] = {
        name = "代言人布琳泽",
    },
    [225481] = {
        name = "软泥潜兵卡赞德拉",
    },
    [225500] = {
        name = "格琳拉·菲兹克兰克",
    },
    [225523] = {
        name = "蒙特·加兹鲁维",
    },
    [225533] = {
        name = "瑟尔坎",
    },
    [225555] = {
        name = "尼克纳克",
    },
    [225570] = {
        name = "蒙特·加兹鲁维",
    },
    [225571] = {
        name = "“剃刀”雷吉克",
    },
    [225582] = {
        name = "工头杜因兹",
    },
    [225583] = {
        name = "机械师基尔顿",
    },
    [225587] = {
        name = "蒙特·加兹鲁维",
    },
    [225591] = {
        name = "帕姆希",
    },
    [225596] = {
        name = "奥威娜",
    },
    [225597] = {
        name = "蒙特·加兹鲁维",
    },
    [225598] = {
        name = "蒙特·加兹鲁维",
    },
    [225599] = {
        name = "“剃刀”雷吉克",
    },
    [225608] = {
        name = "普罗斯派拉·轮鸣",
    },
    [225616] = {
        name = "考格文",
    },
    [225618] = {
        name = "帕姆希",
    },
    [225624] = {
        name = "马林·诺格弗格",
    },
    [225625] = {
        name = "蒙特·加兹鲁维",
    },
    [225635] = {
        name = "蒙特·加兹鲁维",
    },
    [225637] = {
        name = "格琳拉·菲兹克兰克",
    },
    [225638] = {
        name = "格琳拉·菲兹克兰克",
    },
    [225639] = {
        name = "蒙特·加兹鲁维",
    },
    [225645] = {
        name = "蒙特·加兹鲁维",
    },
    [225648] = {
        name = "蒙特·加兹鲁维",
    },
    [225659] = {
        name = "奥威娜",
    },
    [225669] = {
        name = "奥蕾莉亚·风行者",
    },
    [225686] = {
        name = "大财主里维加兹",
    },
    [225711] = {
        name = "斯蒂泰克将军",
    },
    [225719] = {
        name = "蒙特·加兹鲁维",
    },
    [225730] = {
        name = "蒙特·加兹鲁维",
    },
    [225756] = {
        name = "蒙特·加兹鲁维",
    },
    [225757] = {
        name = "蒙特·加兹鲁维",
    },
    [225772] = {
        name = "帕姆希",
    },
    [225847] = {
        name = "风险主管",
    },
    [225857] = {
        name = "勒蕾奈·费恩",
    },
    [225867] = {
        name = "马林·诺格弗格",
    },
    [225868] = {
        name = "大财主里维加兹",
    },
    [225870] = {
        name = "舰队指挥官海角",
    },
    [225871] = {
        name = "格琳拉·菲兹克兰克",
    },
    [225873] = {
        name = "奥威娜",
    },
    [225876] = {
        name = "格琳拉·菲兹克兰克",
    },
    [225878] = {
        name = "蒙特·加兹鲁维",
    },
    [225879] = {
        name = "德利尔·费恩",
    },
    [225925] = {
        name = "索菲塔·林弗莱姆",
    },
    [225926] = {
        name = "索菲塔·林弗莱姆",
    },
    [226019] = {
        name = "轴虫",
    },
    [226040] = {
        name = "高阶代言人布琳泽",
    },
    [226255] = {
        name = "香葱",
    },
    [226273] = {
        name = "蒙特·加兹鲁维",
    },
    [226277] = {
        name = "玛提·飙车",
    },
    [226336] = {
        name = "普罗斯派拉·轮鸣",
    },
    [226518] = {
        name = "克拉兹·托克伦齐老爹",
    },
    [226522] = {
        name = "妮妮·托克伦齐",
    },
    [226569] = {
        name = "斯纳普·纸油",
    },
    [226660] = {
        name = "德克·油贩",
    },
    [226672] = {
        name = "奥威娜",
    },
    [226703] = {
        name = "斯纳普·纸油",
    },
    [226710] = {
        name = "暗巷鼠",
    },
    [226728] = {
        name = "汉弗莱·轻吮",
    },
    [226750] = {
        name = "芙誓者艾泰尔卡",
    },
    [226791] = {
        name = "紫罗兰典狱官",
    },
    [226792] = {
        name = "农场工人艾迪迪塞特",
    },
    [226841] = {
        name = "代言人布琳泽",
    },
    [226846] = {
        name = "欧兹米特船长",
    },
    [226894] = {
        name = "玛提·飙车",
    },
    [226899] = {
        name = "司法官珠嬬",
    },
    [226932] = {
        name = "玛提·飙车",
    },
    [226934] = {
        name = "乔乔·戈布雷",
    },
    [227018] = {
        name = "玛提·飙车",
    },
    [227032] = {
        name = "玛提·飙车",
    },
    [227158] = {
        name = "哈南",
    },
    [227217] = {
        name = "韦伯斯特",
    },
    [227222] = {
        name = "艾莎贝尔·葛林嘉德",
    },
    [227224] = {
        name = "古伊希",
    },
    [227436] = {
        name = "大法师卡德加",
    },
    [227477] = {
        name = "布莱恩·铜须",
    },
    [227499] = {
        name = "奥威娜",
    },
    [227523] = {
        name = "布莱恩·铜须",
    },
    [227531] = {
        name = "蒙特·加兹鲁维",
    },
    [227544] = {
        name = "布莱恩·铜须",
    },
    [227691] = {
        name = "奥威娜",
    },
    [227758] = {
        name = "奥蕾莉亚·风行者",
    },
    [227937] = {
        name = "“剃刀”雷吉克",
    },
    [228017] = {
        name = "吉尔多",
    },
    [228074] = {
        name = "安格尔菈",
    },
    [228132] = {
        name = "“剃刀”雷吉克",
    },
    [228158] = {
        name = "裂条",
    },
    [228214] = {
        name = "帕姆希",
    },
    [228286] = {
        name = "斯凯吉特·烬轰",
    },
    [228333] = {
        name = "斯凯吉特·烬轰",
    },
    [228341] = {
        name = "斯凯吉特·烬轰",
    },
    [228369] = {
        name = "玛提·飙车",
    },
    [228393] = {
        name = "布鲁西·黠钩",
    },
    [228420] = {
        name = "塔波纳拉·菲兹克兰克",
    },
    [228473] = {
        name = "奇妙的戴维",
    },
    [228474] = {
        name = "凯伊杰",
    },
    [228566] = {
        name = "加兹·莫奇兹",
    },
    [228857] = {
        name = "姬菈妈妈",
    },
    [228860] = {
        name = "“加贝”加比",
    },
    [228894] = {
        name = "奥威娜",
    },
    [229223] = {
        name = "蒙特·加兹鲁维",
    },
    [229233] = {
        name = "蒙特·加兹鲁维",
    },
    [229235] = {
        name = "蒙特·加兹鲁维",
    },
    [229236] = {
        name = "蒙特·加兹鲁维",
    },
    [229242] = {
        name = "“剃刀”雷吉克",
    },
    [229243] = {
        name = "“剃刀”雷吉克",
    },
    [229246] = {
        name = "格琳拉·菲兹克兰克",
    },
    [229261] = {
        name = "蒙特·加兹鲁维",
    },
    [229940] = {
        name = "维罗妮卡·尼艾丝上校",
    },
    [230145] = {
        name = "伊崔格",
    },
    [230151] = {
        name = "盖亚拉大王",
    },
    [230154] = {
        name = "达纳斯·托尔贝恩",
    },
    [230159] = {
        name = "欧·芬纳德",
    },
    [230174] = {
        name = "沃克·格雷夏姆",
    },
    [230233] = {
        name = "莎哈塔",
    },
    [230235] = {
        name = "斯卡基特",
    },
    [230238] = {
        name = "斯卡基特",
    },
    [230242] = {
        name = "巴古斯",
    },
    [230246] = {
        name = "游学者周卓",
    },
    [230268] = {
        name = "蒙特·加兹鲁维",
    },
    [230271] = {
        name = "巴古斯",
    },
    [230288] = {
        name = "双界行者",
    },
    [230294] = {
        name = "欧·雷什",
    },
    [230554] = {
        name = "老头子洛维",
    },
    [230555] = {
        name = "皮茨·洛维",
    },
    [230602] = {
        name = "萨拉塔斯",
    },
    [230604] = {
        name = "欧·安",
    },
    [230634] = {
        name = "萨拉塔斯",
    },
    [230658] = {
        name = "萨拉塔斯",
    },
    [230700] = {
        name = "双界行者",
    },
    [230736] = {
        name = "欧·塔拉德",
    },
    [230738] = {
        name = "萨拉塔斯",
    },
    [230739] = {
        name = "撰魂师",
    },
    [230786] = {
        name = "撰魂师",
    },
    [230789] = {
        name = "莎哈塔",
    },
    [230806] = {
        name = "双界行者",
    },
    [230811] = {
        name = "双界行者",
    },
    [230814] = {
        name = "威·娜莉",
    },
    [230815] = {
        name = "菲琳·洛萨",
    },
    [230817] = {
        name = "奥蕾莉亚·风行者",
    },
    [230818] = {
        name = "撰魂师",
    },
    [230825] = {
        name = "萨拉塔斯",
    },
    [230841] = {
        name = "绿油骑士",
    },
    [230954] = {
        name = "塔·卡",
    },
    [230955] = {
        name = "巴·沃",
    },
    [231030] = {
        name = "阿拉托尔",
    },
    [231128] = {
        name = "双界行者",
    },
    [231140] = {
        name = "巴古斯",
    },
    [231143] = {
        name = "巴古斯",
    },
    [231162] = {
        name = "德利鲁耶",
    },
    [231266] = {
        name = "阿拉托尔",
    },
    [231314] = {
        name = "欧·达兰",
    },
    [231422] = {
        name = "流亡者希兹弗兰",
    },
    [231443] = {
        name = "撰魂师",
    },
    [231445] = {
        name = "萨拉塔斯",
    },
    [231486] = {
        name = "撰魂师",
    },
    [231487] = {
        name = "双界行者",
    },
    [231488] = {
        name = "奥蕾莉亚·风行者",
    },
    [231492] = {
        name = "双界行者",
    },
    [231505] = {
        name = "奥蕾莉亚·风行者",
    },
    [231517] = {
        name = "皮茨·洛维",
    },
    [231520] = {
        name = "萨拉塔斯",
    },
    [231522] = {
        name = "奥蕾莉亚·风行者",
    },
    [231564] = {
        name = "赛·宾",
    },
    [231674] = {
        name = "宝库守护者赛·维兹",
    },
    [231699] = {
        name = "流亡者希兹弗兰",
    },
    [231748] = {
        name = "玛姬·威特谢尔",
    },
    [231764] = {
        name = "菲琳·洛萨",
    },
    [231768] = {
        name = "盖亚拉大王",
    },
    [231770] = {
        name = "伊崔格",
    },
    [231771] = {
        name = "菲琳·洛萨",
    },
    [231803] = {
        name = "盖亚拉大王",
    },
    [231812] = {
        name = "玛提·飙车",
    },
    [231820] = {
        name = "威·娜莉",
    },
    [231826] = {
        name = "伊崔格",
    },
    [231828] = {
        name = "菲琳·洛萨",
    },
    [231829] = {
        name = "盖亚拉大王",
    },
    [231832] = {
        name = "伊崔格",
    },
    [231833] = {
        name = "盖亚拉大王",
    },
    [231837] = {
        name = "菲琳·洛萨",
    },
    [231919] = {
        name = "草药学家奥莱拉",
    },
    [232005] = {
        name = "司法官珠嬬",
    },
    [232008] = {
        name = "财团老板赛·伊勒姆",
    },
    [232057] = {
        name = "宝库守护者赛·维兹",
    },
    [232132] = {
        name = "拂晓",
    },
    [232180] = {
        name = "老头子洛维",
    },
    [232351] = {
        name = "商人巴·克里尔",
    },
    [232385] = {
        name = "草药学家奥莱拉",
    },
    [232491] = {
        name = "帕姆希",
    },
    [232498] = {
        name = "助理赛·奈尔",
    },
    [232642] = {
        name = "虚空精灵裂隙行者",
    },
    [232660] = {
        name = "虚空精灵射手",
    },
    [232822] = {
        name = "蒙特·加兹鲁维",
    },
    [232823] = {
        name = "玛提·飙车",
    },
    [232986] = {
        name = "达纳斯·托尔贝恩",
    },
    [233235] = {
        name = "盖瑞·缓堵",
    },
    [233296] = {
        name = "舰队指挥官海角",
    },
    [233390] = {
        name = "帕姆希",
    },
    [233420] = {
        name = "本尼·推箭",
    },
    [233482] = {
        name = "蒙特·加兹鲁维",
    },
    [233500] = {
        name = "欧·塔哈",
    },
    [233501] = {
        name = "巴古斯",
    },
    [233603] = {
        name = "双界行者",
    },
    [233706] = {
        name = "双界行者",
    },
    [233878] = {
        name = "萨拉塔斯",
    },
    [233946] = {
        name = "萨拉塔斯",
    },
    [234048] = {
        name = "蒙特·加兹鲁维",
    },
    [234106] = {
        name = "双界行者",
    },
    [234190] = {
        name = "奈拉瑟",
    },
    [234216] = {
        name = "助理工程师欧·维克",
    },
    [234272] = {
        name = "鲁巴恩",
    },
    [234293] = {
        name = "缝针巨怪",
    },
    [234294] = {
        name = "崔克西·栓轴",
    },
    [234316] = {
        name = "鲁巴恩",
    },
    [234483] = {
        name = "星界财团助手",
    },
    [234551] = {
        name = "蒙特·加兹鲁维",
    },
    [234596] = {
        name = "双界行者",
    },
    [234601] = {
        name = "欧·安",
    },
    [234602] = {
        name = "奥蕾莉亚·风行者",
    },
    [234620] = {
        name = "双界行者",
    },
    [234662] = {
        name = "达纳斯·托尔贝恩",
    },
    [234728] = {
        name = "奥威娜",
    },
    [234745] = {
        name = "赫米特·奈辛瓦里",
    },
    [234783] = {
        name = "马迪亚斯·肖尔大师",
    },
    [234801] = {
        name = "蒙特·加兹鲁维",
    },
    [235041] = {
        name = "罗德里克·布鲁斯顿队长",
    },
    [235238] = {
        name = "蒙特·加兹鲁维",
    },
    [235290] = {
        name = "赫米特·奈辛瓦里",
    },
    [235353] = {
        name = "赫米特·奈辛瓦里",
    },
    [235849] = {
        name = "黑水斗士",
    },
    [235860] = {
        name = "魔药设计师马里莱斯",
    },
    [236815] = {
        name = "卡嘉·血怒",
    },
    [236846] = {
        name = "赫米特·奈辛瓦里",
    },
    [236890] = {
        name = "赫米特·奈辛瓦里",
    },
    [236907] = {
        name = "阿达拉斯·暮焰",
    },
    [237705] = {
        name = "萨拉塔斯",
    },
    [238006] = {
        name = "马林·诺格弗格",
    },
    [238012] = {
        name = "罗德里克·布鲁斯顿队长",
    },
    [238209] = {
        name = "欧财团管理者",
    },
    [238212] = {
        name = "欧·塔拉德",
    },
    [240842] = {
        name = "蕾欧娜·涉暗",
    },
    [241588] = {
        name = "哈希姆",
    },
    [241601] = {
        name = "莎德安妮丝",
    },
    [241624] = {
        name = "莎德安妮丝",
    },
    [242179] = {
        name = "阿达拉斯·暮焰",
    },
    [242538] = {
        name = "威·娜莉",
    },
    [246601] = {
        name = "研究员伊萨蕾",
    },
    [246608] = {
        name = "迷失相位的蠕行者",
    },
    [248153] = {
        name = "魔导师乌布里克",
    },
    [250839] = {
        name = "白银之手侍从",
    },
})
]])()
