----- AUTO GENERATED - DO NOT EDIT

if GetLocale() ~= "koKR" then
    return
end

loadstring([[
BtWQuestsDatabase:UpdateNPCsTable({
    [20448] = {
        name = "사령관 야미르",
    },
    [20482] = {
        name = "사령관 야미르의 영상",
    },
    [20907] = {
        name = "학자 다비리",
    },
    [27314] = {
        name = "예지자 젤리그",
    },
    [130133] = {
        name = "여군주 리아드린",
    },
    [145005] = {
        name = "원정순찰대원 엘리트",
    },
    [145015] = {
        name = "로르테마르 테론",
    },
    [145793] = {
        name = "여군주 리아드린",
    },
    [156688] = {
        name = "주최자 타렐라",
    },
    [162804] = {
        name = "베나리",
    },
    [206528] = {
        name = "알리야 힐헬름",
    },
    [207471] = {
        name = "미망인 아라크나이",
    },
    [208782] = {
        name = "집행자 니즈레크",
    },
    [209918] = {
        name = "수석 목동 스텐스포어",
    },
    [211351] = {
        name = "안두인 린",
    },
    [211399] = {
        name = "몬테 가즈로",
    },
    [211409] = {
        name = "페어린 로서",
    },
    [211444] = {
        name = "플린 페어윈드",
    },
    [211499] = {
        name = "집행자 니즈레크",
    },
    [211652] = {
        name = "녹색예언자 나레이로",
    },
    [211699] = {
        name = "페어린",
    },
    [211721] = {
        name = "조나단 트루하트 경",
    },
    [211740] = {
        name = "떼까마귀지기 루프셀라",
    },
    [211752] = {
        name = "알레리아 윈드러너",
    },
    [211859] = {
        name = "바엘그림",
    },
    [211993] = {
        name = "스랄",
    },
    [211994] = {
        name = "여군주 제이나 프라우드무어",
    },
    [212076] = {
        name = "장군 스틸스트라이크",
    },
    [212269] = {
        name = "쏜살이",
    },
    [212295] = {
        name = "웬브랜트",
    },
    [212450] = {
        name = "안두인 린",
    },
    [212519] = {
        name = "대변자 브린테",
    },
    [212592] = {
        name = "대변자 브린테",
    },
    [212695] = {
        name = "기계공 키트린",
    },
    [212700] = {
        name = "수림지기 이그리스",
    },
    [212708] = {
        name = "번영서약 크루통",
    },
    [212741] = {
        name = "대변자 브린테",
    },
    [212742] = {
        name = "모이라 타우릿산",
    },
    [212747] = {
        name = "바엘그림",
    },
    [212749] = {
        name = "바엘그림",
    },
    [212750] = {
        name = "웬브랜트",
    },
    [212756] = {
        name = "바엘그림",
    },
    [212829] = {
        name = "여군주 제이나 프라우드무어",
    },
    [212991] = {
        name = "쏜살이",
    },
    [212992] = {
        name = "대변자 브린테",
    },
    [213107] = {
        name = "페어린 로서",
    },
    [213108] = {
        name = "장군 스틸스트라이크",
    },
    [213116] = {
        name = "페어린 로서",
    },
    [213120] = {
        name = "안두인 린",
    },
    [213145] = {
        name = "아우랄리아 스틸스트라이크",
    },
    [213152] = {
        name = "쏜살이",
    },
    [213184] = {
        name = "코르그란",
    },
    [213187] = {
        name = "우르타고",
    },
    [213569] = {
        name = "대변자 브린테",
    },
    [213612] = {
        name = "마그니 브론즈비어드",
    },
    [213613] = {
        name = "에미라 액턴",
    },
    [213614] = {
        name = "테나르 스트롱고스",
    },
    [213620] = {
        name = "스랄",
    },
    [213624] = {
        name = "마그니 브론즈비어드",
    },
    [213625] = {
        name = "여군주 제이나 프라우드무어",
    },
    [213627] = {
        name = "대마법사 카드가",
    },
    [213634] = {
        name = "다그란 타우릿산 2세",
    },
    [213687] = {
        name = "우르타고",
    },
    [213688] = {
        name = "우르타고",
    },
    [213691] = {
        name = "하르모트",
    },
    [213763] = {
        name = "모이라 타우릿산",
    },
    [213787] = {
        name = "공작 벨한",
    },
    [213796] = {
        name = "모이라 타우릿산",
    },
    [213840] = {
        name = "여관주인 브락스",
    },
    [213869] = {
        name = "감시자 토키",
    },
    [213983] = {
        name = "안두인 린",
    },
    [214019] = {
        name = "아에고르 아이린번드",
    },
    [214076] = {
        name = "스케짓 신더뱅스",
    },
    [214168] = {
        name = "스케짓 신더뱅스",
    },
    [214271] = {
        name = "장군 스틸스트라이크",
    },
    [214273] = {
        name = "안두인 린",
    },
    [214276] = {
        name = "여군주 제이나 프라우드무어",
    },
    [214296] = {
        name = "무대 책임자 후베르타",
    },
    [214356] = {
        name = "빅사론",
    },
    [214359] = {
        name = "키쉬날",
    },
    [214376] = {
        name = "장군 스틸스트라이크",
    },
    [214378] = {
        name = "페어린",
    },
    [214380] = {
        name = "라엔 던카발리르",
    },
    [214402] = {
        name = "알레리아 윈드러너",
    },
    [214404] = {
        name = "페어린 로서",
    },
    [214405] = {
        name = "알레리아 윈드러너",
    },
    [214413] = {
        name = "페어린 로서",
    },
    [214444] = {
        name = "아가르타",
    },
    [214651] = {
        name = "모이라 타우릿산",
    },
    [214663] = {
        name = "고위 대변자 브린테",
    },
    [214665] = {
        name = "대마법사 드렌덴",
    },
    [214669] = {
        name = "브란 브론즈비어드",
    },
    [214890] = {
        name = "무쇠화물 경호원",
    },
    [214892] = {
        name = "다그란 타우릿산 2세",
    },
    [214908] = {
        name = "알레리아 윈드러너",
    },
    [214916] = {
        name = "메릭스",
    },
    [214917] = {
        name = "모이라 타우릿산",
    },
    [214919] = {
        name = "스랄",
    },
    [214921] = {
        name = "하르모트",
    },
    [214922] = {
        name = "수확자 파르니",
    },
    [214995] = {
        name = "올바리그",
    },
    [215037] = {
        name = "베티베리안",
    },
    [215039] = {
        name = "떼까마귀지기 루프셀라",
    },
    [215041] = {
        name = "미랄 머더 미튼스",
    },
    [215113] = {
        name = "오르웨냐",
    },
    [215187] = {
        name = "대군주 게야라",
    },
    [215201] = {
        name = "아가르타",
    },
    [215208] = {
        name = "오르센스",
    },
    [215209] = {
        name = "먼더루트",
    },
    [215211] = {
        name = "쿠르드란 와일드해머",
    },
    [215234] = {
        name = "페르다고르",
    },
    [215237] = {
        name = "알리사 보우블레이즈",
    },
    [215254] = {
        name = "알리사 보우블레이즈",
    },
    [215277] = {
        name = "아델곤",
    },
    [215301] = {
        name = "신다 크리드파이크",
    },
    [215306] = {
        name = "엔디리 던서지",
    },
    [215327] = {
        name = "아가르타",
    },
    [215331] = {
        name = "페어린 로서",
    },
    [215335] = {
        name = "장군 스틸스트라이크",
    },
    [215341] = {
        name = "위대한 카이론",
    },
    [215349] = {
        name = "대사술사 오호도",
    },
    [215413] = {
        name = "몬테 가즈로",
    },
    [215527] = {
        name = "케이라 플레임스트런지",
    },
    [215625] = {
        name = "릴리안 보스",
    },
    [215626] = {
        name = "릴리안 보스",
    },
    [215628] = {
        name = "릴리안 보스",
    },
    [215637] = {
        name = "이테키",
    },
    [215659] = {
        name = "이테키",
    },
    [215661] = {
        name = "릴리안 보스",
    },
    [215662] = {
        name = "릴리안 보스",
    },
    [215672] = {
        name = "쏜살이",
    },
    [215724] = {
        name = "네이레이아",
    },
    [215737] = {
        name = "네브",
    },
    [215744] = {
        name = "버크홀트",
    },
    [215745] = {
        name = "라반",
    },
    [215748] = {
        name = "웬델린",
    },
    [215781] = {
        name = "모이라 타우릿산",
    },
    [215788] = {
        name = "빛나는 미소의 베룬드",
    },
    [215821] = {
        name = "모이라 타우릿산",
    },
    [215822] = {
        name = "빛나는 미소의 베룬드",
    },
    [215824] = {
        name = "모이라 타우릿산",
    },
    [215836] = {
        name = "빛나는 미소의 베룬드",
    },
    [215845] = {
        name = "몬테 가즈로",
    },
    [215944] = {
        name = "오르웨냐",
    },
    [216001] = {
        name = "소피에타 린플레임",
    },
    [216025] = {
        name = "광란의 정령",
    },
    [216046] = {
        name = "타카스",
    },
    [216061] = {
        name = "대장 트루플레임",
    },
    [216063] = {
        name = "정찰병 웨이셸름",
    },
    [216085] = {
        name = "모이라 타우릿산",
    },
    [216094] = {
        name = "코둔",
    },
    [216149] = {
        name = "모이라 타우릿산",
    },
    [216167] = {
        name = "스랄",
    },
    [216168] = {
        name = "여군주 제이나 프라우드무어",
    },
    [216169] = {
        name = "코르그란",
    },
    [216173] = {
        name = "우르타고",
    },
    [216213] = {
        name = "물렛가락",
    },
    [216311] = {
        name = "클라이브 델기즈모",
    },
    [216438] = {
        name = "할머니 스크리블스",
    },
    [216479] = {
        name = "마그니 브론즈비어드",
    },
    [216480] = {
        name = "다그란 타우릿산 2세",
    },
    [216566] = {
        name = "푸른기름의 기사",
    },
    [216567] = {
        name = "꼬질이",
    },
    [216568] = {
        name = "현장감독 땟국이",
    },
    [216628] = {
        name = "바엘그림",
    },
    [216878] = {
        name = "우르타고",
    },
    [216994] = {
        name = "제니 붐버클",
    },
    [216996] = {
        name = "루반",
    },
    [217029] = {
        name = "몬테 가즈로",
    },
    [217069] = {
        name = "메릭스",
    },
    [217072] = {
        name = "베브루시",
    },
    [217091] = {
        name = "보크그레트",
    },
    [217095] = {
        name = "메릭스",
    },
    [217097] = {
        name = "메릭스",
    },
    [217128] = {
        name = "대변자 쿨다스",
    },
    [217131] = {
        name = "현장감독 땟국이",
    },
    [217133] = {
        name = "칼 스몰더브로우",
    },
    [217152] = {
        name = "넓적턱",
    },
    [217245] = {
        name = "고위 대변자 브린테",
    },
    [217248] = {
        name = "엘마",
    },
    [217255] = {
        name = "아그탁스",
    },
    [217330] = {
        name = "아눕아잘",
    },
    [217331] = {
        name = "다그란 타우릿산 2세",
    },
    [217355] = {
        name = "클라스킨",
    },
    [217356] = {
        name = "아라크네",
    },
    [217385] = {
        name = "알레리아 윈드러너",
    },
    [217386] = {
        name = "안두인 린",
    },
    [217398] = {
        name = "수녀 에트나 블레이즈",
    },
    [217402] = {
        name = "그리그",
    },
    [217424] = {
        name = "남작 시베스탄 브라운파이크",
    },
    [217426] = {
        name = "텔레온 브라운파이크 경",
    },
    [217474] = {
        name = "켈다즈",
    },
    [217565] = {
        name = "알쿠비안",
    },
    [217598] = {
        name = "모이라 타우릿산",
    },
    [217609] = {
        name = "바랄 린플레임",
    },
    [217640] = {
        name = "알버트",
    },
    [217656] = {
        name = "투베로스",
    },
    [217659] = {
        name = "타레사 선스트랜드",
    },
    [217692] = {
        name = "아르신",
    },
    [217724] = {
        name = "어린 야금도롱뇽",
    },
    [217763] = {
        name = "란난 코렌",
    },
    [217766] = {
        name = "바엘그림",
    },
    [217828] = {
        name = "란난 코렌",
    },
    [217849] = {
        name = "아델곤",
    },
    [217852] = {
        name = "바엘그림",
    },
    [217854] = {
        name = "메릭스",
    },
    [217857] = {
        name = "대변자 브린테",
    },
    [217861] = {
        name = "메릭스",
    },
    [217864] = {
        name = "모이라 타우릿산",
    },
    [217878] = {
        name = "모이라 타우릿산",
    },
    [217879] = {
        name = "아델곤",
    },
    [217880] = {
        name = "메릭스",
    },
    [217881] = {
        name = "바엘그림",
    },
    [217887] = {
        name = "모이라 타우릿산",
    },
    [217898] = {
        name = "모이라 타우릿산",
    },
    [217904] = {
        name = "메릭스",
    },
    [217961] = {
        name = "흐레카",
    },
    [217994] = {
        name = "알버트",
    },
    [218062] = {
        name = "알리사 보우블레이즈",
    },
    [218171] = {
        name = "샬바",
    },
    [218182] = {
        name = "알레리아 윈드러너",
    },
    [218267] = {
        name = "페어린 로서",
    },
    [218290] = {
        name = "현장감독 우즈잭스",
    },
    [218333] = {
        name = "수림지기 이그리스",
    },
    [218508] = {
        name = "조세프 브레이브마크",
    },
    [218535] = {
        name = "게르미라",
    },
    [218541] = {
        name = "안두인 린",
    },
    [218714] = {
        name = "모이라 타우릿산",
    },
    [218715] = {
        name = "대변자 브린테",
    },
    [218837] = {
        name = "아푸르",
    },
    [218864] = {
        name = "걸헤드",
    },
    [218866] = {
        name = "워크메이",
    },
    [218878] = {
        name = "말린",
    },
    [219135] = {
        name = "웬렌 알살",
    },
    [219173] = {
        name = "웬렌 알살",
    },
    [219252] = {
        name = "알레리아 윈드러너",
    },
    [219357] = {
        name = "웅변가 티시티크",
    },
    [219393] = {
        name = "알드라",
    },
    [219394] = {
        name = "평화감시자 크라가드",
    },
    [219400] = {
        name = "메릭스",
    },
    [219430] = {
        name = "특이한 생선",
    },
    [219437] = {
        name = "도르노갈 시민",
    },
    [219452] = {
        name = "마그니 브론즈비어드",
    },
    [219475] = {
        name = "스틸베인",
    },
    [219674] = {
        name = "꼬질이",
    },
    [219784] = {
        name = "바츠바라",
    },
    [219885] = {
        name = "안두인 린",
    },
    [219899] = {
        name = "바츠바라",
    },
    [220051] = {
        name = "플린 페어윈드",
    },
    [220124] = {
        name = "페어린 로서",
    },
    [220220] = {
        name = "빛나는 미소의 베룬드",
    },
    [220406] = {
        name = "페어린 로서",
    },
    [220415] = {
        name = "흐란다즈",
    },
    [220417] = {
        name = "캐그프리타",
    },
    [220446] = {
        name = "스코르투즈",
    },
    [220595] = {
        name = "오르웨냐",
    },
    [220597] = {
        name = "브레녹",
    },
    [220600] = {
        name = "하이마즈",
    },
    [220603] = {
        name = "오르웨냐",
    },
    [220608] = {
        name = "하난",
    },
    [220610] = {
        name = "오르웨냐",
    },
    [220688] = {
        name = "알레리아 윈드러너",
    },
    [220690] = {
        name = "클라스킨",
    },
    [220718] = {
        name = "메라 아쉴드",
    },
    [220784] = {
        name = "바츠바라",
    },
    [220928] = {
        name = "고위 대변자 브린테",
    },
    [221043] = {
        name = "놀리 마를렌",
    },
    [221092] = {
        name = "웅변가 티시티크",
    },
    [221093] = {
        name = "웅변가 티시티크",
    },
    [221100] = {
        name = "페어린",
    },
    [221355] = {
        name = "우르타고",
    },
    [221390] = {
        name = "밀랍장수 스퀴익",
    },
    [221492] = {
        name = "수도원 기사",
    },
    [221550] = {
        name = "렌카트",
    },
    [221557] = {
        name = "고위 대그물장이 안투릭스",
    },
    [221733] = {
        name = "페어린 로서",
    },
    [221842] = {
        name = "연금술사 탈백스",
    },
    [221948] = {
        name = "숨라타",
    },
    [221961] = {
        name = "페어린 로서",
    },
    [221977] = {
        name = "몬테 가즈로",
    },
    [221980] = {
        name = "아라시 복수자",
    },
    [222132] = {
        name = "테스",
    },
    [222136] = {
        name = "테스",
    },
    [222224] = {
        name = "평화감시자 레프",
    },
    [222234] = {
        name = "스크리트",
    },
    [222239] = {
        name = "스크리트",
    },
    [222268] = {
        name = "평화감시자 레프",
    },
    [222314] = {
        name = "평화감시자 레프",
    },
    [222352] = {
        name = "점등원 케어테르",
    },
    [222356] = {
        name = "점등원 케어테르",
    },
    [222358] = {
        name = "평화감시자 레프",
    },
    [222360] = {
        name = "점등원 케어테르",
    },
    [222362] = {
        name = "평화감시자 레프",
    },
    [222363] = {
        name = "평화감시자 레프",
    },
    [222364] = {
        name = "점등원 케어테르",
    },
    [222555] = {
        name = "바엘그림",
    },
    [222683] = {
        name = "헬무트 아이기스액스",
    },
    [222790] = {
        name = "구트술",
    },
    [222803] = {
        name = "쏜살이",
    },
    [223000] = {
        name = "켈다즈",
    },
    [223166] = {
        name = "대마법사 에이타스 선리버",
    },
    [223184] = {
        name = "가브 기어휘슬",
    },
    [223205] = {
        name = "대총독 투랄리온",
    },
    [223267] = {
        name = "아우랄리아 스틸스트라이크",
    },
    [223268] = {
        name = "장군 스틸스트라이크",
    },
    [223285] = {
        name = "오르웨냐",
    },
    [223286] = {
        name = "하난",
    },
    [223467] = {
        name = "페어린 로서",
    },
    [223637] = {
        name = "나탈리아 피어스",
    },
    [223723] = {
        name = "해바라기 씨",
    },
    [223754] = {
        name = "리니 리드핑거",
    },
    [223759] = {
        name = "신루나",
    },
    [223760] = {
        name = "우코스비아",
    },
    [223875] = {
        name = "페어린 로서",
    },
    [223920] = {
        name = "오렌 마신",
    },
    [223924] = {
        name = "나탈리아 피어스",
    },
    [223944] = {
        name = "알레리아 윈드러너",
    },
    [224154] = {
        name = "장군 스틸스트라이크",
    },
    [224310] = {
        name = "위대한 카이론",
    },
    [224345] = {
        name = "아눕아잘",
    },
    [224362] = {
        name = "바츠바라",
    },
    [224378] = {
        name = "오렌 마신",
    },
    [224379] = {
        name = "오렌 마신",
    },
    [224392] = {
        name = "올바리그",
    },
    [224394] = {
        name = "하르모트",
    },
    [224395] = {
        name = "오르웨냐",
    },
    [224397] = {
        name = "하난",
    },
    [224602] = {
        name = "다나그",
    },
    [224618] = {
        name = "다나그의 톱니방랑자",
    },
    [224707] = {
        name = "알베가르",
    },
    [224708] = {
        name = "센데라그",
    },
    [224729] = {
        name = "아눕오키",
    },
    [224740] = {
        name = "오르웨냐",
    },
    [224741] = {
        name = "돌레나",
    },
    [224857] = {
        name = "몬테 가즈로",
    },
    [224866] = {
        name = "오르웨냐",
    },
    [224874] = {
        name = "몬테 가즈로",
    },
    [224913] = {
        name = "칼잡이 렌직",
    },
    [224930] = {
        name = "우르타고",
    },
    [224945] = {
        name = "페어린 로서",
    },
    [224946] = {
        name = "위대한 카이론",
    },
    [224966] = {
        name = "민디 맥슬로프",
    },
    [225188] = {
        name = "장군 스틸스트라이크",
    },
    [225426] = {
        name = "사라디",
    },
    [225451] = {
        name = "다그란 타우릿산 2세",
    },
    [225453] = {
        name = "다그란 타우릿산 2세",
    },
    [225454] = {
        name = "평화감시자 헥타르",
    },
    [225472] = {
        name = "다그란 타우릿산 2세",
    },
    [225478] = {
        name = "대변자 브린테",
    },
    [225481] = {
        name = "점액잠수부 카잔드라",
    },
    [225500] = {
        name = "그리믈라 피즐크랭크",
    },
    [225523] = {
        name = "몬테 가즈로",
    },
    [225533] = {
        name = "테르칸",
    },
    [225555] = {
        name = "닉낵",
    },
    [225570] = {
        name = "몬테 가즈로",
    },
    [225571] = {
        name = "칼잡이 렌직",
    },
    [225582] = {
        name = "현장감독 듀인스",
    },
    [225583] = {
        name = "기계공 킬튼",
    },
    [225587] = {
        name = "몬테 가즈로",
    },
    [225591] = {
        name = "팸지",
    },
    [225596] = {
        name = "오르웨냐",
    },
    [225597] = {
        name = "몬테 가즈로",
    },
    [225598] = {
        name = "몬테 가즈로",
    },
    [225599] = {
        name = "칼잡이 렌직",
    },
    [225608] = {
        name = "프로스페라 코그웨일",
    },
    [225616] = {
        name = "코그윈",
    },
    [225618] = {
        name = "팸지",
    },
    [225624] = {
        name = "마린 노겐포저",
    },
    [225625] = {
        name = "몬테 가즈로",
    },
    [225635] = {
        name = "몬테 가즈로",
    },
    [225637] = {
        name = "그리믈라 피즐크랭크",
    },
    [225638] = {
        name = "그리믈라 피즐크랭크",
    },
    [225639] = {
        name = "몬테 가즈로",
    },
    [225645] = {
        name = "몬테 가즈로",
    },
    [225648] = {
        name = "몬테 가즈로",
    },
    [225659] = {
        name = "오르웨냐",
    },
    [225669] = {
        name = "알레리아 윈드러너",
    },
    [225686] = {
        name = "남작 레빌가즈",
    },
    [225711] = {
        name = "장군 스틸스트라이크",
    },
    [225719] = {
        name = "몬테 가즈로",
    },
    [225730] = {
        name = "몬테 가즈로",
    },
    [225756] = {
        name = "몬테 가즈로",
    },
    [225757] = {
        name = "몬테 가즈로",
    },
    [225772] = {
        name = "팸지",
    },
    [225847] = {
        name = "투자개발회사 현장감독",
    },
    [225857] = {
        name = "레레나이 페인",
    },
    [225867] = {
        name = "마린 노겐포저",
    },
    [225868] = {
        name = "남작 레빌가즈",
    },
    [225870] = {
        name = "함장 시혼",
    },
    [225871] = {
        name = "그리믈라 피즐크랭크",
    },
    [225873] = {
        name = "오르웨냐",
    },
    [225876] = {
        name = "그리믈라 피즐크랭크",
    },
    [225878] = {
        name = "몬테 가즈로",
    },
    [225879] = {
        name = "데릴 페인",
    },
    [225925] = {
        name = "소피에타 린플레임",
    },
    [225926] = {
        name = "소피에타 린플레임",
    },
    [226019] = {
        name = "물렛가락",
    },
    [226040] = {
        name = "고위 대변자 브린테",
    },
    [226255] = {
        name = "치브",
    },
    [226273] = {
        name = "몬테 가즈로",
    },
    [226277] = {
        name = "마티 줌카트",
    },
    [226336] = {
        name = "프로스페라 코그웨일",
    },
    [226518] = {
        name = "아버지 크라즈 토크렌치",
    },
    [226522] = {
        name = "니니 토크렌치",
    },
    [226569] = {
        name = "스냅 벨럼그리즈",
    },
    [226660] = {
        name = "더크 그리즈딜러",
    },
    [226672] = {
        name = "오르웨냐",
    },
    [226703] = {
        name = "스냅 벨럼그리즈",
    },
    [226710] = {
        name = "들쥐",
    },
    [226728] = {
        name = "험프리 쇼트스위그",
    },
    [226750] = {
        name = "풍요서약 에테르카",
    },
    [226791] = {
        name = "보랏빛 감시관",
    },
    [226792] = {
        name = "목동 에디테트",
    },
    [226841] = {
        name = "대변자 브린테",
    },
    [226846] = {
        name = "선장 오스미트",
    },
    [226894] = {
        name = "마티 줌카트",
    },
    [226899] = {
        name = "서기관 노움",
    },
    [226932] = {
        name = "마티 줌카트",
    },
    [226934] = {
        name = "조조 고브드레",
    },
    [227018] = {
        name = "마티 줌카트",
    },
    [227032] = {
        name = "마티 줌카트",
    },
    [227158] = {
        name = "하난",
    },
    [227217] = {
        name = "웹스터",
    },
    [227222] = {
        name = "이사벨 글림가드",
    },
    [227224] = {
        name = "고에히",
    },
    [227436] = {
        name = "대마법사 카드가",
    },
    [227477] = {
        name = "브란 브론즈비어드",
    },
    [227499] = {
        name = "오르웨냐",
    },
    [227523] = {
        name = "브란 브론즈비어드",
    },
    [227531] = {
        name = "몬테 가즈로",
    },
    [227544] = {
        name = "브란 브론즈비어드",
    },
    [227691] = {
        name = "오르웨냐",
    },
    [227758] = {
        name = "알레리아 윈드러너",
    },
    [227937] = {
        name = "칼잡이 렌직",
    },
    [228017] = {
        name = "지르도",
    },
    [228074] = {
        name = "앙골라",
    },
    [228132] = {
        name = "칼잡이 렌직",
    },
    [228158] = {
        name = "립스누들",
    },
    [228214] = {
        name = "팸지",
    },
    [228286] = {
        name = "스케짓 신더뱅스",
    },
    [228333] = {
        name = "스케짓 신더뱅스",
    },
    [228341] = {
        name = "스케짓 신더뱅스",
    },
    [228369] = {
        name = "마티 줌카트",
    },
    [228393] = {
        name = "브룩시 슬라이훅",
    },
    [228420] = {
        name = "타르보나라 피즐크랭크",
    },
    [228473] = {
        name = "환상적인 데이비",
    },
    [228474] = {
        name = "케이제이",
    },
    [228566] = {
        name = "재즈 모키츠",
    },
    [228857] = {
        name = "아주머니 키아라",
    },
    [228860] = {
        name = "\"수다쟁이\" 가비",
    },
    [228894] = {
        name = "오르웨냐",
    },
    [229223] = {
        name = "몬테 가즈로",
    },
    [229233] = {
        name = "몬테 가즈로",
    },
    [229235] = {
        name = "몬테 가즈로",
    },
    [229236] = {
        name = "몬테 가즈로",
    },
    [229242] = {
        name = "칼잡이 렌직",
    },
    [229243] = {
        name = "칼잡이 렌직",
    },
    [229246] = {
        name = "그리믈라 피즐크랭크",
    },
    [229261] = {
        name = "몬테 가즈로",
    },
    [229940] = {
        name = "대령 베로니카 나이얼스",
    },
    [230145] = {
        name = "아이트리그",
    },
    [230151] = {
        name = "대군주 게야라",
    },
    [230154] = {
        name = "다나스 트롤베인",
    },
    [230159] = {
        name = "옴펜나드",
    },
    [230174] = {
        name = "워커 그레샴",
    },
    [230233] = {
        name = "샤아타",
    },
    [230235] = {
        name = "스카짓",
    },
    [230238] = {
        name = "스카짓",
    },
    [230242] = {
        name = "바르구스",
    },
    [230246] = {
        name = "전승지기 초",
    },
    [230268] = {
        name = "몬테 가즈로",
    },
    [230271] = {
        name = "바르구스",
    },
    [230288] = {
        name = "공간 방랑자",
    },
    [230294] = {
        name = "옴래쉬",
    },
    [230554] = {
        name = "노인 로",
    },
    [230555] = {
        name = "피츠 로",
    },
    [230602] = {
        name = "잘아타스",
    },
    [230604] = {
        name = "옴엔",
    },
    [230634] = {
        name = "잘아타스",
    },
    [230658] = {
        name = "잘아타스",
    },
    [230700] = {
        name = "공간 방랑자",
    },
    [230736] = {
        name = "옴탈라드",
    },
    [230738] = {
        name = "잘아타스",
    },
    [230739] = {
        name = "영혼필경사",
    },
    [230786] = {
        name = "영혼필경사",
    },
    [230789] = {
        name = "샤아타",
    },
    [230806] = {
        name = "공간 방랑자",
    },
    [230811] = {
        name = "공간 방랑자",
    },
    [230814] = {
        name = "베나리",
    },
    [230815] = {
        name = "페어린 로서",
    },
    [230817] = {
        name = "알레리아 윈드러너",
    },
    [230818] = {
        name = "영혼필경사",
    },
    [230825] = {
        name = "잘아타스",
    },
    [230841] = {
        name = "푸른기름의 기사",
    },
    [230954] = {
        name = "타카",
    },
    [230955] = {
        name = "바베르",
    },
    [231030] = {
        name = "아라토르",
    },
    [231128] = {
        name = "공간 방랑자",
    },
    [231140] = {
        name = "바르구스",
    },
    [231143] = {
        name = "바르구스",
    },
    [231162] = {
        name = "드리루즈",
    },
    [231266] = {
        name = "아라토르",
    },
    [231314] = {
        name = "옴달란",
    },
    [231422] = {
        name = "추방자 히즈프란",
    },
    [231443] = {
        name = "영혼필경사",
    },
    [231445] = {
        name = "잘아타스",
    },
    [231486] = {
        name = "영혼필경사",
    },
    [231487] = {
        name = "공간 방랑자",
    },
    [231488] = {
        name = "알레리아 윈드러너",
    },
    [231492] = {
        name = "공간 방랑자",
    },
    [231505] = {
        name = "알레리아 윈드러너",
    },
    [231517] = {
        name = "피츠 로",
    },
    [231520] = {
        name = "잘아타스",
    },
    [231522] = {
        name = "알레리아 윈드러너",
    },
    [231564] = {
        name = "자이빈",
    },
    [231674] = {
        name = "금고지기 자이베즈",
    },
    [231699] = {
        name = "추방자 히즈프란",
    },
    [231748] = {
        name = "매기 윌트셔",
    },
    [231764] = {
        name = "페어린 로서",
    },
    [231768] = {
        name = "대군주 게야라",
    },
    [231770] = {
        name = "아이트리그",
    },
    [231771] = {
        name = "페어린 로서",
    },
    [231803] = {
        name = "대군주 게야라",
    },
    [231812] = {
        name = "마티 줌카트",
    },
    [231820] = {
        name = "베나리",
    },
    [231826] = {
        name = "아이트리그",
    },
    [231828] = {
        name = "페어린 로서",
    },
    [231829] = {
        name = "대군주 게야라",
    },
    [231832] = {
        name = "아이트리그",
    },
    [231833] = {
        name = "대군주 게야라",
    },
    [231837] = {
        name = "페어린 로서",
    },
    [231919] = {
        name = "식물학자 알랜라",
    },
    [232005] = {
        name = "서기관 노움",
    },
    [232008] = {
        name = "중개단장 자이올름",
    },
    [232057] = {
        name = "금고지기 자이베즈",
    },
    [232132] = {
        name = "던",
    },
    [232180] = {
        name = "노인 로",
    },
    [232351] = {
        name = "무역상 바크릴",
    },
    [232385] = {
        name = "식물학자 알랜라",
    },
    [232491] = {
        name = "팸지",
    },
    [232498] = {
        name = "조력자 자이넬",
    },
    [232642] = {
        name = "공허 엘프 균열방랑자",
    },
    [232660] = {
        name = "공허 엘프 궁수",
    },
    [232822] = {
        name = "몬테 가즈로",
    },
    [232823] = {
        name = "마티 줌카트",
    },
    [232986] = {
        name = "다나스 트롤베인",
    },
    [233235] = {
        name = "게리 클로그크로우",
    },
    [233296] = {
        name = "함장 시혼",
    },
    [233390] = {
        name = "팸지",
    },
    [233420] = {
        name = "베니 구스로켓",
    },
    [233482] = {
        name = "몬테 가즈로",
    },
    [233500] = {
        name = "옴타하",
    },
    [233501] = {
        name = "바르구스",
    },
    [233603] = {
        name = "공간 방랑자",
    },
    [233706] = {
        name = "공간 방랑자",
    },
    [233878] = {
        name = "잘아타스",
    },
    [233946] = {
        name = "잘아타스",
    },
    [234048] = {
        name = "몬테 가즈로",
    },
    [234106] = {
        name = "공간 방랑자",
    },
    [234190] = {
        name = "나라테",
    },
    [234216] = {
        name = "보조 기술자 옴벡",
    },
    [234272] = {
        name = "루반",
    },
    [234293] = {
        name = "바늘퉁이",
    },
    [234294] = {
        name = "트릭시 볼트크랭크",
    },
    [234316] = {
        name = "루반",
    },
    [234483] = {
        name = "무역연합 조수",
    },
    [234551] = {
        name = "몬테 가즈로",
    },
    [234596] = {
        name = "공간 방랑자",
    },
    [234601] = {
        name = "옴엔",
    },
    [234602] = {
        name = "알레리아 윈드러너",
    },
    [234620] = {
        name = "공간 방랑자",
    },
    [234662] = {
        name = "다나스 트롤베인",
    },
    [234728] = {
        name = "오르웨냐",
    },
    [234745] = {
        name = "헤멧 네싱워리",
    },
    [234783] = {
        name = "단장 마티아스 쇼",
    },
    [234801] = {
        name = "몬테 가즈로",
    },
    [235041] = {
        name = "대장 로데릭 브루스턴",
    },
    [235238] = {
        name = "몬테 가즈로",
    },
    [235290] = {
        name = "헤멧 네싱워리",
    },
    [235353] = {
        name = "헤멧 네싱워리",
    },
    [235849] = {
        name = "블랙워터 투사",
    },
    [235860] = {
        name = "역병 설계자 메릴레트",
    },
    [236815] = {
        name = "카르가 블러드퓨리",
    },
    [236846] = {
        name = "헤멧 네싱워리",
    },
    [236890] = {
        name = "헤멧 네싱워리",
    },
    [236907] = {
        name = "아다루스 더스크블레이즈",
    },
    [237705] = {
        name = "잘아타스",
    },
    [238006] = {
        name = "마린 노겐포저",
    },
    [238012] = {
        name = "대장 로데릭 브루스턴",
    },
    [238209] = {
        name = "옴 중개단 관리인",
    },
    [238212] = {
        name = "옴탈라드",
    },
    [240842] = {
        name = "레오나 다크스트라이더",
    },
    [241588] = {
        name = "하심",
    },
    [241601] = {
        name = "샤드아니스",
    },
    [241624] = {
        name = "샤드아니스",
    },
    [242179] = {
        name = "아다루스 더스크블레이즈",
    },
    [242538] = {
        name = "베나리",
    },
    [246601] = {
        name = "연구원 에사레이",
    },
    [246608] = {
        name = "위상을 떠도는 살금벌레",
    },
    [248153] = {
        name = "마법학자 엄브릭",
    },
    [250839] = {
        name = "은빛 성기사단 종자",
    },
})
]])()
