----- AUTO GENERATED - DO NOT EDIT

if GetLocale() ~= "ruRU" then
    return
end

loadstring([[
BtWQuestsDatabase:UpdateNPCsTable({
    [20448] = {
        name = "Командир Амир",
    },
    [20482] = {
        name = "Проекция командира Амира",
    },
    [20907] = {
        name = "Профессор Дабири",
    },
    [27314] = {
        name = "Зелиг Иллюзорный",
    },
    [130133] = {
        name = "Леди Лиадрин",
    },
    [145005] = {
        name = "Странник-ветеран",
    },
    [145015] = {
        name = "Лор'темар Терон",
    },
    [145793] = {
        name = "Леди Лиадрин",
    },
    [156688] = {
        name = "Хозяин Та'релла",
    },
    [162804] = {
        name = "Ве'нари",
    },
    [206528] = {
        name = "Алия Хиллхельм",
    },
    [207471] = {
        name = "Вдова Арак'най",
    },
    [208782] = {
        name = "Вершитель Низрек",
    },
    [209918] = {
        name = "Главный заводчик Стенспор",
    },
    [211351] = {
        name = "Андуин Ринн",
    },
    [211399] = {
        name = "Монти Газлоу",
    },
    [211409] = {
        name = "Ферин Лотар",
    },
    [211444] = {
        name = "Флинн Фэйрвинд",
    },
    [211499] = {
        name = "Вершитель Низрек",
    },
    [211652] = {
        name = "Глашатай растений На'лайро",
    },
    [211699] = {
        name = "Ферин",
    },
    [211721] = {
        name = "Сэр Джонатан Чистосердечный",
    },
    [211740] = {
        name = "Наставница буреклювов Люфсела",
    },
    [211752] = {
        name = "Аллерия Ветрокрылая",
    },
    [211859] = {
        name = "Бэлгрим",
    },
    [211993] = {
        name = "Тралл",
    },
    [211994] = {
        name = "Леди Джайна Праудмур",
    },
    [212076] = {
        name = "Генерал Стилстрайк",
    },
    [212269] = {
        name = "Шустря",
    },
    [212295] = {
        name = "Венбрандт",
    },
    [212450] = {
        name = "Андуин Ринн",
    },
    [212519] = {
        name = "Глашатай Бринте",
    },
    [212592] = {
        name = "Глашатай Бринте",
    },
    [212695] = {
        name = "Механик Киттрин",
    },
    [212700] = {
        name = "Хранительница пустоши Игрис",
    },
    [212708] = {
        name = "Служитель Фрейи Крутон",
    },
    [212741] = {
        name = "Глашатай Бринте",
    },
    [212742] = {
        name = "Мойра Тауриссан",
    },
    [212747] = {
        name = "Бэлгрим",
    },
    [212749] = {
        name = "Бэлгрим",
    },
    [212750] = {
        name = "Венбрандт",
    },
    [212756] = {
        name = "Бэлгрим",
    },
    [212829] = {
        name = "Леди Джайна Праудмур",
    },
    [212991] = {
        name = "Шустря",
    },
    [212992] = {
        name = "Глашатай Бринте",
    },
    [213107] = {
        name = "Ферин Лотар",
    },
    [213108] = {
        name = "Генерал Стилстрайк",
    },
    [213116] = {
        name = "Ферин Лотар",
    },
    [213120] = {
        name = "Андуин Ринн",
    },
    [213145] = {
        name = "Ауралия Стилстрайк",
    },
    [213152] = {
        name = "Шустря",
    },
    [213184] = {
        name = "Коргран",
    },
    [213187] = {
        name = "Уртаго",
    },
    [213569] = {
        name = "Глашатай Бринте",
    },
    [213612] = {
        name = "Магни Бронзобород",
    },
    [213613] = {
        name = "Эмира Актон",
    },
    [213614] = {
        name = "Тенар Стронгот",
    },
    [213620] = {
        name = "Тралл",
    },
    [213624] = {
        name = "Магни Бронзобород",
    },
    [213625] = {
        name = "Леди Джайна Праудмур",
    },
    [213627] = {
        name = "Верховный маг Кадгар",
    },
    [213634] = {
        name = "Дагран Тауриссан Второй",
    },
    [213687] = {
        name = "Уртаго",
    },
    [213688] = {
        name = "Уртаго",
    },
    [213691] = {
        name = "Хармот",
    },
    [213763] = {
        name = "Мойра Тауриссан",
    },
    [213787] = {
        name = "Герцог Велхан",
    },
    [213796] = {
        name = "Мойра Тауриссан",
    },
    [213840] = {
        name = "Хозяин таверны Бракс",
    },
    [213869] = {
        name = "Смотрительница Токи",
    },
    [213983] = {
        name = "Андуин Ринн",
    },
    [214019] = {
        name = "Эгор Айринбаунд",
    },
    [214076] = {
        name = "Счетля Углечелка",
    },
    [214168] = {
        name = "Счетля Углечелка",
    },
    [214271] = {
        name = "Генерал Стилстрайк",
    },
    [214273] = {
        name = "Андуин Ринн",
    },
    [214276] = {
        name = "Леди Джайна Праудмур",
    },
    [214296] = {
        name = "Ассистент режиссера Хуберта",
    },
    [214356] = {
        name = "Викс'арон",
    },
    [214359] = {
        name = "Киш'нал",
    },
    [214376] = {
        name = "Генерал Стилстрайк",
    },
    [214378] = {
        name = "Ферин",
    },
    [214380] = {
        name = "Раен Рыцарь Рассвета",
    },
    [214402] = {
        name = "Аллерия Ветрокрылая",
    },
    [214404] = {
        name = "Ферин Лотар",
    },
    [214405] = {
        name = "Аллерия Ветрокрылая",
    },
    [214413] = {
        name = "Ферин Лотар",
    },
    [214444] = {
        name = "Агарта",
    },
    [214651] = {
        name = "Мойра Тауриссан",
    },
    [214663] = {
        name = "Верховный глашатай Бринте",
    },
    [214665] = {
        name = "Верховный маг Дренден",
    },
    [214669] = {
        name = "Бранн Бронзобород",
    },
    [214890] = {
        name = "Телохранитель с Железной станции",
    },
    [214892] = {
        name = "Дагран Тауриссан Второй",
    },
    [214908] = {
        name = "Аллерия Ветрокрылая",
    },
    [214916] = {
        name = "Меррикс",
    },
    [214917] = {
        name = "Мойра Тауриссан",
    },
    [214919] = {
        name = "Тралл",
    },
    [214921] = {
        name = "Хармот",
    },
    [214922] = {
        name = "Собирательница Фарни",
    },
    [214995] = {
        name = "Ольбариг",
    },
    [215037] = {
        name = "Ветивериан",
    },
    [215039] = {
        name = "Наставница буреклювов Люфсела",
    },
    [215041] = {
        name = "Мираль Лапки-царапки",
    },
    [215113] = {
        name = "Орвейна",
    },
    [215187] = {
        name = "Воевода Гейя'ра",
    },
    [215201] = {
        name = "Агарта",
    },
    [215208] = {
        name = "Орсент",
    },
    [215209] = {
        name = "Мундерут",
    },
    [215211] = {
        name = "Курдран Громовой Молот",
    },
    [215234] = {
        name = "Фердагор",
    },
    [215237] = {
        name = "Ализа Боублейз",
    },
    [215254] = {
        name = "Ализа Боублейз",
    },
    [215277] = {
        name = "Адельгонн",
    },
    [215301] = {
        name = "Шинда Кридпайк",
    },
    [215306] = {
        name = "Эндири Блеск Рассвета",
    },
    [215327] = {
        name = "Агарта",
    },
    [215331] = {
        name = "Ферин Лотар",
    },
    [215335] = {
        name = "Генерал Стилстрайк",
    },
    [215341] = {
        name = "Великий Кайрон",
    },
    [215349] = {
        name = "Великий колдун Оходо",
    },
    [215413] = {
        name = "Монти Газлоу",
    },
    [215527] = {
        name = "Кейра Флеймстонж",
    },
    [215625] = {
        name = "Лилиан Восс",
    },
    [215626] = {
        name = "Лилиан Восс",
    },
    [215628] = {
        name = "Лилиан Восс",
    },
    [215637] = {
        name = "И'теки",
    },
    [215659] = {
        name = "И'теки",
    },
    [215661] = {
        name = "Лилиан Восс",
    },
    [215662] = {
        name = "Лилиан Восс",
    },
    [215672] = {
        name = "Шустря",
    },
    [215724] = {
        name = "Ней'лея",
    },
    [215737] = {
        name = "Нэбб",
    },
    [215744] = {
        name = "Буркхальт",
    },
    [215745] = {
        name = "Рабаан",
    },
    [215748] = {
        name = "Венделинн",
    },
    [215781] = {
        name = "Мойра Тауриссан",
    },
    [215788] = {
        name = "Беррунд Сияющий",
    },
    [215821] = {
        name = "Мойра Тауриссан",
    },
    [215822] = {
        name = "Беррунд Сияющий",
    },
    [215824] = {
        name = "Мойра Тауриссан",
    },
    [215836] = {
        name = "Беррунд Сияющий",
    },
    [215845] = {
        name = "Монти Газлоу",
    },
    [215944] = {
        name = "Орвейна",
    },
    [216001] = {
        name = "Софиетта Линфлейм",
    },
    [216025] = {
        name = "Беснующийся элементаль",
    },
    [216046] = {
        name = "Тка'ктат",
    },
    [216061] = {
        name = "Капитан Труфлэйм",
    },
    [216063] = {
        name = "Разведчик Уэйшельм",
    },
    [216085] = {
        name = "Мойра Тауриссан",
    },
    [216094] = {
        name = "Кодун",
    },
    [216149] = {
        name = "Мойра Тауриссан",
    },
    [216167] = {
        name = "Тралл",
    },
    [216168] = {
        name = "Леди Джайна Праудмур",
    },
    [216169] = {
        name = "Коргран",
    },
    [216173] = {
        name = "Уртаго",
    },
    [216213] = {
        name = "Веретенка",
    },
    [216311] = {
        name = "Клайв Дельгаджетс",
    },
    [216438] = {
        name = "Бабуля Каракуля",
    },
    [216479] = {
        name = "Магни Бронзобород",
    },
    [216480] = {
        name = "Дагран Тауриссан Второй",
    },
    [216566] = {
        name = "Ржаво-зеленый рыцарь",
    },
    [216567] = {
        name = "Халтурик",
    },
    [216568] = {
        name = "Бригадир Пачкуня",
    },
    [216628] = {
        name = "Бэлгрим",
    },
    [216878] = {
        name = "Уртаго",
    },
    [216994] = {
        name = "Дженни Громопряжка",
    },
    [216996] = {
        name = "Ревенз",
    },
    [217029] = {
        name = "Монти Газлоу",
    },
    [217069] = {
        name = "Меррикс",
    },
    [217072] = {
        name = "Бевруси",
    },
    [217091] = {
        name = "Вокгрет",
    },
    [217095] = {
        name = "Меррикс",
    },
    [217097] = {
        name = "Меррикс",
    },
    [217128] = {
        name = "Глашатай Кульдас",
    },
    [217131] = {
        name = "Бригадир Пачкуня",
    },
    [217133] = {
        name = "Кэл Смолдерброу",
    },
    [217152] = {
        name = "Носоморд",
    },
    [217245] = {
        name = "Верховный глашатай Бринте",
    },
    [217248] = {
        name = "Эльма",
    },
    [217255] = {
        name = "Аг'тракс",
    },
    [217330] = {
        name = "Ануб'азал",
    },
    [217331] = {
        name = "Дагран Тауриссан Второй",
    },
    [217355] = {
        name = "Класкин",
    },
    [217356] = {
        name = "Аракс'не",
    },
    [217385] = {
        name = "Аллерия Ветрокрылая",
    },
    [217386] = {
        name = "Андуин Ринн",
    },
    [217398] = {
        name = "Сестра Этна Блейз",
    },
    [217402] = {
        name = "Григг",
    },
    [217424] = {
        name = "Барон Сибаэстан Браунпайк",
    },
    [217426] = {
        name = "Сэр Телеон Браунпайк",
    },
    [217474] = {
        name = "Кельдаз",
    },
    [217565] = {
        name = "Ал'кубиан",
    },
    [217598] = {
        name = "Мойра Тауриссан",
    },
    [217609] = {
        name = "Барал Линфлейм",
    },
    [217640] = {
        name = "Альберт",
    },
    [217656] = {
        name = "Клубеньс",
    },
    [217659] = {
        name = "Таресса Солнечный Берег",
    },
    [217692] = {
        name = "Ар'син",
    },
    [217724] = {
        name = "Адолькусь",
    },
    [217763] = {
        name = "Рэннан Коррен",
    },
    [217766] = {
        name = "Бэлгрим",
    },
    [217828] = {
        name = "Рэннан Коррен",
    },
    [217849] = {
        name = "Адельгонн",
    },
    [217852] = {
        name = "Бэлгрим",
    },
    [217854] = {
        name = "Меррикс",
    },
    [217857] = {
        name = "Глашатай Бринте",
    },
    [217861] = {
        name = "Меррикс",
    },
    [217864] = {
        name = "Мойра Тауриссан",
    },
    [217878] = {
        name = "Мойра Тауриссан",
    },
    [217879] = {
        name = "Адельгонн",
    },
    [217880] = {
        name = "Меррикс",
    },
    [217881] = {
        name = "Бэлгрим",
    },
    [217887] = {
        name = "Мойра Тауриссан",
    },
    [217898] = {
        name = "Мойра Тауриссан",
    },
    [217904] = {
        name = "Меррикс",
    },
    [217961] = {
        name = "Хрека",
    },
    [217994] = {
        name = "Альберт",
    },
    [218062] = {
        name = "Ализа Боублейз",
    },
    [218171] = {
        name = "Шалба",
    },
    [218182] = {
        name = "Аллерия Ветрокрылая",
    },
    [218267] = {
        name = "Ферин Лотар",
    },
    [218290] = {
        name = "Бригадир Уджакс",
    },
    [218333] = {
        name = "Хранительница пустоши Игрис",
    },
    [218508] = {
        name = "Джозеф Брайвемарк",
    },
    [218535] = {
        name = "Гермира",
    },
    [218541] = {
        name = "Андуин Ринн",
    },
    [218714] = {
        name = "Мойра Тауриссан",
    },
    [218715] = {
        name = "Глашатай Бринте",
    },
    [218837] = {
        name = "Арфур",
    },
    [218864] = {
        name = "Гульхед",
    },
    [218866] = {
        name = "Уокмей",
    },
    [218878] = {
        name = "Марлин",
    },
    [219135] = {
        name = "Венрен Алталь",
    },
    [219173] = {
        name = "Венрен Алталь",
    },
    [219252] = {
        name = "Аллерия Ветрокрылая",
    },
    [219357] = {
        name = "Оратор Тикс'итик",
    },
    [219393] = {
        name = "Альдра",
    },
    [219394] = {
        name = "Миротворец Крагад",
    },
    [219400] = {
        name = "Меррикс",
    },
    [219430] = {
        name = "Странная рыба",
    },
    [219437] = {
        name = "Житель Дорногала",
    },
    [219452] = {
        name = "Магни Бронзобород",
    },
    [219475] = {
        name = "Сталежил",
    },
    [219674] = {
        name = "Халтурик",
    },
    [219784] = {
        name = "Батзвара",
    },
    [219885] = {
        name = "Андуин Ринн",
    },
    [219899] = {
        name = "Батзвара",
    },
    [220051] = {
        name = "Флинн Фэйрвинд",
    },
    [220124] = {
        name = "Ферин Лотар",
    },
    [220220] = {
        name = "Беррунд Сияющий",
    },
    [220406] = {
        name = "Ферин Лотар",
    },
    [220415] = {
        name = "Храндаз",
    },
    [220417] = {
        name = "Кагфрита",
    },
    [220446] = {
        name = "Скортуз",
    },
    [220595] = {
        name = "Орвейна",
    },
    [220597] = {
        name = "Бреннок",
    },
    [220600] = {
        name = "Хаимаз",
    },
    [220603] = {
        name = "Орвейна",
    },
    [220608] = {
        name = "Ханнан",
    },
    [220610] = {
        name = "Орвейна",
    },
    [220688] = {
        name = "Аллерия Ветрокрылая",
    },
    [220690] = {
        name = "Класкин",
    },
    [220718] = {
        name = "Мэра Ашильд",
    },
    [220784] = {
        name = "Батзвара",
    },
    [220928] = {
        name = "Верховный глашатай Бринте",
    },
    [221043] = {
        name = "Ноли Марлен",
    },
    [221092] = {
        name = "Оратор Тикс'итик",
    },
    [221093] = {
        name = "Оратор Тикс'итик",
    },
    [221100] = {
        name = "Ферин",
    },
    [221355] = {
        name = "Уртаго",
    },
    [221390] = {
        name = "Воскоделец Пик-пик",
    },
    [221492] = {
        name = "Рыцарь приората",
    },
    [221550] = {
        name = "Рен'хат",
    },
    [221557] = {
        name = "Верховная всесмотрительница Антурикс",
    },
    [221733] = {
        name = "Ферин Лотар",
    },
    [221842] = {
        name = "Алхимик Талбакс",
    },
    [221948] = {
        name = "Сум'лата",
    },
    [221961] = {
        name = "Ферин Лотар",
    },
    [221977] = {
        name = "Монти Газлоу",
    },
    [221980] = {
        name = "Аратийская мстительница",
    },
    [222132] = {
        name = "Тет",
    },
    [222136] = {
        name = "Тет",
    },
    [222224] = {
        name = "Миротворец Лейф",
    },
    [222234] = {
        name = "Скрит",
    },
    [222239] = {
        name = "Скрит",
    },
    [222268] = {
        name = "Миротворец Лейф",
    },
    [222314] = {
        name = "Миротворец Лейф",
    },
    [222352] = {
        name = "Фонарщик Кертер",
    },
    [222356] = {
        name = "Фонарщик Кертер",
    },
    [222358] = {
        name = "Миротворец Лейф",
    },
    [222360] = {
        name = "Фонарщик Кертер",
    },
    [222362] = {
        name = "Миротворец Лейф",
    },
    [222363] = {
        name = "Миротворец Лейф",
    },
    [222364] = {
        name = "Фонарщик Кертер",
    },
    [222555] = {
        name = "Бэлгрим",
    },
    [222683] = {
        name = "Хельмут Эгисакс",
    },
    [222790] = {
        name = "Гут'усул",
    },
    [222803] = {
        name = "Шустря",
    },
    [223000] = {
        name = "Кельдаз",
    },
    [223166] = {
        name = "Верховный маг Этас Похититель Солнца",
    },
    [223184] = {
        name = "Гарв Гайкосвист",
    },
    [223205] = {
        name = "Верховный экзарх Туралион",
    },
    [223267] = {
        name = "Ауралия Стилстрайк",
    },
    [223268] = {
        name = "Генерал Стилстрайк",
    },
    [223285] = {
        name = "Орвейна",
    },
    [223286] = {
        name = "Ханнан",
    },
    [223467] = {
        name = "Ферин Лотар",
    },
    [223637] = {
        name = "Наталия Пирс",
    },
    [223723] = {
        name = "Подсолнушек",
    },
    [223754] = {
        name = "Линни Свинцепалая",
    },
    [223759] = {
        name = "Синруна",
    },
    [223760] = {
        name = "Укос'вия",
    },
    [223875] = {
        name = "Ферин Лотар",
    },
    [223920] = {
        name = "Оррен Мэсин",
    },
    [223924] = {
        name = "Наталия Пирс",
    },
    [223944] = {
        name = "Аллерия Ветрокрылая",
    },
    [224154] = {
        name = "Генерал Стилстрайк",
    },
    [224310] = {
        name = "Великий Кайрон",
    },
    [224345] = {
        name = "Ануб'азал",
    },
    [224362] = {
        name = "Батзвара",
    },
    [224378] = {
        name = "Оррен Мэсин",
    },
    [224379] = {
        name = "Оррен Мэсин",
    },
    [224392] = {
        name = "Ольбариг",
    },
    [224394] = {
        name = "Хармот",
    },
    [224395] = {
        name = "Орвейна",
    },
    [224397] = {
        name = "Ханнан",
    },
    [224602] = {
        name = "Данаг",
    },
    [224618] = {
        name = "Механоступ Данага",
    },
    [224707] = {
        name = "Алвегар",
    },
    [224708] = {
        name = "Кендеррагг",
    },
    [224729] = {
        name = "Ануб'окки",
    },
    [224740] = {
        name = "Орвейна",
    },
    [224741] = {
        name = "Долена",
    },
    [224857] = {
        name = "Монти Газлоу",
    },
    [224866] = {
        name = "Орвейна",
    },
    [224874] = {
        name = "Монти Газлоу",
    },
    [224913] = {
        name = "Рензик Нож",
    },
    [224930] = {
        name = "Уртаго",
    },
    [224945] = {
        name = "Ферин Лотар",
    },
    [224946] = {
        name = "Великий Кайрон",
    },
    [224966] = {
        name = "Минди Макслоф",
    },
    [225188] = {
        name = "Генерал Стилстрайк",
    },
    [225426] = {
        name = "Саради",
    },
    [225451] = {
        name = "Дагран Тауриссан Второй",
    },
    [225453] = {
        name = "Дагран Тауриссан Второй",
    },
    [225454] = {
        name = "Миротворица Гектара",
    },
    [225472] = {
        name = "Дагран Тауриссан Второй",
    },
    [225478] = {
        name = "Глашатай Бринте",
    },
    [225481] = {
        name = "Слизныряльщица Каззандра",
    },
    [225500] = {
        name = "Гримла Выкрутень",
    },
    [225523] = {
        name = "Монти Газлоу",
    },
    [225533] = {
        name = "Теркан",
    },
    [225555] = {
        name = "Всячина",
    },
    [225570] = {
        name = "Монти Газлоу",
    },
    [225571] = {
        name = "Рензик Нож",
    },
    [225582] = {
        name = "Бригадир Дуинт",
    },
    [225583] = {
        name = "Механик Килтон",
    },
    [225587] = {
        name = "Монти Газлоу",
    },
    [225591] = {
        name = "Пэмзи",
    },
    [225596] = {
        name = "Орвейна",
    },
    [225597] = {
        name = "Монти Газлоу",
    },
    [225598] = {
        name = "Монти Газлоу",
    },
    [225599] = {
        name = "Рензик Нож",
    },
    [225608] = {
        name = "Проспера Зубцевизг",
    },
    [225616] = {
        name = "Когвин",
    },
    [225618] = {
        name = "Пэмзи",
    },
    [225624] = {
        name = "Синь Гогельмогель",
    },
    [225625] = {
        name = "Монти Газлоу",
    },
    [225635] = {
        name = "Монти Газлоу",
    },
    [225637] = {
        name = "Гримла Выкрутень",
    },
    [225638] = {
        name = "Гримла Выкрутень",
    },
    [225639] = {
        name = "Монти Газлоу",
    },
    [225645] = {
        name = "Монти Газлоу",
    },
    [225648] = {
        name = "Монти Газлоу",
    },
    [225659] = {
        name = "Орвейна",
    },
    [225669] = {
        name = "Аллерия Ветрокрылая",
    },
    [225686] = {
        name = "Барон Ревилгаз",
    },
    [225711] = {
        name = "Генерал Стилстрайк",
    },
    [225719] = {
        name = "Монти Газлоу",
    },
    [225730] = {
        name = "Монти Газлоу",
    },
    [225756] = {
        name = "Монти Газлоу",
    },
    [225757] = {
        name = "Монти Газлоу",
    },
    [225772] = {
        name = "Пэмзи",
    },
    [225847] = {
        name = "Бригадир Торговой компании",
    },
    [225857] = {
        name = "Лерренай Фэйн",
    },
    [225867] = {
        name = "Синь Гогельмогель",
    },
    [225868] = {
        name = "Барон Ревилгаз",
    },
    [225870] = {
        name = "Командир флота Морской Рог",
    },
    [225871] = {
        name = "Гримла Выкрутень",
    },
    [225873] = {
        name = "Орвейна",
    },
    [225876] = {
        name = "Гримла Выкрутень",
    },
    [225878] = {
        name = "Монти Газлоу",
    },
    [225879] = {
        name = "Дерилл Фэйн",
    },
    [225925] = {
        name = "Софиетта Линфлейм",
    },
    [225926] = {
        name = "Софиетта Линфлейм",
    },
    [226019] = {
        name = "Веретенка",
    },
    [226040] = {
        name = "Верховный глашатай Бринте",
    },
    [226255] = {
        name = "Луковка",
    },
    [226273] = {
        name = "Монти Газлоу",
    },
    [226277] = {
        name = "Марти Быстрогонц",
    },
    [226336] = {
        name = "Проспера Зубцевизг",
    },
    [226518] = {
        name = "Папаша Психх Крутируль",
    },
    [226522] = {
        name = "Нини Крутируль",
    },
    [226569] = {
        name = "Щелкс Маслописарь",
    },
    [226660] = {
        name = "Дирк Мехосделкинс",
    },
    [226672] = {
        name = "Орвейна",
    },
    [226703] = {
        name = "Щелкс Маслописарь",
    },
    [226710] = {
        name = "Уличная крыса",
    },
    [226728] = {
        name = "Хамфри Краткоглот",
    },
    [226750] = {
        name = "Служительница Фрейи Эттерка",
    },
    [226791] = {
        name = "Тюремщица Аметистовой крепости",
    },
    [226792] = {
        name = "Заводчик Эдидифет",
    },
    [226841] = {
        name = "Глашатай Бринте",
    },
    [226846] = {
        name = "Капитан Оатмит",
    },
    [226894] = {
        name = "Марти Быстрогонц",
    },
    [226899] = {
        name = "Канцлер Гноми",
    },
    [226932] = {
        name = "Марти Быстрогонц",
    },
    [226934] = {
        name = "Джоджо Гобдри",
    },
    [227018] = {
        name = "Марти Быстрогонц",
    },
    [227032] = {
        name = "Марти Быстрогонц",
    },
    [227158] = {
        name = "Ханнан",
    },
    [227217] = {
        name = "Паутинник",
    },
    [227222] = {
        name = "Изабель Глимгаард",
    },
    [227224] = {
        name = "Гоэхи",
    },
    [227436] = {
        name = "Верховный маг Кадгар",
    },
    [227477] = {
        name = "Бранн Бронзобород",
    },
    [227499] = {
        name = "Орвейна",
    },
    [227523] = {
        name = "Бранн Бронзобород",
    },
    [227531] = {
        name = "Монти Газлоу",
    },
    [227544] = {
        name = "Бранн Бронзобород",
    },
    [227691] = {
        name = "Орвейна",
    },
    [227758] = {
        name = "Аллерия Ветрокрылая",
    },
    [227937] = {
        name = "Рензик Нож",
    },
    [228017] = {
        name = "Зирдо",
    },
    [228074] = {
        name = "Ангорла",
    },
    [228132] = {
        name = "Рензик Нож",
    },
    [228158] = {
        name = "Башкорванкис",
    },
    [228214] = {
        name = "Пэмзи",
    },
    [228286] = {
        name = "Счетля Углечелка",
    },
    [228333] = {
        name = "Счетля Углечелка",
    },
    [228341] = {
        name = "Счетля Углечелка",
    },
    [228369] = {
        name = "Марти Быстрогонц",
    },
    [228393] = {
        name = "Брукси Хитрокрюк",
    },
    [228420] = {
        name = "Тарбонара Выкрутень",
    },
    [228473] = {
        name = "Великолепный Дейви",
    },
    [228474] = {
        name = "Кейджей",
    },
    [228566] = {
        name = "Джазз Моккиц",
    },
    [228857] = {
        name = "Мамаша Кеара",
    },
    [228860] = {
        name = "Болтушка Габи",
    },
    [228894] = {
        name = "Орвейна",
    },
    [229223] = {
        name = "Монти Газлоу",
    },
    [229233] = {
        name = "Монти Газлоу",
    },
    [229235] = {
        name = "Монти Газлоу",
    },
    [229236] = {
        name = "Монти Газлоу",
    },
    [229242] = {
        name = "Рензик Нож",
    },
    [229243] = {
        name = "Рензик Нож",
    },
    [229246] = {
        name = "Гримла Выкрутень",
    },
    [229261] = {
        name = "Монти Газлоу",
    },
    [229940] = {
        name = "Полковник Вероника Ниалс",
    },
    [230145] = {
        name = "Эйтригг",
    },
    [230151] = {
        name = "Воевода Гейя'ра",
    },
    [230154] = {
        name = "Данат Троллебой",
    },
    [230159] = {
        name = "Ом'феннад",
    },
    [230174] = {
        name = "Уокер Грешэм",
    },
    [230233] = {
        name = "Шахата",
    },
    [230235] = {
        name = "Скеггит",
    },
    [230238] = {
        name = "Скеггит",
    },
    [230242] = {
        name = "Барг",
    },
    [230246] = {
        name = "Хранитель истории Чо",
    },
    [230268] = {
        name = "Монти Газлоу",
    },
    [230271] = {
        name = "Барг",
    },
    [230288] = {
        name = "Странник",
    },
    [230294] = {
        name = "Ом'реш",
    },
    [230554] = {
        name = "Старик Лоу",
    },
    [230555] = {
        name = "Питц Лоу",
    },
    [230602] = {
        name = "Ксал'атат",
    },
    [230604] = {
        name = "Ом'ен",
    },
    [230634] = {
        name = "Ксал'атат",
    },
    [230658] = {
        name = "Ксал'атат",
    },
    [230700] = {
        name = "Странник",
    },
    [230736] = {
        name = "Ом'талад",
    },
    [230738] = {
        name = "Ксал'атат",
    },
    [230739] = {
        name = "Переписчица душ",
    },
    [230786] = {
        name = "Переписчица душ",
    },
    [230789] = {
        name = "Шахата",
    },
    [230806] = {
        name = "Странник",
    },
    [230811] = {
        name = "Странник",
    },
    [230814] = {
        name = "Ве'нари",
    },
    [230815] = {
        name = "Ферин Лотар",
    },
    [230817] = {
        name = "Аллерия Ветрокрылая",
    },
    [230818] = {
        name = "Переписчица душ",
    },
    [230825] = {
        name = "Ксал'атат",
    },
    [230841] = {
        name = "Ржаво-зеленый рыцарь",
    },
    [230954] = {
        name = "Та'ка",
    },
    [230955] = {
        name = "Ба'вер",
    },
    [231030] = {
        name = "Аратор",
    },
    [231128] = {
        name = "Странник",
    },
    [231140] = {
        name = "Барг",
    },
    [231143] = {
        name = "Барг",
    },
    [231162] = {
        name = "Дрирудж",
    },
    [231266] = {
        name = "Аратор",
    },
    [231314] = {
        name = "Ом'далан",
    },
    [231422] = {
        name = "Изгой Хизфран",
    },
    [231443] = {
        name = "Переписчица душ",
    },
    [231445] = {
        name = "Ксал'атат",
    },
    [231486] = {
        name = "Переписчица душ",
    },
    [231487] = {
        name = "Странник",
    },
    [231488] = {
        name = "Аллерия Ветрокрылая",
    },
    [231492] = {
        name = "Странник",
    },
    [231505] = {
        name = "Аллерия Ветрокрылая",
    },
    [231517] = {
        name = "Питц Лоу",
    },
    [231520] = {
        name = "Ксал'атат",
    },
    [231522] = {
        name = "Аллерия Ветрокрылая",
    },
    [231564] = {
        name = "Зи'бин",
    },
    [231674] = {
        name = "Смотритель хранилища Зи'вез",
    },
    [231699] = {
        name = "Изгой Хизфран",
    },
    [231748] = {
        name = "Мэгги Уилтшир",
    },
    [231764] = {
        name = "Ферин Лотар",
    },
    [231768] = {
        name = "Воевода Гейя'ра",
    },
    [231770] = {
        name = "Эйтригг",
    },
    [231771] = {
        name = "Ферин Лотар",
    },
    [231803] = {
        name = "Воевода Гейя'ра",
    },
    [231812] = {
        name = "Марти Быстрогонц",
    },
    [231820] = {
        name = "Ве'нари",
    },
    [231826] = {
        name = "Эйтригг",
    },
    [231828] = {
        name = "Ферин Лотар",
    },
    [231829] = {
        name = "Воевода Гейя'ра",
    },
    [231832] = {
        name = "Эйтригг",
    },
    [231833] = {
        name = "Воевода Гейя'ра",
    },
    [231837] = {
        name = "Ферин Лотар",
    },
    [231919] = {
        name = "Ботаник Аленра",
    },
    [232005] = {
        name = "Канцлер Гноми",
    },
    [232008] = {
        name = "Босс картеля Зи'эолм",
    },
    [232057] = {
        name = "Смотритель хранилища Зи'вез",
    },
    [232132] = {
        name = "Заря",
    },
    [232180] = {
        name = "Старик Лоу",
    },
    [232351] = {
        name = "Торговец Ба'крил",
    },
    [232385] = {
        name = "Ботаник Аленра",
    },
    [232491] = {
        name = "Пэмзи",
    },
    [232498] = {
        name = "Помощник Зи'нелл",
    },
    [232642] = {
        name = "Эльфийка Бездны – странница разломов",
    },
    [232660] = {
        name = "Эльфийка Бездны – лучница",
    },
    [232822] = {
        name = "Монти Газлоу",
    },
    [232823] = {
        name = "Марти Быстрогонц",
    },
    [232986] = {
        name = "Данат Троллебой",
    },
    [233235] = {
        name = "Герри Крякосор",
    },
    [233296] = {
        name = "Командир флота Морской Рог",
    },
    [233390] = {
        name = "Пэмзи",
    },
    [233420] = {
        name = "Бенни Гусьракетс",
    },
    [233482] = {
        name = "Монти Газлоу",
    },
    [233500] = {
        name = "Ом'таха",
    },
    [233501] = {
        name = "Барг",
    },
    [233603] = {
        name = "Странник",
    },
    [233706] = {
        name = "Странник",
    },
    [233878] = {
        name = "Ксал'атат",
    },
    [233946] = {
        name = "Ксал'атат",
    },
    [234048] = {
        name = "Монти Газлоу",
    },
    [234106] = {
        name = "Странник",
    },
    [234190] = {
        name = "Нарате",
    },
    [234216] = {
        name = "Младший инженер Ом'век",
    },
    [234272] = {
        name = "Ревенз",
    },
    [234293] = {
        name = "Дубошов",
    },
    [234294] = {
        name = "Трикси Болтокрутц",
    },
    [234316] = {
        name = "Ревенз",
    },
    [234483] = {
        name = "Помощница Консорциума",
    },
    [234551] = {
        name = "Монти Газлоу",
    },
    [234596] = {
        name = "Странник",
    },
    [234601] = {
        name = "Ом'ен",
    },
    [234602] = {
        name = "Аллерия Ветрокрылая",
    },
    [234620] = {
        name = "Странник",
    },
    [234662] = {
        name = "Данат Троллебой",
    },
    [234728] = {
        name = "Орвейна",
    },
    [234745] = {
        name = "Хеминг Эрнестуэй",
    },
    [234783] = {
        name = "Мастер Матиас Шоу",
    },
    [234801] = {
        name = "Монти Газлоу",
    },
    [235041] = {
        name = "Капитан Родерик Брюстон",
    },
    [235238] = {
        name = "Монти Газлоу",
    },
    [235290] = {
        name = "Хеминг Эрнестуэй",
    },
    [235353] = {
        name = "Хеминг Эрнестуэй",
    },
    [235849] = {
        name = "Костолом картеля Черноводья",
    },
    [235860] = {
        name = "Изобретатель чумы Марилет",
    },
    [236815] = {
        name = "Карга Кровавое Безумие",
    },
    [236846] = {
        name = "Хеминг Эрнестуэй",
    },
    [236890] = {
        name = "Хеминг Эрнестуэй",
    },
    [236907] = {
        name = "Адар Вспышка Сумерек",
    },
    [237705] = {
        name = "Ксал'атат",
    },
    [238006] = {
        name = "Синь Гогельмогель",
    },
    [238012] = {
        name = "Капитан Родерик Брюстон",
    },
    [238209] = {
        name = "Смотритель из картеля Ом",
    },
    [238212] = {
        name = "Ом'талад",
    },
    [240842] = {
        name = "Леона Тенеброд",
    },
    [241588] = {
        name = "Хашим",
    },
    [241601] = {
        name = "Шад'анис",
    },
    [241624] = {
        name = "Шад'анис",
    },
    [242179] = {
        name = "Адар Вспышка Сумерек",
    },
    [242538] = {
        name = "Ве'нари",
    },
    [246601] = {
        name = "Исследовательница Эссарея",
    },
    [246608] = {
        name = "Межфазовый шаркун",
    },
    [248153] = {
        name = "Магистр Умбрий",
    },
    [250839] = {
        name = "Оруженосец из ордена Серебряной Длани",
    },
})
]])()
