----- AUTO GENERATED - DO NOT EDIT

if GetLocale() ~= "zhTW" then
    return
end

loadstring([[
BtWQuestsDatabase:UpdateNPCsTable({
    [20448] = {
        name = "指揮官阿密爾",
    },
    [20482] = {
        name = "指揮官阿密爾的影像",
    },
    [20907] = {
        name = "戴比瑞教授",
    },
    [27314] = {
        name = "『遠識』齊利格",
    },
    [130133] = {
        name = "莉雅德倫女士",
    },
    [145005] = {
        name = "遠行者精英",
    },
    [145015] = {
        name = "洛瑟玛·塞隆",
    },
    [145793] = {
        name = "莉雅德倫女士",
    },
    [156688] = {
        name = "旅店之主塔瑞拉",
    },
    [162804] = {
        name = "維娜里",
    },
    [178792] = {
        name = "塔梅利",
    },
    [206528] = {
        name = "阿里雅‧西爾海姆",
    },
    [207471] = {
        name = "寡婦阿拉克娜依",
    },
    [208782] = {
        name = "執行官尼茲瑞克",
    },
    [209918] = {
        name = "牧人長史坦斯博",
    },
    [211351] = {
        name = "安杜因‧烏瑞恩",
    },
    [211399] = {
        name = "蒙特‧加茲魯維",
    },
    [211409] = {
        name = "法林‧洛薩",
    },
    [211444] = {
        name = "弗林‧晴風",
    },
    [211499] = {
        name = "執行官尼茲瑞克",
    },
    [211652] = {
        name = "綠語者納雷洛",
    },
    [211699] = {
        name = "法林",
    },
    [211721] = {
        name = "強納森‧真心爵士",
    },
    [211740] = {
        name = "禿鼻鴉照護員蘆瑟菈",
    },
    [211752] = {
        name = "艾蘭里亞‧風行者",
    },
    [211859] = {
        name = "貝格姆",
    },
    [211993] = {
        name = "索爾",
    },
    [211994] = {
        name = "珍娜‧普勞德摩爾女士",
    },
    [212076] = {
        name = "鐵擊將軍",
    },
    [212269] = {
        name = "史琦德",
    },
    [212295] = {
        name = "溫布蘭特",
    },
    [212450] = {
        name = "安杜因‧烏瑞恩",
    },
    [212519] = {
        name = "代言者布琳瑟",
    },
    [212592] = {
        name = "代言者布琳瑟",
    },
    [212695] = {
        name = "機械工基特林",
    },
    [212700] = {
        name = "林野看管者伊格莉絲",
    },
    [212708] = {
        name = "芙蕾雅志士克魯頓",
    },
    [212741] = {
        name = "代言者布琳瑟",
    },
    [212742] = {
        name = "茉艾拉‧索瑞森",
    },
    [212747] = {
        name = "貝格姆",
    },
    [212749] = {
        name = "貝格姆",
    },
    [212750] = {
        name = "溫布蘭特",
    },
    [212756] = {
        name = "貝格姆",
    },
    [212829] = {
        name = "珍娜‧普勞德摩爾女士",
    },
    [212991] = {
        name = "史琦德",
    },
    [212992] = {
        name = "代言者布琳瑟",
    },
    [213107] = {
        name = "法林‧洛薩",
    },
    [213108] = {
        name = "鐵擊將軍",
    },
    [213116] = {
        name = "法林‧洛薩",
    },
    [213120] = {
        name = "安杜因‧烏瑞恩",
    },
    [213145] = {
        name = "奧拉麗亞‧鐵擊",
    },
    [213152] = {
        name = "史琦德",
    },
    [213184] = {
        name = "科格蘭",
    },
    [213187] = {
        name = "烏塔戈",
    },
    [213569] = {
        name = "代言者布琳瑟",
    },
    [213612] = {
        name = "麥格尼‧銅鬚",
    },
    [213613] = {
        name = "愛米拉‧阿克頓",
    },
    [213614] = {
        name = "塔納‧斯壯格斯",
    },
    [213620] = {
        name = "索爾",
    },
    [213624] = {
        name = "麥格尼‧銅鬚",
    },
    [213625] = {
        name = "珍娜‧普勞德摩爾女士",
    },
    [213627] = {
        name = "大法師卡德加",
    },
    [213634] = {
        name = "達格蘭‧索瑞森二世",
    },
    [213687] = {
        name = "烏塔戈",
    },
    [213688] = {
        name = "烏塔戈",
    },
    [213691] = {
        name = "哈莫特",
    },
    [213763] = {
        name = "茉艾拉‧索瑞森",
    },
    [213787] = {
        name = "瓦爾罕公爵",
    },
    [213796] = {
        name = "茉艾拉‧索瑞森",
    },
    [213840] = {
        name = "旅店老闆布拉克斯",
    },
    [213869] = {
        name = "看守者托奇",
    },
    [213983] = {
        name = "安杜因‧烏瑞恩",
    },
    [214019] = {
        name = "艾格‧伊里邦德",
    },
    [214076] = {
        name = "絲凱吉‧燼砰",
    },
    [214168] = {
        name = "絲凱吉‧燼砰",
    },
    [214271] = {
        name = "鐵擊將軍",
    },
    [214273] = {
        name = "安杜因‧烏瑞恩",
    },
    [214276] = {
        name = "珍娜‧普勞德摩爾女士",
    },
    [214296] = {
        name = "舞台經理胡蓓塔",
    },
    [214356] = {
        name = "菲克薩倫",
    },
    [214359] = {
        name = "基什奈爾",
    },
    [214376] = {
        name = "鐵擊將軍",
    },
    [214378] = {
        name = "法林",
    },
    [214380] = {
        name = "瑞恩‧唐卡瓦莉爾",
    },
    [214402] = {
        name = "艾蘭里亞‧風行者",
    },
    [214404] = {
        name = "法林‧洛薩",
    },
    [214405] = {
        name = "艾蘭里亞‧風行者",
    },
    [214413] = {
        name = "法林‧洛薩",
    },
    [214444] = {
        name = "阿嘉莎",
    },
    [214651] = {
        name = "茉艾拉‧索瑞森",
    },
    [214663] = {
        name = "至高代言者布琳瑟",
    },
    [214665] = {
        name = "大法師德蘭丹",
    },
    [214669] = {
        name = "布萊恩‧銅鬚",
    },
    [214890] = {
        name = "曳鐵保鏢",
    },
    [214892] = {
        name = "達格蘭‧索瑞森二世",
    },
    [214908] = {
        name = "艾蘭里亞‧風行者",
    },
    [214916] = {
        name = "梅里斯",
    },
    [214917] = {
        name = "茉艾拉‧索瑞森",
    },
    [214919] = {
        name = "索爾",
    },
    [214921] = {
        name = "哈莫特",
    },
    [214922] = {
        name = "收割者法妮",
    },
    [214995] = {
        name = "奧巴里格",
    },
    [215037] = {
        name = "維特法里安",
    },
    [215039] = {
        name = "禿鼻鴉照護員蘆瑟菈",
    },
    [215041] = {
        name = "毛毛手殺人魔咪洛",
    },
    [215113] = {
        name = "歐薇娜",
    },
    [215187] = {
        name = "嘉亞拉霸主",
    },
    [215201] = {
        name = "阿嘉莎",
    },
    [215208] = {
        name = "歐仙絲",
    },
    [215209] = {
        name = "穆德魯特",
    },
    [215211] = {
        name = "庫德蘭‧蠻錘",
    },
    [215234] = {
        name = "法達高爾",
    },
    [215237] = {
        name = "艾莉莎‧弓焰",
    },
    [215254] = {
        name = "艾莉莎‧弓焰",
    },
    [215277] = {
        name = "阿德貢",
    },
    [215301] = {
        name = "辛達‧庫里派克",
    },
    [215306] = {
        name = "安德里‧晨湧",
    },
    [215327] = {
        name = "阿嘉莎",
    },
    [215331] = {
        name = "法林‧洛薩",
    },
    [215335] = {
        name = "鐵擊將軍",
    },
    [215341] = {
        name = "偉大的凱隆",
    },
    [215349] = {
        name = "大妖術師歐胡多",
    },
    [215413] = {
        name = "蒙特‧加茲魯維",
    },
    [215527] = {
        name = "琪菈‧弗蘭斯壯",
    },
    [215625] = {
        name = "莉莉安‧佛斯",
    },
    [215626] = {
        name = "莉莉安‧佛斯",
    },
    [215628] = {
        name = "莉莉安‧佛斯",
    },
    [215637] = {
        name = "伊特希",
    },
    [215659] = {
        name = "伊特希",
    },
    [215661] = {
        name = "莉莉安‧佛斯",
    },
    [215662] = {
        name = "莉莉安‧佛斯",
    },
    [215672] = {
        name = "史琦德",
    },
    [215724] = {
        name = "奈蕾亞",
    },
    [215737] = {
        name = "涅博",
    },
    [215744] = {
        name = "伯克哈特",
    },
    [215745] = {
        name = "拉巴安",
    },
    [215748] = {
        name = "溫蒂琳",
    },
    [215781] = {
        name = "茉艾拉‧索瑞森",
    },
    [215788] = {
        name = "『爍光者』貝魯德",
    },
    [215821] = {
        name = "茉艾拉‧索瑞森",
    },
    [215822] = {
        name = "『爍光者』貝魯德",
    },
    [215824] = {
        name = "茉艾拉‧索瑞森",
    },
    [215836] = {
        name = "『爍光者』貝魯德",
    },
    [215845] = {
        name = "蒙特‧加茲魯維",
    },
    [215944] = {
        name = "歐薇娜",
    },
    [216001] = {
        name = "蘇菲塔‧林弗雷",
    },
    [216025] = {
        name = "狂暴元素",
    },
    [216046] = {
        name = "帝卡塔",
    },
    [216061] = {
        name = "真炎隊長",
    },
    [216063] = {
        name = "偵察兵維夏姆",
    },
    [216085] = {
        name = "茉艾拉‧索瑞森",
    },
    [216094] = {
        name = "寇敦",
    },
    [216149] = {
        name = "茉艾拉‧索瑞森",
    },
    [216167] = {
        name = "索爾",
    },
    [216168] = {
        name = "珍娜‧普勞德摩爾女士",
    },
    [216169] = {
        name = "科格蘭",
    },
    [216173] = {
        name = "烏塔戈",
    },
    [216213] = {
        name = "阿軸",
    },
    [216311] = {
        name = "克萊夫‧德基茲墨",
    },
    [216438] = {
        name = "小塗奶奶",
    },
    [216479] = {
        name = "麥格尼‧銅鬚",
    },
    [216480] = {
        name = "達格蘭‧索瑞森二世",
    },
    [216566] = {
        name = "綠油騎士",
    },
    [216567] = {
        name = "破破",
    },
    [216568] = {
        name = "「公頭」格里姆斯",
    },
    [216628] = {
        name = "貝格姆",
    },
    [216878] = {
        name = "烏塔戈",
    },
    [216994] = {
        name = "珍妮‧轟扣",
    },
    [216996] = {
        name = "魯巴恩",
    },
    [217029] = {
        name = "蒙特‧加茲魯維",
    },
    [217069] = {
        name = "梅里斯",
    },
    [217072] = {
        name = "蓓芙露西",
    },
    [217091] = {
        name = "佛葛蕾",
    },
    [217095] = {
        name = "梅里斯",
    },
    [217097] = {
        name = "梅里斯",
    },
    [217128] = {
        name = "代言者庫達斯",
    },
    [217131] = {
        name = "「公頭」格里姆斯",
    },
    [217133] = {
        name = "卡爾‧悶眉",
    },
    [217152] = {
        name = "史努喬",
    },
    [217245] = {
        name = "至高代言者布琳瑟",
    },
    [217248] = {
        name = "艾兒瑪",
    },
    [217255] = {
        name = "亞格薩斯",
    },
    [217330] = {
        name = "阿努巴札爾",
    },
    [217331] = {
        name = "達格蘭‧索瑞森二世",
    },
    [217355] = {
        name = "克拉斯金",
    },
    [217356] = {
        name = "阿拉希妮",
    },
    [217385] = {
        name = "艾蘭里亞‧風行者",
    },
    [217386] = {
        name = "安杜因‧烏瑞恩",
    },
    [217398] = {
        name = "伊特娜‧布雷茲修女",
    },
    [217402] = {
        name = "葛里格",
    },
    [217424] = {
        name = "賽巴斯坦‧布朗派克男爵",
    },
    [217426] = {
        name = "席利昂‧布朗派克爵士",
    },
    [217474] = {
        name = "克妲茨",
    },
    [217565] = {
        name = "阿爾庫比恩",
    },
    [217598] = {
        name = "茉艾拉‧索瑞森",
    },
    [217609] = {
        name = "巴羅‧林弗雷",
    },
    [217640] = {
        name = "艾柏特",
    },
    [217656] = {
        name = "圖貝洛斯",
    },
    [217659] = {
        name = "瑟瑞莎‧日灘",
    },
    [217692] = {
        name = "艾辛",
    },
    [217724] = {
        name = "幼幼咬嚼螈",
    },
    [217763] = {
        name = "瑞南‧寇倫",
    },
    [217766] = {
        name = "貝格姆",
    },
    [217828] = {
        name = "瑞南‧寇倫",
    },
    [217849] = {
        name = "阿德貢",
    },
    [217852] = {
        name = "貝格姆",
    },
    [217854] = {
        name = "梅里斯",
    },
    [217857] = {
        name = "代言者布琳瑟",
    },
    [217861] = {
        name = "梅里斯",
    },
    [217864] = {
        name = "茉艾拉‧索瑞森",
    },
    [217878] = {
        name = "茉艾拉‧索瑞森",
    },
    [217879] = {
        name = "阿德貢",
    },
    [217880] = {
        name = "梅里斯",
    },
    [217881] = {
        name = "貝格姆",
    },
    [217887] = {
        name = "茉艾拉‧索瑞森",
    },
    [217898] = {
        name = "茉艾拉‧索瑞森",
    },
    [217904] = {
        name = "梅里斯",
    },
    [217961] = {
        name = "蕾卡",
    },
    [217994] = {
        name = "艾柏特",
    },
    [218062] = {
        name = "艾莉莎‧弓焰",
    },
    [218171] = {
        name = "沙爾巴",
    },
    [218182] = {
        name = "艾蘭里亞‧風行者",
    },
    [218267] = {
        name = "法林‧洛薩",
    },
    [218290] = {
        name = "工頭烏茲傑克斯",
    },
    [218333] = {
        name = "林野看管者伊格莉絲",
    },
    [218508] = {
        name = "喬瑟夫‧布雷馬克",
    },
    [218535] = {
        name = "葛米菈",
    },
    [218541] = {
        name = "安杜因‧烏瑞恩",
    },
    [218714] = {
        name = "茉艾拉‧索瑞森",
    },
    [218715] = {
        name = "代言者布琳瑟",
    },
    [218837] = {
        name = "亞佛",
    },
    [218864] = {
        name = "加爾漢",
    },
    [218866] = {
        name = "沃克梅",
    },
    [218878] = {
        name = "馬林",
    },
    [219135] = {
        name = "文倫‧阿薩爾",
    },
    [219173] = {
        name = "文倫‧阿薩爾",
    },
    [219252] = {
        name = "艾蘭里亞‧風行者",
    },
    [219357] = {
        name = "演說家特錫特克",
    },
    [219393] = {
        name = "亞卓",
    },
    [219394] = {
        name = "保安官克拉加",
    },
    [219400] = {
        name = "梅里斯",
    },
    [219430] = {
        name = "怪魚",
    },
    [219437] = {
        name = "多恩諾加平民",
    },
    [219452] = {
        name = "麥格尼‧銅鬚",
    },
    [219475] = {
        name = "鐵脈",
    },
    [219674] = {
        name = "破破",
    },
    [219784] = {
        name = "芭姿瓦菈",
    },
    [219885] = {
        name = "安杜因‧烏瑞恩",
    },
    [219899] = {
        name = "芭姿瓦菈",
    },
    [220051] = {
        name = "弗林‧晴風",
    },
    [220124] = {
        name = "法林‧洛薩",
    },
    [220220] = {
        name = "『爍光者』貝魯德",
    },
    [220406] = {
        name = "法林‧洛薩",
    },
    [220415] = {
        name = "蘭達斯",
    },
    [220417] = {
        name = "克弗利薩",
    },
    [220446] = {
        name = "斯庫索茲",
    },
    [220595] = {
        name = "歐薇娜",
    },
    [220597] = {
        name = "布倫諾克",
    },
    [220600] = {
        name = "海梅茲",
    },
    [220603] = {
        name = "歐薇娜",
    },
    [220608] = {
        name = "哈南",
    },
    [220610] = {
        name = "歐薇娜",
    },
    [220688] = {
        name = "艾蘭里亞‧風行者",
    },
    [220690] = {
        name = "克拉斯金",
    },
    [220718] = {
        name = "梅拉‧艾許德",
    },
    [220784] = {
        name = "芭姿瓦菈",
    },
    [220928] = {
        name = "至高代言者布琳瑟",
    },
    [221043] = {
        name = "寇莉‧馬琳",
    },
    [221092] = {
        name = "演說家特錫特克",
    },
    [221093] = {
        name = "演說家特錫特克",
    },
    [221100] = {
        name = "法林",
    },
    [221355] = {
        name = "烏塔戈",
    },
    [221390] = {
        name = "蠟販史奇克",
    },
    [221492] = {
        name = "隱修院騎士",
    },
    [221550] = {
        name = "雷恩卡特",
    },
    [221557] = {
        name = "大紡織者安托芮克絲",
    },
    [221733] = {
        name = "法林‧洛薩",
    },
    [221842] = {
        name = "鍊金師塔爾貝克斯",
    },
    [221948] = {
        name = "桑姆拉薩",
    },
    [221961] = {
        name = "法林‧洛薩",
    },
    [221977] = {
        name = "蒙特‧加茲魯維",
    },
    [221980] = {
        name = "阿拉希復仇者",
    },
    [222132] = {
        name = "忒絲",
    },
    [222136] = {
        name = "忒絲",
    },
    [222224] = {
        name = "保安官列夫",
    },
    [222234] = {
        name = "史奎特",
    },
    [222239] = {
        name = "史奎特",
    },
    [222268] = {
        name = "保安官列夫",
    },
    [222314] = {
        name = "保安官列夫",
    },
    [222352] = {
        name = "燈火者克爾特",
    },
    [222356] = {
        name = "燈火者克爾特",
    },
    [222358] = {
        name = "保安官列夫",
    },
    [222360] = {
        name = "燈火者克爾特",
    },
    [222362] = {
        name = "保安官列夫",
    },
    [222363] = {
        name = "保安官列夫",
    },
    [222364] = {
        name = "燈火者克爾特",
    },
    [222555] = {
        name = "貝格姆",
    },
    [222683] = {
        name = "海姆特‧禦斧",
    },
    [222790] = {
        name = "古烏蘇",
    },
    [222803] = {
        name = "史琦德",
    },
    [223000] = {
        name = "克妲茨",
    },
    [223166] = {
        name = "大法師埃薩‧奪日者",
    },
    [223184] = {
        name = "加夫‧輪哨",
    },
    [223205] = {
        name = "大主教圖拉揚",
    },
    [223267] = {
        name = "奧拉麗亞‧鐵擊",
    },
    [223268] = {
        name = "鐵擊將軍",
    },
    [223285] = {
        name = "歐薇娜",
    },
    [223286] = {
        name = "哈南",
    },
    [223467] = {
        name = "法林‧洛薩",
    },
    [223637] = {
        name = "娜塔莉‧珀斯",
    },
    [223723] = {
        name = "向日葵先生",
    },
    [223754] = {
        name = "琳妮‧引指",
    },
    [223759] = {
        name = "辛魯納",
    },
    [223760] = {
        name = "烏寇維亞",
    },
    [223875] = {
        name = "法林‧洛薩",
    },
    [223920] = {
        name = "歐倫‧梅辛",
    },
    [223924] = {
        name = "娜塔莉‧珀斯",
    },
    [223944] = {
        name = "艾蘭里亞‧風行者",
    },
    [224154] = {
        name = "鐵擊將軍",
    },
    [224310] = {
        name = "偉大的凱隆",
    },
    [224345] = {
        name = "阿努巴札爾",
    },
    [224362] = {
        name = "芭姿瓦菈",
    },
    [224378] = {
        name = "歐倫‧梅辛",
    },
    [224379] = {
        name = "歐倫‧梅辛",
    },
    [224392] = {
        name = "奧巴里格",
    },
    [224394] = {
        name = "哈莫特",
    },
    [224395] = {
        name = "歐薇娜",
    },
    [224397] = {
        name = "哈南",
    },
    [224602] = {
        name = "達那格",
    },
    [224618] = {
        name = "達那格的齒輪行者",
    },
    [224707] = {
        name = "雅維嘉",
    },
    [224708] = {
        name = "仙德拉格",
    },
    [224729] = {
        name = "阿努柏基",
    },
    [224740] = {
        name = "歐薇娜",
    },
    [224741] = {
        name = "多蕾娜",
    },
    [224857] = {
        name = "蒙特‧加茲魯維",
    },
    [224866] = {
        name = "歐薇娜",
    },
    [224874] = {
        name = "蒙特‧加茲魯維",
    },
    [224913] = {
        name = "『剃刃』雷吉克",
    },
    [224930] = {
        name = "烏塔戈",
    },
    [224945] = {
        name = "法林‧洛薩",
    },
    [224946] = {
        name = "偉大的凱隆",
    },
    [224966] = {
        name = "敏蒂‧麥克洛夫",
    },
    [225188] = {
        name = "鐵擊將軍",
    },
    [225426] = {
        name = "莎拉蒂",
    },
    [225451] = {
        name = "達格蘭‧索瑞森二世",
    },
    [225453] = {
        name = "達格蘭‧索瑞森二世",
    },
    [225454] = {
        name = "保安官赫卡特",
    },
    [225472] = {
        name = "達格蘭‧索瑞森二世",
    },
    [225478] = {
        name = "代言者布琳瑟",
    },
    [225481] = {
        name = "潛泥員卡贊德菈",
    },
    [225500] = {
        name = "葛麗菈‧嘶軸",
    },
    [225523] = {
        name = "蒙特‧加茲魯維",
    },
    [225533] = {
        name = "瑟坎",
    },
    [225555] = {
        name = "東東",
    },
    [225570] = {
        name = "蒙特‧加茲魯維",
    },
    [225571] = {
        name = "『剃刃』雷吉克",
    },
    [225582] = {
        name = "工頭度因斯",
    },
    [225583] = {
        name = "機械工基頓",
    },
    [225587] = {
        name = "蒙特‧加茲魯維",
    },
    [225591] = {
        name = "帕姆西",
    },
    [225596] = {
        name = "歐薇娜",
    },
    [225597] = {
        name = "蒙特‧加茲魯維",
    },
    [225598] = {
        name = "蒙特‧加茲魯維",
    },
    [225599] = {
        name = "『剃刃』雷吉克",
    },
    [225608] = {
        name = "波斯貝拉‧輪嘯",
    },
    [225616] = {
        name = "寇格溫",
    },
    [225618] = {
        name = "帕姆西",
    },
    [225624] = {
        name = "馬林‧諾格弗格",
    },
    [225625] = {
        name = "蒙特‧加茲魯維",
    },
    [225635] = {
        name = "蒙特‧加茲魯維",
    },
    [225637] = {
        name = "葛麗菈‧嘶軸",
    },
    [225638] = {
        name = "葛麗菈‧嘶軸",
    },
    [225639] = {
        name = "蒙特‧加茲魯維",
    },
    [225645] = {
        name = "蒙特‧加茲魯維",
    },
    [225648] = {
        name = "蒙特‧加茲魯維",
    },
    [225659] = {
        name = "歐薇娜",
    },
    [225669] = {
        name = "艾蘭里亞‧風行者",
    },
    [225686] = {
        name = "大財主里維加茲",
    },
    [225711] = {
        name = "鐵擊將軍",
    },
    [225719] = {
        name = "蒙特‧加茲魯維",
    },
    [225730] = {
        name = "蒙特‧加茲魯維",
    },
    [225756] = {
        name = "蒙特‧加茲魯維",
    },
    [225757] = {
        name = "蒙特‧加茲魯維",
    },
    [225772] = {
        name = "帕姆西",
    },
    [225847] = {
        name = "風險投資公司主管",
    },
    [225857] = {
        name = "勒蕾奈‧費恩",
    },
    [225867] = {
        name = "馬林‧諾格弗格",
    },
    [225868] = {
        name = "大財主里維加茲",
    },
    [225870] = {
        name = "艦隊指揮官海角",
    },
    [225871] = {
        name = "葛麗菈‧嘶軸",
    },
    [225873] = {
        name = "歐薇娜",
    },
    [225876] = {
        name = "葛麗菈‧嘶軸",
    },
    [225878] = {
        name = "蒙特‧加茲魯維",
    },
    [225879] = {
        name = "德瑞‧費恩",
    },
    [225925] = {
        name = "蘇菲塔‧林弗雷",
    },
    [225926] = {
        name = "蘇菲塔‧林弗雷",
    },
    [226019] = {
        name = "阿軸",
    },
    [226040] = {
        name = "至高代言者布琳瑟",
    },
    [226255] = {
        name = "小蔥",
    },
    [226273] = {
        name = "蒙特‧加茲魯維",
    },
    [226277] = {
        name = "馬蒂‧速車",
    },
    [226336] = {
        name = "波斯貝拉‧輪嘯",
    },
    [226518] = {
        name = "老爹克拉茲‧扭力扳手",
    },
    [226522] = {
        name = "涅涅‧扭力扳手",
    },
    [226569] = {
        name = "斯納普‧皮油",
    },
    [226660] = {
        name = "德克‧賣油者",
    },
    [226672] = {
        name = "歐薇娜",
    },
    [226703] = {
        name = "斯納普‧皮油",
    },
    [226710] = {
        name = "巷弄小老鼠",
    },
    [226728] = {
        name = "韓福瑞‧短口",
    },
    [226750] = {
        name = "芙誓愛提卡",
    },
    [226791] = {
        name = "紫羅蘭看守者",
    },
    [226792] = {
        name = "牧人艾迪迪瑟",
    },
    [226841] = {
        name = "代言者布琳瑟",
    },
    [226846] = {
        name = "歐斯米特船長",
    },
    [226894] = {
        name = "馬蒂‧速車",
    },
    [226899] = {
        name = "大法官地精",
    },
    [226932] = {
        name = "馬蒂‧速車",
    },
    [226934] = {
        name = "喬喬‧哥布瑞",
    },
    [227018] = {
        name = "馬蒂‧速車",
    },
    [227032] = {
        name = "馬蒂‧速車",
    },
    [227158] = {
        name = "哈南",
    },
    [227217] = {
        name = "韋伯斯特",
    },
    [227222] = {
        name = "伊莎蓓爾‧格林嘉德",
    },
    [227224] = {
        name = "戈亥",
    },
    [227436] = {
        name = "大法師卡德加",
    },
    [227477] = {
        name = "布萊恩‧銅鬚",
    },
    [227499] = {
        name = "歐薇娜",
    },
    [227523] = {
        name = "布萊恩‧銅鬚",
    },
    [227531] = {
        name = "蒙特‧加茲魯維",
    },
    [227544] = {
        name = "布萊恩‧銅鬚",
    },
    [227691] = {
        name = "歐薇娜",
    },
    [227758] = {
        name = "艾蘭里亞‧風行者",
    },
    [227937] = {
        name = "『剃刃』雷吉克",
    },
    [228017] = {
        name = "吉多",
    },
    [228074] = {
        name = "安格菈",
    },
    [228132] = {
        name = "『剃刃』雷吉克",
    },
    [228158] = {
        name = "瑞普斯努多",
    },
    [228214] = {
        name = "帕姆西",
    },
    [228286] = {
        name = "絲凱吉‧燼砰",
    },
    [228333] = {
        name = "絲凱吉‧燼砰",
    },
    [228341] = {
        name = "絲凱吉‧燼砰",
    },
    [228369] = {
        name = "馬蒂‧速車",
    },
    [228393] = {
        name = "布魯希‧詭鉤",
    },
    [228420] = {
        name = "塔波娜拉‧嘶軸",
    },
    [228473] = {
        name = "神奇的戴維",
    },
    [228474] = {
        name = "凱傑",
    },
    [228566] = {
        name = "爵士‧莫基茲",
    },
    [228857] = {
        name = "姬雅拉老媽",
    },
    [228860] = {
        name = "『嘉比』嘉比",
    },
    [228894] = {
        name = "歐薇娜",
    },
    [229223] = {
        name = "蒙特‧加茲魯維",
    },
    [229233] = {
        name = "蒙特‧加茲魯維",
    },
    [229235] = {
        name = "蒙特‧加茲魯維",
    },
    [229236] = {
        name = "蒙特‧加茲魯維",
    },
    [229242] = {
        name = "『剃刃』雷吉克",
    },
    [229243] = {
        name = "『剃刃』雷吉克",
    },
    [229246] = {
        name = "葛麗菈‧嘶軸",
    },
    [229261] = {
        name = "蒙特‧加茲魯維",
    },
    [229940] = {
        name = "薇若妮卡‧尼艾絲上校",
    },
    [230145] = {
        name = "伊崔格",
    },
    [230151] = {
        name = "嘉亞拉霸主",
    },
    [230154] = {
        name = "達納斯‧托爾貝恩",
    },
    [230159] = {
        name = "奧姆菲納",
    },
    [230174] = {
        name = "沃克‧格雷夏姆",
    },
    [230233] = {
        name = "沙哈塔",
    },
    [230235] = {
        name = "史卡吉特",
    },
    [230238] = {
        name = "史卡吉特",
    },
    [230242] = {
        name = "巴古斯",
    },
    [230246] = {
        name = "博學行者阿洲",
    },
    [230268] = {
        name = "蒙特‧加茲魯維",
    },
    [230271] = {
        name = "巴古斯",
    },
    [230288] = {
        name = "暗域行者",
    },
    [230294] = {
        name = "奧姆雷什",
    },
    [230554] = {
        name = "老人羅威",
    },
    [230555] = {
        name = "比茲‧羅威",
    },
    [230602] = {
        name = "薩拉塔斯",
    },
    [230604] = {
        name = "奧姆恩",
    },
    [230634] = {
        name = "薩拉塔斯",
    },
    [230658] = {
        name = "薩拉塔斯",
    },
    [230700] = {
        name = "暗域行者",
    },
    [230736] = {
        name = "奧姆塔拉",
    },
    [230738] = {
        name = "薩拉塔斯",
    },
    [230739] = {
        name = "靈魂雕銘師",
    },
    [230786] = {
        name = "靈魂雕銘師",
    },
    [230789] = {
        name = "沙哈塔",
    },
    [230806] = {
        name = "暗域行者",
    },
    [230811] = {
        name = "暗域行者",
    },
    [230814] = {
        name = "維娜里",
    },
    [230815] = {
        name = "法林‧洛薩",
    },
    [230817] = {
        name = "艾蘭里亞‧風行者",
    },
    [230818] = {
        name = "靈魂雕銘師",
    },
    [230825] = {
        name = "薩拉塔斯",
    },
    [230841] = {
        name = "綠油騎士",
    },
    [230954] = {
        name = "塔卡",
    },
    [230955] = {
        name = "巴維",
    },
    [231030] = {
        name = "阿拉特",
    },
    [231128] = {
        name = "暗域行者",
    },
    [231140] = {
        name = "巴古斯",
    },
    [231143] = {
        name = "巴古斯",
    },
    [231162] = {
        name = "錐盧吉",
    },
    [231266] = {
        name = "阿拉特",
    },
    [231314] = {
        name = "奧姆達蘭",
    },
    [231422] = {
        name = "流亡的希茲法蘭",
    },
    [231443] = {
        name = "靈魂雕銘師",
    },
    [231445] = {
        name = "薩拉塔斯",
    },
    [231486] = {
        name = "靈魂雕銘師",
    },
    [231487] = {
        name = "暗域行者",
    },
    [231488] = {
        name = "艾蘭里亞‧風行者",
    },
    [231492] = {
        name = "暗域行者",
    },
    [231505] = {
        name = "艾蘭里亞‧風行者",
    },
    [231517] = {
        name = "比茲‧羅威",
    },
    [231520] = {
        name = "薩拉塔斯",
    },
    [231522] = {
        name = "艾蘭里亞‧風行者",
    },
    [231564] = {
        name = "希賓",
    },
    [231674] = {
        name = "寶庫管理者希威茲",
    },
    [231699] = {
        name = "流亡的希茲法蘭",
    },
    [231748] = {
        name = "瑪姬‧枯野",
    },
    [231764] = {
        name = "法林‧洛薩",
    },
    [231768] = {
        name = "嘉亞拉霸主",
    },
    [231770] = {
        name = "伊崔格",
    },
    [231771] = {
        name = "法林‧洛薩",
    },
    [231803] = {
        name = "嘉亞拉霸主",
    },
    [231812] = {
        name = "馬蒂‧速車",
    },
    [231820] = {
        name = "維娜里",
    },
    [231826] = {
        name = "伊崔格",
    },
    [231828] = {
        name = "法林‧洛薩",
    },
    [231829] = {
        name = "嘉亞拉霸主",
    },
    [231832] = {
        name = "伊崔格",
    },
    [231833] = {
        name = "嘉亞拉霸主",
    },
    [231837] = {
        name = "法林‧洛薩",
    },
    [231919] = {
        name = "植物學家愛蓮拉",
    },
    [232005] = {
        name = "大法官地精",
    },
    [232008] = {
        name = "集團首領希歐姆",
    },
    [232057] = {
        name = "寶庫管理者希威茲",
    },
    [232132] = {
        name = "黎明",
    },
    [232180] = {
        name = "老人羅威",
    },
    [232351] = {
        name = "商人巴基爾",
    },
    [232385] = {
        name = "植物學家愛蓮拉",
    },
    [232491] = {
        name = "帕姆西",
    },
    [232498] = {
        name = "助理希涅",
    },
    [232642] = {
        name = "虛無精靈裂隙行者",
    },
    [232660] = {
        name = "虛無精靈弓箭手",
    },
    [232822] = {
        name = "蒙特‧加茲魯維",
    },
    [232823] = {
        name = "馬蒂‧速車",
    },
    [232986] = {
        name = "達納斯‧托爾貝恩",
    },
    [233235] = {
        name = "蓋瑞‧阻胃",
    },
    [233296] = {
        name = "艦隊指揮官海角",
    },
    [233390] = {
        name = "帕姆西",
    },
    [233420] = {
        name = "貝尼‧鵝炮",
    },
    [233482] = {
        name = "蒙特‧加茲魯維",
    },
    [233500] = {
        name = "奧姆塔哈",
    },
    [233501] = {
        name = "巴古斯",
    },
    [233603] = {
        name = "暗域行者",
    },
    [233706] = {
        name = "暗域行者",
    },
    [233878] = {
        name = "薩拉塔斯",
    },
    [233946] = {
        name = "薩拉塔斯",
    },
    [234048] = {
        name = "蒙特‧加茲魯維",
    },
    [234106] = {
        name = "暗域行者",
    },
    [234190] = {
        name = "娜拉瑟",
    },
    [234216] = {
        name = "助手工程師奧姆維克",
    },
    [234272] = {
        name = "魯巴恩",
    },
    [234293] = {
        name = "史提區夫",
    },
    [234294] = {
        name = "翠希‧雷轉",
    },
    [234316] = {
        name = "魯巴恩",
    },
    [234483] = {
        name = "聯合團助手",
    },
    [234551] = {
        name = "蒙特‧加茲魯維",
    },
    [234596] = {
        name = "暗域行者",
    },
    [234601] = {
        name = "奧姆恩",
    },
    [234602] = {
        name = "艾蘭里亞‧風行者",
    },
    [234620] = {
        name = "暗域行者",
    },
    [234662] = {
        name = "達納斯‧托爾貝恩",
    },
    [234728] = {
        name = "歐薇娜",
    },
    [234745] = {
        name = "赫米特‧奈辛瓦里",
    },
    [234783] = {
        name = "馬迪亞斯‧肖爾大師",
    },
    [234801] = {
        name = "蒙特‧加茲魯維",
    },
    [235041] = {
        name = "羅德里克‧布魯斯頓隊長",
    },
    [235238] = {
        name = "蒙特‧加茲魯維",
    },
    [235290] = {
        name = "赫米特‧奈辛瓦里",
    },
    [235353] = {
        name = "赫米特‧奈辛瓦里",
    },
    [235849] = {
        name = "黑水保鑣",
    },
    [235860] = {
        name = "瘟疫設計者瑪利雷斯",
    },
    [236815] = {
        name = "卡爾加‧血怒",
    },
    [236846] = {
        name = "赫米特‧奈辛瓦里",
    },
    [236890] = {
        name = "赫米特‧奈辛瓦里",
    },
    [236907] = {
        name = "阿達魯斯‧暮炎",
    },
    [237705] = {
        name = "薩拉塔斯",
    },
    [238006] = {
        name = "馬林‧諾格弗格",
    },
    [238012] = {
        name = "羅德里克‧布魯斯頓隊長",
    },
    [238209] = {
        name = "奧商集團管理者",
    },
    [238212] = {
        name = "奧姆塔拉",
    },
    [240842] = {
        name = "雷歐娜‧暗行",
    },
    [241588] = {
        name = "哈辛姆",
    },
    [241601] = {
        name = "莎達尼絲",
    },
    [241624] = {
        name = "莎達尼絲",
    },
    [242179] = {
        name = "阿達魯斯‧暮炎",
    },
    [242538] = {
        name = "維娜里",
    },
    [246601] = {
        name = "研究員艾莎芮",
    },
    [246608] = {
        name = "相位迷失潛伏者",
    },
    [248153] = {
        name = "博學者奧姆里克",
    },
    [250839] = {
        name = "白銀之手侍從",
    },
})
]])()
