local AddonName, Addon = ...

-- status: 25/25 translated

if (GetLocale() == "zhCN") then
Addon.Loc = {
    Title = "奥丹姆",
    Rares = {
        [157170] = "侍战者塔斯普",
        [151883] = "阿那瓦",
        [155703] = "巨擎之力安克乌瑞",
        [154578] = "亚基剥除者",
        [154576] = "亚基泰坦斯",
        [162172] = "亚基魔法师",
        [162370] = "硕铠鼠",
        [152757] = "阿特克拉蒙",
		[162171] = "Captain Dunewalker",
        [157167] = "勇士 森-玛特",
		[162147] = "食尸者",
        [157120] = "掠牙者奥尔萨",
		[162163] = "High Priest Ytaessis",
        [151995] = "工头西克-滕",
        [155531] = "废土寄生者队长",
        [157134] = "四风之龙艾夏克",
        [152431] = "卡奈布-提",
		[154604] = "亚吉其莱勋爵",
        [156078] = "Magus Rehleth",
        [157157] = "耀辉者玛米纳",
        [152677] = "晋升者内贝特",
        [162196] = "黑耀歼灭者",
		[162142] = "Qho",
        [156299] = "R'khuzj the Unfathomable",
        [162173] = "R'krox the Runt",
        [157146] = "腐肉饕餮者",
        [152040] = "高级斥候莫斯文",
        [151948] = "狮父森布",
		[160532] = "Shoth the Darkened",
        [162140] = "斯克提拉兹",
        [162372] = "乌黑的赛勒斯的灵魂",
        [162352] = "黑暗仪祭师扎卡汗之魂",
        [151878] = "太阳王纳科泰普",
        [151897] = "太阳女祭司纽比特",
        [151609] = "太阳先知艾帕弗斯",
        [152657] = "噬骨者塔特",
        [157188] = "陵墓寡妇蛛",
        [152788] = "太阳之怒 瓦特-卡",
		[162170] = "Warcaster Xeshro",
        [151852] = "守护者雷胡",
        [157164] = "狂热者泰科姆",
		[162141] = "Zuythiz"
    },
}
end