LegionRaresTreasures = LibStub("AceAddon-3.0"):NewAddon("LegionRaresTreasures", "AceBucket-3.0", "AceConsole-3.0", "AceEvent-3.0", "AceTimer-3.0")
local HandyNotes = LibStub("AceAddon-3.0"):GetAddon("HandyNotes", true)

if not HandyNotes then return end

local iconDefaults = {
    skull_grey = "Interface\\Addons\\HandyNotes_LegionRaresTreasures\\Artwork\\RareIcon.blp",
    skull_blue = "Interface\\Addons\\HandyNotes_LegionRaresTreasures\\Artwork\\RareIconBlue.blp",
	default = "Interface\\Icons\\TRADE_ARCHAEOLOGY_CHESTOFTINYGLASSANIMALS",
--[[swprare = "Interface\\Icons\\Trade_Archaeology_Fossil_SnailShell",
    shrine = "Interface\\Icons\\inv_misc_statue_02",
    glider = "Interface\\Icons\\inv_feather_04",
    rocket = "Interface\\Icons\\ability_mount_rocketmount",
    unknown = "Interface\\Addons\\HandyNotes_LegionRaresTreasures\\Artwork\\chest_normal_daily.tga",
    skull_green = "Interface\\Addons\\HandyNotes_LegionRaresTreasures\\Artwork\\RareIconGreen.tga", 
    skull_orange = "Interface\\Addons\\HandyNotes_LegionRaresTreasures\\Artwork\\RareIconOrange.tga",
    skull_purple = "Interface\\Addons\\HandyNotes_LegionRaresTreasures\\Artwork\\RareIconPurple.tga",
    skull_red = "Interface\\Addons\\HandyNotes_LegionRaresTreasures\\Artwork\\RareIconRed.tga",
    skull_yellow = "Interface\\Addons\\HandyNotes_LegionRaresTreasures\\Artwork\\RareIconYellow.tga",]]
}
local PlayerFaction, _ = UnitFactionGroup("player")
LegionRaresTreasures.nodes = { }

local nodes = LegionRaresTreasures.nodes
local isTomTomloaded = false
local isDBMloaded = false

nodes["Azsuna"] = {
	[58381229]={ "37980", "藏寶箱", "增加神兵之力", "在塔的頂層上，需要使用傳送門傳送過去; 傳送門座標：58.7,14.1", "default", "treasure_azs","131751"},
    [57901220]={ "37958", "藏寶箱", "增加神兵之力", "", "default", "treasure_azs","138783"},
	[51502430]={ "42289", "藏寶箱", "增加神兵之力", "在山洞內; 入口座標：47.8,23.7", "default", "treasure_azs","138783"},
	[56443481]={ "38251", "藏寶箱", "增加神兵之力", "", "default", "treasure_azs","132950"},
	[58364378]={ "37830", "發光的藏寶箱", "增加神兵之力", "", "default", "treasure_azs","131795"},
	[53543982]={ "42284", "小型藏寶箱", "增加神兵之力", "在廢墟內", "default", "treasure_azs","138783"},
    [42600810]={ "38367", "發光的藏寶箱", "增加神兵之力", "", "default", "treasure_azs","138783"},
	[55905690]={ "38365", "真正的寶藏", "增加神兵之力", "", "default", "treasure_azs","138783"},
	[62405840]={ "42273", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_azs","138783"},
	[63005420]={ "42278", "小型藏寶箱", "增加神兵之力", "在山洞內; 入口座標：64.0,52.9", "default", "treasure_azs","138783"},
	[65462961]={ "42958", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_azs","138783"},
	[53504545]={ "42283", "小型藏寶箱", "增加神兵之力", "在二樓", "default", "treasure_azs","138783"},
	[47860773]={ "42295", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_azs", "138783"},
	[55621855]={ "40711", "藏寶箱", "增加神兵之力", "在塔的頂層上，需要使用底層的傳送門傳送過去", "default", "treasure_azs", "138783"},
	[53611813]={ "44104", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_azs", "138783"},
	[63231521]={ "37832", "藏寶箱", "增加神兵之力", "", "default", "treasure_azs", "138783"},
	[68872973]={ "44103", "小型藏寶箱", "增加神兵之力", "在水底的洞穴內; 入口在東邊的水底", "default", "treasure_azs", "138783"},
	[57202520]={ "42338", "小型藏寶箱", "增加神兵之力", "在山洞內; 入口座標：55.7,25.4", "default", "treasure_azs", "138783"},
	[56892499]={ "42338", "小型藏寶箱", "增加神兵之力", "在山洞內; 入口座標：55.7,25.4", "default", "treasure_azs", "138783"},
	[55362774]={ "42288", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_azs", "138783"},
	[57153106]={ "38419", "藏寶箱", "增加神兵之力", "", "default", "treasure_azs", "138783"},
	[54313633]={ "42287", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_azs", "138783"},
	[53033726]={ "37596", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_azs", "138783"},
	[66064345]={ "40751", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_azs", "138783"},
	[62814479]={ "42294", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_azs", "138783"},
	[50465211]={ "44081", "藏寶箱", "增加神兵之力", "在埃卓尼爾峰上，需要使用傳送門傳送過去; 傳送門座標：60.35,46.31; 擊敗狡猾的逐日駿馬和邪惡的地脈駿馬後，寶藏會刷新在附近地上", "default", "treasure_azs", "140685"},
	[60504631]={ "44081", "藏寶箱", "增加神兵之力", "在埃卓尼爾峰上，需要使用傳送門傳送過去; 擊敗狡猾的逐日駿馬和邪惡的地脈駿馬後，寶藏會刷新在附近地上", "default", "treasure_azs", "140685"},
	[58645340]={ "40752", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_azs", "138783"},
	[59876316]={ "42272", "小型藏寶箱", "增加神兵之力", "!!! 等級110區域 !!! 在山崖上", "default", "treasure_azs", "138783"},
	[65066978]={ "38239", "看起來沒人看管的寶藏", "加速/臨機應變 手指", "點擊寶藏後會召喚5個澀海劫掠者，擊敗他們後再次拾取寶藏", "default", "treasure_azs", "129070"},
	[53176444]={ "37829", "藏寶箱", "增加神兵之力", "", "default", "treasure_azs", "138783"},
	[49415800]={ "38370", "藏寶箱", "致命一擊/加速 手指", "", "default", "treasure_azs", "141881"},
	[54875214]={ "44405", "小型藏寶箱", "增加神兵之力", "在山洞內; 拾取寶藏後附近NPC會暫時進入敵對狀態", "default", "treasure_azs", "138783"},
	[49384536]={ "37828", "藏寶箱", "玩具", "", "default", "treasure_azs", "122681"},
	[50215029]={ "42290", "小型藏寶箱", "增加神兵之力", "在山洞內", "default", "treasure_azs", "138783"},
	[52004210]={ "42281", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_azs", "138783"},
	[53684396]={ "42282", "小型藏寶箱", "增加神兵之力", "在底層", "default", "treasure_azs", "138783"},
	[63653919]={ "42293", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_azs", "138783"},
	[49653448]={ "37831", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_azs", "138783"},
	[44473946]={ "37713", "藏寶箱", "增加神兵之力", "", "default", "treasure_azs", "138783"},
	[40575767]={ "38316", "藏寶箱", "增加神兵之力", "", "default", "treasure_azs", "138783"},
	[26254713]={ "44105", "小型藏寶箱", "增加神兵之力", "在山洞內", "default", "treasure_azs", "138783"},
	[41393075]={ "42292", "藏寶箱", "增加神兵之力", "在山洞內", "default", "treasure_azs", "138783"},
	[34583556]={ "44102", "小型藏寶箱", "增加神兵之力", "在山洞內", "default", "treasure_azs", "138783"},
	[43392242]={ "42297", "發光的藏寶箱", "增加神兵之力", "在山頂上; 從9.14,32.84上山", "default", "treasure_azs", "138783"},
	[62028381]={ "42284", "小型藏寶箱", "增加神兵之力", "在廢墟內", "default", "treasure_azs","138783"},
	[71212211]={ "42285", "小型藏寶箱", "增加神兵之力", "在文物大廳內; 需要完成相關任務才能進入", "default", "treasure_azs", "138783"},
	[52842059]={ "42339", "藏寶箱", "增加神兵之力", "在山洞內; 入口座標：53.95,22.43; 不要碰到熊！！！", "default", "treasure_azs", "138783"},

	[52382304]={ "38268", "凱林‧蒼滅", "加速/精通 皮甲 頭部（皮甲職業掉落）", "", "skull_grey", "rare_azs", "129063"},
	[43172813]={ "38352", "厄運領主卡茲洛克", "智力/致命一擊 飾品（布甲職業掉落）", "跟製鞋匠泰德交談以觸發戰鬥", "skull_grey", "rare_azs", "129056"},
	[34963391]={ "42505", "秘法師沙里曼", "致命一擊/加速 布甲 手腕（布甲職業掉落）", "", "skull_grey", "rare_azs", "141868"},
	[30774799]={ "42286", "馴犬者史托希斯", "致命一擊/加速 鎖甲 腰部（鎖甲職業掉落）", "", "skull_grey", "rare_azs", "141873"},
	[29275366]={ "42417", "膽腦", "致命一擊/加速 皮甲 腳（皮甲職業掉落）", "", "skull_grey", "rare_azs", "129079"},
	[37374318]={ "42280", "渥撒斯", "致命一擊/精通 鎖甲 胸部（鎖甲職業掉落）", "在山頂上的魔望哨站內", "skull_grey", "rare_azs", "141875"},
	[32292972]={ "38238", "沙灘巨靈", "加速/臨機應變 鎧甲 肩部（鎧甲職業掉落）", "在沙灘上巡邏", "skull_grey", "rare_azs", "129067"},
	[49105519]={ "37909", "戰爭使者莫克斯納", "致命一擊/加速 鎖甲 手腕（鎖甲職業掉落）", "在道路上巡邏", "skull_grey", "rare_azs", "129069"},
	[49500880]={ "37928", "『廢黜者』諾曼提司", "致命一擊/加速 布甲 頭部（布甲職業掉落）", "在山洞內", "skull_grey", "rare_azs", "129061"},
	[56102906]={ "38061", "梟羽獸王喵嗚", "致命一擊/精通 皮甲 頭部（皮甲職業掉落）", "", "skull_grey", "rare_azs", "138395"},
	[35305030]={ "38037", "煉獄領主", "致命一擊/精通 鎧甲 頭部（鎧甲職業掉落）", "點擊煉獄火藏身處並擊敗兩波煉獄火後出現", "skull_grey", "rare_azs","129083"},
	[32604880]={ "44108", "怒顎", "加速/精通 背部", "在山洞內", "skull_grey", "rare_azs","129075"},
	[47303460]={ "37726", "『風暴使者』瓦麗雅卡", "加速/精通 布甲 手（布甲職業掉落）", "", "skull_grey", "rare_azs","129082"},
	[50803160]={ "37869", "匕喙", "加速/精通 鎖甲 腿部（鎖甲職業掉落）", "", "skull_grey", "rare_azs","129084"},
	[59601230]={ "37932", "亞克維洛斯", "致命一擊/加速 布甲 肩部（布甲職業掉落）", "殺死兩波怪物後出現", "skull_grey", "rare_azs","129085"},
	[45305780]={ "37824", "『船長剋星』弗洛格", "致命一擊/加速 背部", "", "skull_grey", "rare_azs","129090"},
	[65545679]={ "42221", "澀海頭子", "致命一擊/加速 手指", "", "skull_grey", "rare_azs","129073"},
	[61306200]={ "38217", "海潮巨獸", "加速/臨機應變 鎖甲 頭部（鎖甲職業掉落）", "", "skull_grey", "rare_azs","129062"},
	[59705520]={ "37822", "神諭者", "致命一擊/精通 布甲 腿部（布甲職業掉落）", "", "skull_grey", "rare_azs","129065"},
	[41054178]={ "37537", "雷文卓斯", "致命一擊/精通 皮甲 手（皮甲職業掉落）", "", "skull_grey", "rare_azs","129080"},
	[67105140]={ "37989", "希法諾斯", "致命一擊/加速 鎧甲 腿部（鎧甲職業掉落）", "!!! 等級110區域 !!!", "skull_blue", "rare_azs","129064"},
    [50003440]={ "37823", "『奪潮者』莫古", "加速/精通 頸部", "", "skull_grey", "rare_azs","129072"},
	[53404400]={ "37821", "沃羅倫隊長", "致命一擊/精通 皮甲 肩部（皮甲職業掉落）", "在二樓; 從旁邊的建築物過去", "skull_grey", "rare_azs","129066"},
	[55104590]={ "42450", "布勞戈斯", "加速/精通 鎧甲 腰部（鎧甲職業掉落）", "", "skull_grey", "rare_azs","129086"},
	[65164000]={ "37820", "『鐵鰭』哥札", "敏捷/精通 飾品（皮甲/鎖甲職業掉落）", "點擊海妖之角並殺死納迦後出現", "skull_grey", "rare_azs","129091"},
	[59304630]={ "38212", "博格佐格", "加速/精通 鎖甲 肩部（鎖甲職業掉落）", "在山崖上; 跟製鞋匠泰德交談以觸發戰鬥", "skull_grey", "rare_azs","129068"},
	[33404120]={ "44670", "育母莉札絲", "加速/精通 皮甲 胸部 （皮甲職業掉落）", "在山洞內", "skull_grey", "rare_azs","141869"},
	--[43602450]={ "99999", "魔翼蝙蝠", "致命一擊/精通 皮甲 手腕（皮甲職業掉落）", "在山頂上; 從9.14,32.84上山", "skull_grey", "rare_azs","129087"},
}

nodes["Valsharah"] = {
	[65867918]={ "38391", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_val","138783"},
	[56008376]={ "38861", "小型藏寶箱", "增加神兵之力", "在山洞內", "default", "treasure_val","138783"},
	[56225730]={ "39072", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_val","138783"},
	[62707040]={ "39069", "小型藏寶箱", "增加神兵之力", "在上層的陽台", "default", "treasure_val","138783"},
	[63007700]={ "39070", "小型藏寶箱", "增加神兵之力", "在利爪之巢內", "default", "treasure_val","138783"},
	[61657372]={ "39087", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_val","138783"},
	[38456530]={ "39080", "小型藏寶箱", "增加神兵之力", "在地窖內; 需要相關任務才能進入", "default", "treasure_val","138783"},
	[45106114]={ "39083", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_val","138783"},
	[63904556]={ "44139", "小型藏寶箱", "增加神兵之力", "在房子內", "default", "treasure_val","138783"},
	[54506048]={ "39097", "藏寶箱", "增加神兵之力", "在山洞內", "default", "treasure_val","130152"},
	[54187061]={ "39093", "小型藏寶箱", "增加神兵之力", "在山洞內", "default", "treasure_val","138783"},
	[54417419]={ "38359", "小型藏寶箱", "增加神兵之力", "在房子的木簾後方", "default", "treasure_val","138783"},
	[51247777]={ "38388", "小型藏寶箱", "增加神兵之力", "在樹根下的山洞內; 入口座標：50.9,77", "default", "treasure_val","138783"},
	[54958054]={ "38861", "小型藏寶箱", "增加神兵之力", "在水底的洞穴內", "default", "treasure_val","138783"},
	[48998615]={ "38886", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_val","138783"},
	[46448630]={ "38277", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_val","138783"},
	[44358257]={ "38387", "藏寶箱", "增加神兵之力", "在山洞內; 入口在房子後方的山崖下", "default", "treasure_val","141892"},
	[43068822]={ "44138", "藏寶箱", "增加神兵之力", "在山洞內; 入口座標：43.7,89.9", "default", "treasure_val","138783"},
	[48687379]={ "38366", "小型藏寶箱", "增加神兵之力", "在樹幹內", "default", "treasure_val","138783"},
	[43397589]={ "38363", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_val","138783"},
	[33815826]={ "39081", "藏寶箱", "增加神兵之力", "在房子內", "default", "treasure_val","138783"},
	[42665801]={ "39077", "小型藏寶箱", "增加神兵之力", "在房子內", "default", "treasure_val","138783"},
	[38626718]={ "39079", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_val","138783"},
	[43225488]={ "39084", "藏寶箱", "增加神兵之力", "在上層", "default", "treasure_val","138783"},
	[39945460]={ "38369", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_val","138783"},
	[41404560]={ "39085", "小型藏寶箱", "增加神兵之力", "在暗獄內; 入口座標：41.1,45.6", "default", "treasure_val","138783"},
	[41404560]={ "39086", "發光的藏寶箱", "增加神兵之力", "在暗獄內; 入口座標：41.1,45.6", "default", "treasure_val","138783"},
	[55557762]={ "38466", "無人看守的薊葉寶藏", "玩具", "點擊後會出現5個薊葉無賴，擊殺後才能拾取", "default", "treasure_val","130147"},
	[61073421]={ "39088", "藏寶箱", "增加神兵之力", "在水底的樹根", "default", "treasure_val","138783"},
	[68334060]={ "39073", "小型藏寶箱", "增加神兵之力", "在房子內", "default", "treasure_val","138783"},
	[66284122]={ "39108", "藏寶箱", "增加神兵之力", "在山上的樹旁", "default", "treasure_val","138783"},
	[67215928]={ "38782", "藏寶箱", "增加神兵之力", "在山洞內; 入口座標：65.9,56.3", "default", "treasure_val","138783"},
	[70225704]={ "38783", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_val","138783"},
	[69475999]={ "38781", "藏寶箱", "增加神兵之力", "在山洞內", "default", "treasure_val","138783"},
	[67395342]={ "38386", "小型藏寶箱", "增加神兵之力", "在上層的陽台", "default", "treasure_val","138783"},
	[64715126]={ "38355", "小型藏寶箱", "增加神兵之力", "在房子內", "default", "treasure_val","138783"},
	[54003489]={ "38390", "發光的藏寶箱", "增加神兵之力", "在山洞內; 入口座標：53.2,38.0; 需要完成相關任務才能拾取", "default", "treasure_val","141891"},
	[62076737]={ "39071", "藏寶箱", "增加神兵之力", "在瀑布後的山洞內", "default", "treasure_val","138783"},
	[63277401]={ "39102", "藏寶箱", "增加神兵之力", "在房子內", "default", "treasure_val","138783"},
	[61017917]={ "39089", "發光的藏寶箱", "增加神兵之力", "", "default", "treasure_val","138783"},
	[62708526]={ "44136", "小型藏寶箱", "增加神兵之力", "在山洞內", "default", "treasure_val","138783"},
	[64608546]={ "38900", "藏寶箱", "增加神兵之力", "在房子的二樓", "default", "treasure_val","138783"},
	[60498216]={ "38893", "小型藏寶箱", "增加神兵之力", "在山洞內; 入口座標：62.1,86.16", "default", "treasure_val","138783"},
	[65398629]={ "39074", "藏寶箱", "增加神兵之力", "在山洞內", "default", "treasure_val","138783"},
	[59887228]={ "38943", "小型藏寶箱", "增加神兵之力", "在上層; 從右邊的樓梯上去", "default", "treasure_val", "138783"},
	[73835437]={ "44135", "小型藏寶箱", "增加神兵之力", "在山洞內", "default", "treasure_val", "138783"},
	[73803227]={ "38371", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_val", "138783"},
	[63378841]={ "38389", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_val", "138783"},
	
	[60359065]={ "38887", "史寇沃克斯", "加速/精通 布甲 腳（布甲職業掉落）", "點擊艾琳蒂雅‧羽光並擊殺史寇沃克斯", "skull_grey", "rare_val","130115"},
	[59747747]={ "38468", "血喙", "寵物", "跟蘿芮兒‧賢羽交談以觸發戰鬥", "skull_grey", "rare_val","130154"},
	[52788750]={ "38889", "『穿刺者』基尼奇", "寵物", "在山洞內; 和顫抖的灰喉幼熊交談以觸發戰鬥", "skull_grey", "rare_val","128690"},
	[65805344]={ "40126", "『女巫』葛芮達", "加速/精通 頸部", "", "skull_grey", "rare_val","130122"},
	[62604750]={ "38780", "悚德瑞斯", "致命一擊/精通 鎖甲 手腕（鎖甲職業掉落）", "", "skull_grey", "rare_val","130121"},
	[60314427]={ "39858", "懼沼", "加速/精通 背部", "在崖下", "skull_grey", "rare_val","130125"},
	[44145209]={ "38767", "暗影", "寵物", "在底層", "skull_grey", "rare_val","130166"},
	[61056940]={ "39596", "佩瑞斯", "致命一擊/精通 鎖甲 肩部（鎖甲職業掉落）", "", "skull_grey", "rare_val","130137"},
	[45598879]={ "43446", "巴哈迦", "臨機應變/精通 皮甲 腿部（皮甲職業掉落）", "在山洞內", "skull_grey", "rare_val","130135"},
	[47225802]={ "39357", "瘋子亨利克", "玩具", "踩上老舊捕熊陷阱以觸發戰鬥", "skull_grey", "rare_val","130214"},
	[34425828]={ "39121", "奇朗尼斯‧暮語", "增加神兵之力", "點擊振動的秘法陷阱以觸發戰鬥", "skull_grey", "rare_val","141876"},
	[58773402]={ "40080", "鐵枒", "只掉垃圾", "", "skull_grey", "rare_val",""}, --130126
	[61792954]={ "40079", "萊拉斯‧月羽", "致命一擊/加速 布甲 手（布甲職業掉落）", "", "skull_grey", "rare_val","130118"},
	[66873686]={ "39856", "鬼爪", "致命一擊/加速 皮甲 手（皮甲職業掉落）", "", "skull_grey", "rare_val","130116"}, --second QuestID 43447
	[67166962]={ "43176", "地底劣魔老大", "加速/精通 鎧甲 頭盔", "靠近房子然後擊退兩波攻擊後出現", "skull_grey", "rare_val","130133"},
	[38065281]={ "38772", "瑟萊希亞", "臨機應變/精通 布甲 胸部（布甲職業掉落）", "點擊墓碑上的名牌以觸發戰鬥", "skull_grey", "rare_val", "130136"},
	[41647827]={ "38479", "席爾曦", "玩具", "", "skull_grey", "rare_val", "130171"},
	[67504510]={ "39130", "惡臭的波勞斯", "寵物", "跟費蘭卓斯‧喚霧者交談以觸發戰鬥", "skull_grey", "rare_val", "130168"},
}

nodes["Highmountain"] = {
	[54174159]={ "40483", "發光的藏寶箱", "增加神兵之力", "在山洞的第二層; 入口座標：55.1,44.3", "default", "treasure_hmn","138783"},
	[52023241]={ "40505", "藏寶箱", "增加神兵之力", "", "default", "treasure_hmn","138783"},
	[39704830]={ "39494", "漂浮的寶藏", "增加神兵之力", "在河流漂浮", "default", "treasure_hmn","131763"},
	[55134965]={ "40487", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_hmn","138783"},
	[43582510]={ "40478", "藏寶箱", "增加神兵之力", "在山洞內; 入口座標：42.5,25.4", "default", "treasure_hmn","138783"},
	[49647128]={ "39606", "發光的藏寶箱", "增加神兵之力", "使用底層的泰坦甬道之門傳送到寶藏附近; 點擊高嶺火盆並擊殺兩次泰坦防衛者; 事件完成後寶藏會刷新在泰坦甬道之門附近", "default", "treasure_hmn","138783"},
	[39376229]={ "40474", "藏寶箱", "增加神兵之力", "", "default", "treasure_hmn", "138783"},
	[53035224]={ "40493", "小型藏寶箱", "增加神兵之力", "在山洞內; 入口座標：49.9,53.8", "default", "treasure_hmn", "138783"},
	[53454352]={ "40484", "小型藏寶箱", "增加神兵之力", "在山洞的底層; 入口座標：55.1,44.3", "default", "treasure_hmn", "138783"},
	[53063946]={ "40499", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_hmn", "138783"},
	[50983880]={ "40498", "藏寶箱", "增加神兵之力", "在房子內", "default", "treasure_hmn", "138783"},
	[49603770]={ "39466", "藏寶箱", "\n把微光的鵬鳥羽毛（48.4,40.1），\n細緻的鵬鳥羽毛（47.6,44），\n閃爍的鵬鳥羽毛（49.6,37.7）和\n被丟棄的天角風箏（53.6,51.0）\n合成玩具", "在山頂上", "default", "treasure_hmn", "131927"},
	[42503500]={ "40480", "小型藏寶箱", "增加神兵之力", "在樹枝上", "default", "treasure_hmn", "138783"},
	[37353381]={ "40477", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_hmn", "138783"},
	[45573462]={ "40481", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_hmn", "138783"},
	[55134964]={ "40487", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_hmn", "138783"},
	[39307621]={ "40473", "藏寶箱", "增加神兵之力", "完成相關任務才能看見", "default", "treasure_hmn", "138783"},  
	[46227340]={ "40489", "藏寶箱", "增加神兵之力", "在山洞的第二層", "default", "treasure_hmn", "138783"},  
	[43757275]={ "40510", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_hmn", "138783"},  
	[36616213]={ "40488", "藏寶箱", "增加神兵之力", "", "default", "treasure_hmn", "138783"}, 
	[53414868]={ "40500", "小型藏寶箱", "增加神兵之力", "在房子內", "default", "treasure_hmn", "138783"},  
	[52305141]={ "39766", "真正安全藏寶箱", "增加神兵之力", "在映影山巔上; 從53.1,55.7上山; 點擊絕對放心藏寶箱後召喚雷姆帕格; 擊殺後拾取真正安全藏寶箱", "default", "treasure_hmn", "131802"},  
	[42212730]={ "40479", "藏寶箱", "增加神兵之力", "", "default", "treasure_hmn", "138783"},  
	[45192746]={ "44279", "小型藏寶箱", "增加神兵之力", "在水底的洞穴內", "default", "treasure_hmn", "138783"},  
	[46682810]={ "40482", "發光的藏寶箱", "增加神兵之力", "在建築物的頂上", "default", "treasure_hmn", "138783"},    
	[50983647]={ "40496", "藏寶箱", "增加神兵之力", "在山洞的下一層; 入口座標：48.1,33.8/51.6,37.5", "default", "treasure_hmn", "138783"},  
	[50243861]={ "40497", "小型藏寶箱", "增加神兵之力", "在山洞的最上層; 入口座標：48.1,33.8/51.6,37.5", "default", "treasure_hmn", "138783"},  
	[50813504]={ "40506", "小型藏寶箱", "增加神兵之力", "在山頂上", "default", "treasure_hmn", "138783"},  
	[46814013]={ "40507", "小型藏寶箱", "增加神兵之力", "在山頂上", "default", "treasure_hmn", "138783"},  
	[47644406]={ "39503", "藏寶箱", "\n把微光的鵬鳥羽毛（48.4,40.1），\n細緻的鵬鳥羽毛（47.6,44），\n閃爍的鵬鳥羽毛（49.6,37.7）和\n被丟棄的天角風箏（53.6,51.0）\n合成玩具", "在山崖上", "default", "treasure_hmn", "131926"},  
	[53615103]={ "39824", "藏寶箱", "\n降低掉落速度道具（1分鐘冷卻時間）;\n把微光的鵬鳥羽毛（48.4,40.1），\n細緻的鵬鳥羽毛（47.6,44），\n閃爍的鵬鳥羽毛（49.6,37.7）和\n被丟棄的天角風箏（53.6,51.0）\n合成玩具", "在山崖的樹枝上; 從山上跳下去", "default", "treasure_hmn", "131810"},
	
	[54394112]={ "40414", "吞噬暗影", "加速/精通 布甲 腳（布甲職業掉落）", "在山洞內; 入口座標：55.1 to 44.3; 點擊所有狗頭人蠟燭召喚它", "skull_grey", "rare_hmn","131780"},
	[53755123]={ "39872", "托森", "致命一擊/加速 鎧甲 腰部（鎧甲職業掉落）", "在山洞內; 跟托森交談以觸發戰鬥; 擊敗他後拾取托森的獎品", "skull_grey", "rare_hmn","131800"},
	[41513184]={ "40175", "斯蘭伯爾", "致命一擊/精通 頸部", "", "skull_grey", "rare_hmn","131921"},
	[46643144]={ "39646", "威嚴領角鹿", "玩具", "在大範圍奔跑", "skull_grey", "rare_hmn","131900"},
	[49202709]={ "40242", "梅洛卡，托洛卡之子", "增加神兵之力", "", "skull_grey", "rare_hmn","131808"},	
	[40975775]={ "39993", "火鱗", "致命一擊/精通 鎖甲 胸部（鎖甲職業掉落）", "點擊棄置的釣魚竿召喚它", "skull_grey", "rare_hmn","131773"},
	[45705500]={ "40681", "斯坎", "致命一擊/加速 皮甲 腰部（皮甲職業掉落）", "", "skull_grey", "rare_hmn","131730"},
	[51074825]={ "39802", "『掠奪者』哈特莉", "", "", "skull_grey", "rare_hmn","1220"},
	[43404730]={ "40413", "業餘獵人", "致命一擊/精通 鎧甲 腳（鎧甲職業掉落）", "在山洞內; 擊殺後，寶藏會刷新在附近地上", "skull_grey", "rare_hmn","131781"},
	[54447454]={ "40773", "冰霜裂石怪", "", "!!! 等級110 !!!", "skull_blue", "rare_hmn","1220"},
	[51463189]={ "39465", "骷髏帽", "致命一擊/臨機應變 布甲 手腕（布甲職業掉落）", "在山洞內", "skull_grey", "rare_hmn","131769"},
	[41944149]={ "39782", "坦帕克‧焰圖騰", "寵物", "", "skull_grey", "rare_hmn","129175"},
	[48605000]={ "39784", "馴獸者鮑雷克", "致命一擊/加速 鎖甲 手（鎖甲職業掉落）", "跟馴獸者鮑雷克對話並協助他馴服亞魯; 事件完成後拾取山洞內的失竊的雷霆圖騰貨物", "skull_grey", "rare_hmn","131756"},
	[37704570]={ "40405", "鬃槌", "加速/臨機應變 皮甲 頭部（皮甲職業掉落）", "在山洞內", "skull_grey", "rare_hmn","131761"},
	[44201210]={ "39994", "螃蟹騎士咯莫呣嚕", "加速/精通 胸部（皮甲職業掉落）", "他在周圍遊盪", "skull_grey", "rare_hmn","131798"},
	[46500744]={ "40096", "莫克噜", "臨機應變/精通 手指", "點擊『邋遢鬼』喬伊召喚它", "skull_grey", "rare_hmn","131797"},
	[56406050]={ "40347", "『猛擊者』加爾柏格", "致命一擊/加速 鎧甲 胸部（鎧甲職業掉落）", "他在周圍遊盪", "skull_grey", "rare_hmn","131775"},
	[56357250]={ "39235", "『強者』布羅古爾", "加速/精通 鎖甲 腳（鎖甲職業掉落）", "", "skull_grey", "rare_hmn", "138396"},
	[36741635]={ "40084", "『囤積者』波達許", "力量 飾品 （攻擊觸發精通）（鎧甲職業掉落）", "", "skull_grey", "rare_hmn", "1220"},
	[48502546]={ "39646", "威嚴領角鹿", "玩具", "在大範圍奔跑", "skull_grey", "rare_hmn","131900"},
	[51062570]={ "39762", "夏菈‧魔息", "加速/精通 布甲 胸部（布甲職業掉落）", "", "skull_grey", "rare_hmn", "131791"},
	[48414015]={ "39806", "『飢餓者』克羅夏", "\n把微光的鵬鳥羽毛（48.4,40.1），\n細緻的鵬鳥羽毛（47.6,44），\n閃爍的鵬鳥羽毛（49.6,37.7）和\n被丟棄的天角風箏（53.6,51.0）\n合成玩具", "", "skull_grey", "rare_hmn", "131809"},
	[54504060]={ "39866", "敏塔‧爪嘯", "致命一擊/加速 背部", "在山頂上; 從53.4,35.5上山; 跟斥候兔足交談並擊退兩波攻擊後出現", "skull_grey", "rare_hmn", "131792"},
	[50803460]={ "40406", "『蛋食者』拉葛特", "致命一擊/精通 鎖甲 腰部（鎖甲職業掉落）", "在山洞的下一層; 入口座標：48.1,33.8/51.6,37.5", "skull_grey", "rare_hmn", "131776"},
 }
 
nodes["Stormheim"] = {
	[35725407]={ "38677", "藏寶箱", "增加神兵之力", "在船艙底層", "default", "treasure_sth","138783"},
	[31105600]={ "38676", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_sth","138783"},
	[27335749]={ "38529", "藏寶箱", "增加神兵之力", "在山洞內; 入口座標：31.4,57.1", "default", "treasure_sth","138783"},
	[32054719]={ "43196", "藏寶箱", "增加神兵之力", "在山洞內", "default", "treasure_sth","138783"},
	[41744604]={ "38488", "小型藏寶箱", "增加神兵之力", "在房子內", "default", "treasure_sth","138783"},
	[50314100]={ "38483", "小型藏寶箱", "增加神兵之力", "在山洞內", "default", "treasure_sth","138783"},
	[48137421]={ "38476", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_sth","138783"},
	[42616579]={ "38474", "藏寶箱", "增加神兵之力", "在房子內", "default", "treasure_sth","138783"},
	[46768040]={ "38481", "藏寶箱", "增加神兵之力", "需要使用風鑄爪鉤槍才能到達", "default", "treasure_sth","138783"},
	[61404440]={ "40093", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_sth","138783"},
	[60834273]={ "40094", "小型藏寶箱", "增加神兵之力", "需要使用風鑄爪鉤槍才能到達", "default", "treasure_sth","138783"},
	[55004716]={ "40095", "藏寶箱", "增加神兵之力", "", "default", "treasure_sth","138783"},
	[67935774]={ "40083", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_sth","138783"},
	[69144478]={ "38637", "小型藏寶箱", "增加神兵之力", "在建築物上; 需要使用風鑄爪鉤槍才能到達或從山上跳下去", "default", "treasure_sth","138783"},
	[73334150]={ "40085", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_sth","138783"},
	[61836289]={ "40089", "藏寶箱", "增加神兵之力", "在房子內", "default", "treasure_sth","138783"},
	[57946321]={ "40090", "小型藏寶箱", "增加神兵之力", "在桌子下", "default", "treasure_sth","138783"},
	[49777801]={ "38485", "小型藏寶箱", "增加神兵之力", "需要使用風鑄爪鉤槍才能到達", "default", "treasure_sth", "138783"},
	[65364310]={ "43205", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_sth", "138783"},
	[52018058]={ "38480", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_sth", "138783"},
	[72135489]={ "42628", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_sth", "138783"},
	[65585737]={ "43187", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_sth", "138783"},
	[62667362]={ "40091", "小型藏寶箱", "增加神兵之力", "在塔的頂層", "default", "treasure_sth", "138783"},
	[39571934]={ "38498", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_sth", "138783"},	
	[35924792]={ "38680", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_sth", "138783"},
	[33143607]={ "38495", "藏寶箱", "增加神兵之力", "", "default", "treasure_sth", "138783"},
	[35033660]={ "38487", "藏寶箱", "增加神兵之力", "在山洞內; 入口座標：34.8,34.23", "default", "treasure_sth", "138783"},
	[32742791]={ "38490", "藏寶箱", "增加神兵之力", "在山洞內; 入口座標：33.65,27.35", "default", "treasure_sth", "138783"},
	[43164049]={ "43238", "小型藏寶箱", "增加神兵之力", "在岩石上; 需要使用風鑄爪鉤槍才能到達", "default", "treasure_sth", "138783"},
	[44983823]={ "43240", "小型藏寶箱", "增加神兵之力", "在岩石上; 需要使用風鑄爪鉤槍才能到達", "default", "treasure_sth", "138783"},
	[47463412]={ "43255", "藏寶箱", "增加神兵之力", "在山崖上; 需要從旁邊的岩石使用風鑄爪鉤槍才能到達", "default", "treasure_sth", "138783"},
	[42473407]={ "43189", "發光的藏寶箱", "增加神兵之力", "在雕像內; 前往入口的樓梯座標：2.24,34.87", "default", "treasure_sth", "141896"},
	[37183865]={ "43208", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_sth", "138783"},
	[61933255]={ "38744", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_sth", "138783"},
	[68462959]={ "40108", "發光的藏寶箱", "增加神兵之力", "在山崖上; 需要從旁邊的小島使用風鑄爪鉤槍才能到達", "default", "treasure_sth", "138783"},
	[58044751]={ "40082", "小型藏寶箱", "增加神兵之力", "在塔的頂層", "default", "treasure_sth", "138783"},
	[64293956]={ "43302", "小型藏寶箱", "增加神兵之力", "在山崖上", "default", "treasure_sth", "138783"},
	[68974183]={ "40086", "藏寶箱", "增加神兵之力", "在房子內", "default", "treasure_sth", "138783"},
	[74414182]={ "43306", "小型藏寶箱", "增加神兵之力", "在建築物上; 需要使用風鑄爪鉤槍才能到達", "default", "treasure_sth", "138783"},
	[71924425]={ "43305", "小型藏寶箱", "增加神兵之力", "在建築物上; 需要使用風鑄爪鉤槍才能到達", "default", "treasure_sth", "138783"},
	[73154570]={ "43194", "小型藏寶箱", "增加神兵之力", "在山上的房子內", "default", "treasure_sth", "138783"},
	[73965223]={ "42632", "小型藏寶箱", "增加神兵之力", "在岩石上; 需要使用風鑄爪鉤槍才能到達", "default", "treasure_sth", "138783"},
	[75164949]={ "42629", "藏寶箱", "增加神兵之力", "在帆上; 需要使用風鑄爪鉤槍才能到達", "default", "treasure_sth", "138783"},
	[73975858]={ "43237", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_sth", "138783"},
	[75676060]={ "43304", "小型藏寶箱", "增加神兵之力", "在山崖上; 需要使用風鑄爪鉤槍才能到達", "default", "treasure_sth", "138783"},
	[82405451]={ "43191", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_sth", "138783"},
	[81876750]={ "40099", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_sth", "138783"},
	[69986719]={ "43188", "小型藏寶箱", "增加神兵之力", "在角落", "default", "treasure_sth", "138783"},
	[59305846]={ "40088", "藏寶箱", "增加神兵之力", "在塔的底層", "default", "treasure_sth", "138783"},
	[78427138]={ "43307", "藏寶箱", "增加神兵之力", "在山崖上; 需要從75.9,64.3一直使用風鑄爪鉤槍才能到達", "default", "treasure_sth", "138783"},
	[50554125]={ "43246", "小型藏寶箱", "增加神兵之力", "在岩石上; 需要一直使用風鑄爪鉤槍才能到達", "default", "treasure_sth", "138783"},
	[39486518]={ "38486", "藏寶箱", "增加神兵之力", "", "default", "treasure_sth", "138783"},
	[35176898]={ "38478", "小型藏寶箱", "增加神兵之力", "在塔的頂層", "default", "treasure_sth", "138783"},
	[40656852]={ "38475", "小型藏寶箱", "增加神兵之力", "在塔的頂層; 需要使用風鑄爪鉤槍才能到達", "default", "treasure_sth", "138783"},
	[44166997]={ "38489", "小型藏寶箱", "增加神兵之力", "在建築物上; 需要使用風鑄爪鉤槍才能到達", "default", "treasure_sth", "138783"},
	[43708009]={ "43239", "小型藏寶箱", "增加神兵之力", "在岩石上; 需要一直使用風鑄爪鉤槍才能到達", "default", "treasure_sth", "138783"},
	[42306110]={ "38477", "小型藏寶箱", "增加神兵之力", "在橋底", "default", "treasure_sth", "138783"},
	[46606496]={ "38681", "小型藏寶箱", "增加神兵之力", "在山洞內; 入口座標：48.16,65.24", "default", "treasure_sth", "138783"},
	[49085999]={ "43207", "小型藏寶箱", "增加神兵之力", "在山崖上", "default", "treasure_sth", "138783"},
	[47986237]={ "38738", "藏寶箱", "增加神兵之力", "在瀑布的底部", "default", "treasure_sth", "138783"},
	[50061816]={ "43195", "藏寶箱", "增加神兵之力", "", "default", "treasure_sth", "138783"},
	[49694731]={ "38763", "發光的藏寶箱", "增加神兵之力", "在山洞內; 點擊寶藏後擊敗2個寶庫守護者，擊敗他們後再次拾取寶藏", "default", "treasure_sth", "132897"},
	[53229314]={ "43190", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_sth", "138783"},
	[53229314]={ "43190", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_sth", "138783"},
	
	[40677238]={ "38424", "『殘虐者』厄格洛夫族長", "玩具", "在房子內; 需要先擊敗3個勇士才能攻擊", "skull_grey", "rare_sth", "129113"},
	[38454305]={ "38626", "血巡者首領", "臨機應變 飾品 (攻擊召喚血巡者座狼)", "在大範圍巡邏", "skull_grey", "rare_sth", "129101"},
	[54802941]={ "42437", "星巴鹿", "致命一擊/加速 皮甲 手腕（皮甲職業掉落）", "", "skull_grey", "rare_sth", "130132"},
	[63707422]={ "37908", "審判官恩斯騰博", "致命一擊/加速 皮甲 肩部（皮甲職業掉落）", "在山洞內", "skull_grey", "rare_sth", "140686"},
	[73454763]={ "40109", "寇特‧馮迪爾", "加速/精通 皮甲 手腕（皮甲職業掉落）", "", "skull_grey", "rare_sth", "138419"},
	[78626116]={ "40113", "『征服者』莫古爾", "加速/精通 鎖甲 腰部（鎖甲職業掉落）", "", "skull_grey", "rare_sth", "138421"},
	[36505170]={ "38472", "白浪颱風", "致命一擊/精通 鎖甲 手（鎖甲職業掉落）", "", "skull_grey", "rare_sth","138418"},
	[47174983]={ "38774", "『失落者』提塔格", "力量 飾品(使用造成範圍傷害)（鎧甲職業掉落）", "", "skull_grey", "rare_sth","129163"},
	[46828406]={ "38425", "法斯納", "致命一擊/精通 手指", "在山洞內; 需要使用風鑄爪鉤槍才能到達山洞", "skull_grey", "rare_sth", "129206"},
	[64805176]={ "38847", "『撕掠者』厄吉夫", "加速/精通 布甲 手腕（布甲職業掉落）", "", "skull_grey", "rare_sth","129219"},
	[73906060]={ "43343", "懼翼騎士寇提斯", "加速/精通 鎖甲 腿部（鎖甲職業掉落）", "", "skull_grey", "rare_sth","130134"},
	[62036049]={ "39120", "『鐵錘』伊莎爾", "致命一擊/精通 鎖甲 頭部（鎖甲職業掉落）", "在房子內", "skull_grey", "rare_sth","129133"},
	[59826807]={ "39031", "象牙哨兵", "精通 飾品 (攻擊觸發智力)（布甲職業掉落）", "", "skull_grey", "rare_sth","132895"},
	[41506660]={ "38333", "格里瑪‧鐵拳", "致命一擊/精通 鎧甲 腰部（鎧甲職業掉落）", "", "skull_grey", "rare_sth","129291"},
	[49507175]={ "38423", "風暴之翼族母", "寵物; 致命一擊/加速 皮甲 腿部（皮甲職業掉落）", "", "skull_grey", "rare_sth","129208"},
	[51607465]={ "42591", "『屠夫』漢尼乏", "致命一擊/精通 皮甲 胸部（皮甲職業掉落）", "", "skull_grey", "rare_sth","138417"},
	[45877736]={ "38431", "刃風", "致命一擊/加速 布甲 胸部（布甲職業掉落）", "", "skull_grey", "rare_sth","129048"},
	[61534333]={ "40081", "塔本", "致命一擊/精通 頸部", "", "skull_grey", "rare_sth","129199"},
	[58004516]={ "38642", "孛韋船長", "加速/精通 鎖甲 胸部（鎖甲職業掉落）", "點擊獄喉號角召喚他", "skull_grey", "rare_sth","129123"},
	[58353392]={ "43342", "爛眼", "致命一擊/加速 鎖甲 腰部", "在山洞內", "skull_grey", "rare_sth","139387"},
	[72504991]={ "38837", "莫德維畢恩", "臨機應變/精通 背部", "", "skull_grey", "rare_sth","129035"},
	[67303990]={ "38685", "無名之王", "加速/精通 布甲 頭部（布甲職業掉落）", "點擊獻祭祭壇召喚他", "skull_grey", "rare_sth","129041"},
	[41773411]={ "40068", "『恆久者』埃吉爾", "加速/精通 鎧甲 腳（鎧甲職業掉落）", "在山洞內", "skull_grey", "rare_sth", "132898"},
}

nodes["Suramar"] = {
	[23414880]={ "43842", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_sur", "138783"},
	[25958548]={ "43831", "小型藏寶箱", "增加神兵之力", "在魔蝕大牢內; 入口座標：29,84.8", "default", "treasure_sur", "138783"},
	[29768817]={ "43748", "閃爍的上古法力晶簇", "增加上古法力", "在魔蝕大牢內; 入口座標：29,84.8", "default", "treasure_sur", "141655"},
	[38138712]={ "43830", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_sur", "138783"},
	[51503859]={ "43855", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_sur", "138783"},
	[46552599]={ "43744", "閃爍的上古法力晶簇", "增加上古法力", "在水底", "default", "treasure_sur", "141655"},
	[52733130]={ "40767", "蒙塵法櫃", "增加神兵之力", "在山洞內; 入口座標：49.5,33.9", "default", "treasure_sur", "138783"},
	[44302289]={ "43850", "藏寶箱", "增加神兵之力", "", "default", "treasure_sur", "138783"},
	[16602974]={ "43846", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_sur", "138783"},
	[22863574]={ "43838", "菲阿多拉神殿", "", "神殿內有兩個寶藏", "default", "treasure_sur", ""},
	[21425446]={ "42842", "克達納茲的法力藥瓶", "增加100點上古法力的上限", "", "default", "treasure_sur", "136269"},
	[17275462]={ "43844", "藏寶箱", "增加神兵之力", "在廢墟的上層", "default", "treasure_sur", "138783"},
	[44053194]={ "43856", "發光的藏寶箱", "增加上古法力", "在瀑布後的山洞內; 入口座標：42.25,29.97", "default", "treasure_sur", "139786"},
	[29271622]={ "43848", "藏寶箱", "增加神兵之力", "在塔內", "default", "treasure_sur", "138783"},
	[35561209]={ "43989", "奧術能量裝置", "增加100點上古法力的上限", "", "default", "treasure_sur", "140329"},
	[41961919]={ "43746", "閃爍的上古法力晶簇", "增加上古法力", "", "default", "treasure_sur", "139786"},
	[42051968]={ "43849", "發光的藏寶箱", "增加上古法力", "", "default", "treasure_sur", "139786"},
	[26831696]={ "43847", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_sur", "138783"},
	[48143399]={ "43853", "小型藏寶箱", "增加神兵之力", "在建築物內", "default", "treasure_sur", "138783"},
	[67315511]={ "43858", "藏寶箱", "增加神兵之力", "在廢墟內", "default", "treasure_sur", "138783"},
	[79647289]={ "43741", "閃爍的上古法力晶簇", "增加上古法力", "在水底", "default", "treasure_sur", "141655"},
	[83126933]={ "43863", "藏寶箱", "增加神兵之力", "在山洞內", "default", "treasure_sur", "138783"},
	[83975764]={ "43862", "藏寶箱", "增加神兵之力", "", "default", "treasure_sur", "138783"},
	[61365550]={ "43872", "藏寶箱", "增加神兵之力", "在房子內", "default", "treasure_sur", "138783"},
	[54326033]={ "43875", "藏寶箱", "增加神兵之力", "在河邊", "default", "treasure_sur", "138783"},
	[57686197]={ "43874", "藏寶箱", "增加神兵之力", "在上層的房子內", "default", "treasure_sur", "138783"},
	[57326039]={ "43873", "藏寶箱", "增加神兵之力", "在上層的台子上", "default", "treasure_sur", "138783"},
	[60356851]={ "43876", "發光的藏寶箱", "增加上古法力", "在上層的台子上", "default", "treasure_sur", "139786"},
	[49988493]={ "43864", "小型藏寶箱", "增加神兵之力", "在50.06,84.46點擊爪鉤處", "default", "treasure_sur", "138783"},
	[48117321]={ "43865", "小型藏寶箱", "增加神兵之力", "需要點擊爪鉤處上去", "default", "treasure_sur", "138783"},
	[48288261]={ "43866", "小型藏寶箱", "增加神兵之力", "在48.39 to 82.23的屋頂點擊爪鉤處", "default", "treasure_sur", "138783"},
	[48957379]={ "43867", "藏寶箱", "增加神兵之力", "在二樓; 右邊的樓梯上去", "default", "treasure_sur", "138783"},
	[51908214]={ "43868", "藏寶箱", "增加神兵之力", "", "default", "treasure_sur", "138783"},
	[44387587]={ "43869", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_sur", "138783"},
	[42577668]={ "43870", "小型藏寶箱", "增加神兵之力", "在上層", "default", "treasure_sur", "138783"},
	[48587217]={ "44323", "藏寶箱", "增加神兵之力", "從左邊的樓梯上去", "default", "treasure_sur", "138783"},
	[50068061]={ "44325", "藏寶箱t", "增加神兵之力", "在頂層", "default", "treasure_sur", "138783"},
	[48297121]={ "44324", "藏寶箱", "增加神兵之力", "跳上書架，再走到右邊", "default", "treasure_sur", "138783"},
	[55685480]={ "43871", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_sur", "138783"},
	[31956249]={ "43831", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_sur", "138783"},
	[44803100]={ "43986", "附魔葬禮瓦罐", "增加100點上古法力的上限", "", "default", "treasure_sur", "140326"},
	[26877073]={ "43987", "克托斯的研究筆記", "增加100點上古法力的上限", "在山洞內; 入口座標：27.29,72.87", "default", "treasure_sur", "140327"},
	
	[24393517]={ "44071", "白狼邁亞", "等級800 致命一擊/加速 背部", "", "skull_grey", "rare_sur", "139897"},
	[16532656]={ "43996", "影羽", "增加上古法力", "", "skull_grey", "rare_sur", "140401"},
	[13535344]={ "44124", "馬圖拉", "增加上古法力", "", "skull_grey", "rare_sur", "140949"},
	[18676104]={ "43542", "潮爪", "增加上古法力", "", "skull_grey", "rare_sur", "140399"},
	[36183381]={ "43718", "女總管哈嘉薩", "增加上古法力", "在山上的洞穴內; 從40.3,26.1上山", "skull_grey", "rare_sur", "140390"},
	[33781509]={ "43717", "工藝師洛薩爾", "增加上古法力", "", "skull_grey", "rare_sur", "140372"},
	[75525729]={ "44003", "暗礁之王磊吉斯", "等級800 加速/精通 手指", "在水中大範圍巡邏", "skull_grey", "rare_sur", "121801"},
	[80157000]={ "40680", "羅克納許", "等級800 致命一擊/加速 鎧甲 手腕（鎧甲職業掉落）", "在水底的峽谷巡邏", "skull_grey", "rare_sur", "140019"},
	[67677106]={ "41136", "貪得無厭的哈爾克斯", "增加神兵之力", "在山洞內; 入口座標：72.39,68.08", "skull_grey", "rare_sur", "140381"},
	[54435612]={ "43792", "戴葛倫", "等級800 敏捷 飾品（攻擊觸發範圍傷害）（皮甲/鎖甲職業掉落）", "", "skull_grey", "rare_sur", "121808"},
	[54806376]={ "43794", "德溫大使", "等級800 布甲 胸部（布甲職業掉落）", "", "skull_grey", "rare_sur", "139918"},
	[34176099]={ "43351", "『腐化者』瑪卓司", "增加神兵之力", "", "skull_grey", "rare_sur", "140386"},
	[62564808]={ "43495", "卡卓斯", "等級800 致命一擊/加速 鎖甲 頭部（鎖甲職業掉落）", "", "skull_grey", "rare_sur", "139969"},
	[61303970]={ "43993", "赫莎‧葛林多特", "等級800 加速/精通 鎖甲 腳（鎖甲職業掉落）", "在山洞內", "skull_grey", "rare_sur", "121737"},
	[68175896]={ "41135", "寇拉卡", "等級800 致命一擊/精通 皮甲 胸部（皮甲職業掉落）", "在山洞內; 入口座標：70,56.8", "skull_grey", "rare_sur", "139952"},
	[66656713]={ "43968", "捏刺", "玩具", "", "skull_grey", "rare_sur", "140314"},
	[40963282]={ "43358", "瑪雍尼斯", "等級800 致命一擊/加速 皮甲 手（皮甲職業掉落）", "", "skull_grey", "rare_sur", "121739"},
	[33705180]={ "43954", "安納克斯", "寵物", "", "skull_grey", "rare_sur","140934"},
	[26104077]={ "42831", "沙蘭", "等級800 加速/精通 布甲 手腕（布甲職業掉落）", "", "skull_grey", "rare_sur","139926"},
	[24574740]={ "43449", "邪惡的歐瑞斯", "增加神兵之力", "", "skull_grey", "rare_sur","140388"},
	[22135178]={ "41319", "精靈之禍", "等級800 精通 飾品 （攻擊觸發力量）（鎧甲職業掉落）", "", "skull_grey", "rare_sur","121806"},
	[87506230]={ "41786", "莫格拉許大王", "增加神兵之力", "點擊詹德維克旗幟並擊敗三波小怪後出現", "skull_grey", "rare_sur", "140384"},
	[38042278]={ "43369", "攻城大師艾德林", "增加上古法力", "", "skull_grey", "rare_sur", "140406"},
	[53193021]={ "40897", "加弗拉格", "等級800 致命一擊/精通 鎖甲 肩部（鎖甲職業掉落）", "在山洞內; 入口座標：49.5,33.9", "skull_grey", "rare_sur", "121755"},
	[42175641]={ "43580", "藥劑師法德倫", "等級800 致命一擊/精通 布甲 肩部（布甲職業掉落）", "", "skull_grey", "rare_sur", "121754"},
	[48505670]={ "40905", "斯崔馬中尉", "等級800 致命一擊/精通 鎧甲 腳（鎧甲職業掉落）", "在建築物內", "skull_grey", "rare_sur", "121735"},
	--[67065161]={ "99999", "Broodmother Shu'malis", "Order Resources", "marked as rare but seems to have no questID yet", "skull_grey", "rare_sur", "1220"},
	[27776547]={ "43992", "苟格羅斯", "等級800 致命一擊/加速 鎧甲 頭部（鎧甲職業掉落）", "點擊傳送門之鑰召喚他", "skull_grey", "rare_sur", "121747"},
	[62506369]={ "43793", "麥亞蘇", "等級800 加速 飾品（遠程攻擊觸發範圍傷害）（布甲職業掉落）", "", "skull_grey", "rare_sur", "121810"},
	[65575914]={ "43481", "秘法師萊蘭德", "增加上古法力", "", "skull_grey", "rare_sur", "140403"},
	[61015298]={ "43597", "守護者索艾爾", "增加上古法力", "沿著大道上巡邏", "skull_grey", "rare_sur", "140404"},
	[49607900]={ "43603", "藍迪爾", "增加神兵之力", "", "skull_grey", "rare_sur", "140396"},
	[24002550]={ "43484", "勞倫", "等級800 加速/精通 皮甲 腰部（皮甲職業掉落）", "", "skull_grey", "rare_sur", "121759"},
	[42108010]={ "43348", "博學者斐卓司", "增加上古法力", "", "skull_grey", "rare_sur", "140405"},
	[29395330]={ "44676", "洛里安", "等級800 致命一擊/加速 皮甲 腿部（皮甲職業掉落）", "在山洞內; 入口座標：29.29,50.71; 與洛里安對話並給他25點上古法力，再擊敗2次凋萎跛行者，最後拾取地上的寶藏", "skull_grey", "rare_sur", "141867"},
	[35236723]={ "44675", "瑞凡塔斯女士", "等級800 臨機應變/精通 布甲 手（布甲職業掉落）", "", "skull_grey", "rare_sur", "141866"},
}

nodes["Darkpens"] = {
	[42018849]={ "39085", "小型藏寶箱", "增加神兵之力", "在暗獄內; 入口座標：41.1,45.6", "default", "treasure_val","138783"},
	[50905168]={ "39086", "發光的藏寶箱", "增加神兵之力", "在暗獄內; 入口座標：41.1,45.6", "default", "treasure_val","138783"},
}

nodes["OceanusCove"] = {
	[69294839]={ "37649", "發光的藏寶箱", "增加神兵之力", "", "default", "treasure_azs", "138783"},
	[45346686]={ "42291", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_azs", "138783"},
}

nodes["BitestoneEnclave"] = {
	[85213787]={ "40489", "藏寶箱", "增加神兵之力", "", "default", "treasure_hmn", "138783"},
}

nodes["LifespringCavern"] = {
	[53102392]={ "40476", "發光的藏寶箱", "增加神兵之力", "", "default", "treasure_hmn", "138783"},
}

nodes["Helheim"] = {
	[85085031]={ "38461", "芬里", "精通 飾品 （攻擊觸發持續傷害）", "在山洞內", "skull_grey", "rare_sth", "129044"},
	[28186375]={ "39870", "靈魂渴噬者", "寵物", "在水中", "skull_grey", "rare_sth", "129188"},
	[79842471]={ "38510", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_sth", "138783"},
	[83322456]={ "38503", "藏寶箱", "增加神兵之力", "在水底的船內", "default", "treasure_sth", "138783"},
	[60845332]={ "38383", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_sth", "138783"},
	[19634698]={ "38516", "藏寶箱", "增加神兵之力", "", "default", "treasure_sth", "138783"},
}

nodes["ThunderTotem"] = {
	[13715555]={ "40491", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_hmn", "138783"},
	[63435929]={ "39531", "一個煽情的珠寶盒", "賣店垃圾", "在房子內", "default", "treasure_hmn", "141322"},
	[50667537]={ "40472", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_hmn", "138783"},
	[32354174]={ "40475", "小型藏寶箱", "增加神兵之力", "在船上", "default", "treasure_hmn", "138783"},
	[31843842]={ "44352", "藏寶箱", "增加神兵之力", "在水底的洞穴內", "default", "treasure_hmn", "138783"},
	[36800330]={ "40681", "斯坎", "致命一擊/加速 皮甲 腰部（皮甲職業掉落）", "", "skull_grey", "rare_hmn","131730"},
}

nodes["ThunderTotemInterior"] = {
	[62946793]={ "40471", "藏寶箱", "增加神兵之力", "", "default", "treasure_hmn", "138783"},
}

nodes["NeltharionsVault"] = {
	[63733725]={ "39606", "發光的藏寶箱", "增加神兵之力", "使用底層的泰坦甬道之門傳送到寶藏附近; 點擊高嶺火盆並擊殺兩次泰坦防衛者; 事件完成後寶藏會刷新在泰坦甬道之門附近", "default", "treasure_hmn", "138783"},
	[40215031]={ "40509", "藏寶箱", "增加神兵之力", "", "default", "treasure_hmn", "138783"},
	[60425458]={ "40508", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_hmn", "138783"},
}

nodes["SuramarLegionScar"] = {
	[40502903]={ "40902", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_sur", "138783"},
	[54573780]={ "43835", "小型藏寶箱", "增加神兵之力", "", "default", "treasure_sur", "138783"},
}

nodes["StonedarkGrotto"] = {
	[35987235]={ "40478", "藏寶箱", "增加神兵之力", "", "default", "treasure_hmn", "138783"},
}

nodes["MucksnoutDen"] = {
	[60592533]={ "40494", "藏寶箱", "增加神兵之力", "", "default", "treasure_hmn", "138783"},
}


nodes["MardumtheShatteredAbyss"] = {
	[34857020]={ "39970", "小型藏寶箱", "戰鬥增益物品", "在山洞內", "default", "treasure_dh", "129210"},
	[45017785]={ "39971", "小型藏寶箱", "精煉藥劑", "", "default", "treasure_dh", "129192"},
	[41763761]={ "40759", "小型藏寶箱", "治療藥水", "", "default", "treasure_dh", "129196"},
	[51135079]={ "40743", "小型藏寶箱", "戰鬥增益物品", "", "default", "treasure_dh", "129210"},
	[76243899]={ "40338", "小型藏寶箱", "戰鬥增益物品", "在山洞內; 入口座標：77.0,41.4", "default", "treasure_dh", "129210"},
	[82075043]={ "40820", "小型藏寶箱", "治療藥水", "", "default", "treasure_dh", "129196"},
	[78755047]={ "40274", "小型藏寶箱", "戰鬥增益物品", "在山洞內", "default", "treasure_dh", "129210"},
	[73494892]={ "39975", "小型藏寶箱", "28格背包", "", "default", "treasure_dh", "129195"},
	[42194916]={ "40223", "小型藏寶箱", "戰鬥增益物品", "在山洞內", "default", "treasure_dh", "129210"},
	[23065389]={ "40797", "小型藏寶箱", "戰鬥增益物品", "在山洞內; 入口座標：23.6,54.2", "default", "treasure_dh", "129210"},
	[66922767]={ "39974", "小型藏寶箱", "戰鬥增益物品", "在山洞內", "default", "treasure_dh", "129210"},
	[74285453]={ "39977", "小型藏寶箱", "戰鬥增益物品", "在山洞內; 入口座標：70.7,54.0", "default", "treasure_dh", "129210"},
	[69704240]={ "39976", "小型藏寶箱", "戰鬥增益物品", "", "default", "treasure_dh", "129210"},
	
	[68852759]={ "40234", "沃羅斯將軍", "等級680 手腕", "", "skull_grey", "rare_dh", "128947"},
	[81034124]={ "40233", "監督者布魯塔格", "等級680 飾品", "", "skull_grey", "rare_dh", "133580"},
	[74475731]={ "40232", "魔蛛王渥拉斯", "等級680 背部", "", "skull_grey", "rare_dh", "128944"},
}

nodes["CrypticHollow"] = {
	[48761530]={ "39972", "小型藏寶箱", "治療藥水", "", "default", "treasure_dh", "129196"},
	[54855845]={ "39973", "小型藏寶箱", "等級680 手指", "", "default", "treasure_dh", "128946"},
}

nodes["SoulEngine"] = {
	[50304964]={ "40772", "小型藏寶箱", "戰鬥增益物品", "在上層", "default", "treasure_dh", "129210"},
	[51235740]={ "40231", "惡毒伯爵", "等級680 手指", "在下層", "skull_grey", "rare_dh", "128948"},
}

nodes["VaultOfTheWardensDH"] = {
	[58693475]={ "40909", "小型藏寶箱", "戰鬥增益物品", "第一層", "default", "treasure_dh", "129210"},
	[47325464]={ "38690", "小型藏寶箱", "戰鬥增益物品", "第一層", "default", "treasure_dh", "129210"},
	[32104817]={ "40911", "小型藏寶箱", "治療藥水", "第二層", "default", "treasure_dh", "129196"},
	[41506361]={ "40914", "小型藏寶箱", "治療藥水", "第二層", "default", "treasure_dh", "129196"},
	[56994013]={ "40913", "小型藏寶箱", "戰鬥增益物品", "第二層", "default", "treasure_dh", "129210"},
	[41413287]={ "40912", "小型藏寶箱", "戰鬥增益物品", "第二層", "default", "treasure_dh", "129210"},
	[24421005]={ "40915", "小型藏寶箱", "戰鬥增益物品", "第三層", "default", "treasure_dh", "129210"},
	[23268157]={ "40916", "小型藏寶箱", "戰鬥增益物品", "第三層", "default", "treasure_dh", "129210"},
	
	[69202820]={ "40301", "憤怒領主雷寇斯", "等級680 飾品", "第一層", "skull_grey", "rare_dh", "128958"},
	[49543284]={ "40251", "克斯拉佐", "等級680 頸部", "第一層", "skull_grey", "rare_dh", "128945"},
}

nodes["StormDrakeDen"] = {
	[20134125]={ "38529", "藏寶箱", "增加神兵之力", "在山洞內; 入口座標：31.4,57.1", "default", "treasure_sth","138783"},
}

nodes["NarthalasAcademy"] = {
	[35525280]={ "43988", "易變地脈水晶", "增加100點上古法力的上限", "bottom floor", "default", "treasure_sur", "140328"},
	[38605414]={ "43838", "小型藏寶箱", "增加神兵之力", "在底層", "default", "treasure_sur", "138783"},
}

nodes["FalanaarTunnels"] = {
	[35513253]={ "43747", "閃爍的上古法力晶簇", "增加上古法力", "", "default", "treasure_sur", "139786"},
	[48644258]={ "43839", "小型藏寶箱", "增加神兵之力", "在蜘蛛網上", "default", "treasure_sur", "138783"},
}


if (PlayerFaction == "Alliance") then
	nodes["Stormheim"][44202296]={ "38630", "被遺忘者死亡小隊", "致命一擊/臨機應變 鎧甲 手（鎧甲職業掉落）", "", "skull_grey", "rare_sth", "129266"}
	nodes["Stormheim"][42015767]={ "38625", "鉤子跟瘦子", "致命一擊/精通 布甲 腰部", "", "skull_grey", "rare_sth", "129109"}
end

if (PlayerFaction == "Horde") then
	nodes["Stormheim"][44202296]={ "38627", "狼人潛獵者", "致命一擊/精通 鎧甲 手腕（鎧甲職業掉落）", "", "skull_grey", "rare_sth", "129264"}
	nodes["Stormheim"][47205710]={ "38712", "馴犬者伊萊", "加速/精通 布甲 腿部（布甲職業掉落）", "", "skull_grey", "rare_sth", "129037"}
end

local function GetItem(ID)
    if (ID == "1220") then
        local currency, _, _ = GetCurrencyInfo(ID)

        if (currency ~= nil) then
            return currency
        else
            return "Error loading CurrencyID"
        end
    else
        local _, item, _, _, _, _, _, _, _, _ = GetItemInfo(ID)

        if (item ~= nil) then
            return item
        else
            return "Error loading ItemID"
        end
    end
end 

local function GetIcon(ID)
    if (ID == "1220") then
        local _, _, icon = GetCurrencyInfo(ID)

        if (icon ~= nil) then
            return icon
        else
            return "Interface\\Icons\\inv_misc_questionmark"
        end
    else
        local _, _, _, _, _, _, _, _, _, icon = GetItemInfo(ID)

        if (icon ~= nil) then
            return icon
        else
            return "Interface\\Icons\\inv_misc_questionmark"
        end
    end
end

function LegionRaresTreasures:OnEnter(mapFile, coord)
    if (not nodes[mapFile][coord]) then return end
    
    local tooltip = self:GetParent() == WorldMapButton and WorldMapTooltip or GameTooltip

    if ( self:GetCenter() > UIParent:GetCenter() ) then
        tooltip:SetOwner(self, "ANCHOR_LEFT")
    else
        tooltip:SetOwner(self, "ANCHOR_RIGHT")
    end

    tooltip:SetText(nodes[mapFile][coord][2])
    if (nodes[mapFile][coord][3] ~= nil) and (LegionRaresTreasures.db.profile.show_loot == true) then
        if ((nodes[mapFile][coord][7] ~= nil) and (nodes[mapFile][coord][7] ~= "")) then
            tooltip:AddLine(("掉落：" .. GetItem(nodes[mapFile][coord][7])), nil, nil, nil, true)

            if ((nodes[mapFile][coord][3] ~= nil) and (nodes[mapFile][coord][3] ~= "")) then
                tooltip:AddLine(("掉落資訊：" .. nodes[mapFile][coord][3]), nil, nil, nil, true)
            end
        else
            tooltip:AddLine(("掉落：" .. nodes[mapFile][coord][3]), nil, nil, nil, true)
        end
    end

    if (nodes[mapFile][coord][4] ~= "") and (LegionRaresTreasures.db.profile.show_notes == true) then
     tooltip:AddLine(("註記：" .. nodes[mapFile][coord][4]), nil, nil, nil, true)
    end

    tooltip:Show()
end

local isMoving = false
local info = {}
local clickedMapFile = nil
local clickedCoord = nil

local function generateMenu(button, level)
    if (not level) then return end

    for k in pairs(info) do info[k] = nil end

    if (level == 1) then
        info.isTitle = 1
        info.text = "破碎群島寶藏"
        info.notCheckable = 1
        UIDropDownMenu_AddButton(info, level)
        
        info.disabled = nil
        info.isTitle = nil
        info.notCheckable = nil
        info.text = "從此地圖刪除此物件"
        info.func = LRTDisableTreasure
        info.arg1 = clickedMapFile
        info.arg2 = clickedCoord
        UIDropDownMenu_AddButton(info, level)
        
        if isTomTomloaded == true then
            info.text = "增加此位置到TomTom路徑點"
            info.func = LRTaddtoTomTom
            info.arg1 = clickedMapFile
            info.arg2 = clickedCoord
            UIDropDownMenu_AddButton(info, level)
        end

        if isDBMloaded == true then
            info.text = "為此位置增加DBM箭頭"
            info.func = LRTAddDBMArrow
            info.arg1 = clickedMapFile
            info.arg2 = clickedCoord
            UIDropDownMenu_AddButton(info, level)
            
            info.text = "隱藏DBM箭頭"
            info.func = LRTHideDBMArrow
            UIDropDownMenu_AddButton(info, level)
        end

        info.text = CLOSE
        info.func = function() CloseDropDownMenus() end
        info.arg1 = nil
        info.arg2 = nil
        info.notCheckable = 1
        UIDropDownMenu_AddButton(info, level)

        info.text = "恢復刪除的物件"
        info.func = LRTResetDB
        info.arg1 = nil
        info.arg2 = nil
        info.notCheckable = 1
        UIDropDownMenu_AddButton(info, level)
        
    end
end

local HandyNotes_LegionRaresTreasuresDropdownMenu = CreateFrame("Frame", "HandyNotes_LegionRaresTreasuresDropdownMenu")
HandyNotes_LegionRaresTreasuresDropdownMenu.displayMode = "MENU"
HandyNotes_LegionRaresTreasuresDropdownMenu.initialize = generateMenu

function LegionRaresTreasures:OnClick(button, down, mapFile, coord)
    if button == "RightButton" and down then
        clickedMapFile = mapFile
        clickedCoord = coord
        ToggleDropDownMenu(1, nil, HandyNotes_LegionRaresTreasuresDropdownMenu, self, 0, 0)
    end
end

function LegionRaresTreasures:OnLeave(mapFile, coord)
    if self:GetParent() == WorldMapButton then
        WorldMapTooltip:Hide()
    else
        GameTooltip:Hide()
    end
end

local options = {
    type = "group",
    name = "破碎群島寶藏",
    desc = "顯示破碎群島寶藏的位置",
    get = function(info) return LegionRaresTreasures.db.profile[info.arg] end,
    set = function(info, v) LegionRaresTreasures.db.profile[info.arg] = v; LegionRaresTreasures:Refresh() end,
    args = {
        desc = {
            name = "一般設定",
            type = "description",
            order = 0,
        },
        icon_scale_treasures = {
            type = "range",
            name = "寶藏圖示大小",
            desc = "圖示的大小",
            min = 0.25, max = 3, step = 0.01,
            arg = "icon_scale_treasures",
            order = 1,
        },
        icon_scale_rares = {
            type = "range",
            name = "稀有怪物圖示大小",
            desc = "圖示的大小",
            min = 0.25, max = 3, step = 0.01,
            arg = "icon_scale_rares",
            order = 2,
        },
        icon_alpha = {
            type = "range",
            name = "圖示透明度",
            desc = "圖示的透明度",
            min = 0, max = 1, step = 0.01,
            arg = "icon_alpha",
            order = 20,
        },
        VisibilityOptions = {
            type = "group",
            name = "可見性設定",
            desc = "可見性設定",
            args = {
                VisibilityGroup = {
                    type = "group",
                    order = 0,
                    name = "選擇哪些區域要顯示什麼:",
                    inline = true,
                    args = {
                        groupAZS = {
                            type = "header",
                            name = "艾蘇納",
                            desc = "Azsuna",
                            order = 0,
                        },
                        treasureAZS = {
                            type = "toggle",
                            arg = "treasure_azs",
                            name = "寶藏",
                            desc = "給予大廳資源，增加隨機（10/20/35點）神兵之力和賣店垃圾物品的寶藏",
                            order = 1,
                            width = "normal",
                        },
                        rareAZS = {
                            type = "toggle",
                            arg = "rare_azs",
                            name = "稀有怪物",
                            desc = "首次擊殺給予大廳資源，增加20神兵之力（機率掉落）和裝備（根據護甲類型給予掉落）的稀有怪物",
                            order = 2,
                            width = "normal",
                        },
                        groupVAL = {
                            type = "header",
                            name = "維爾薩拉",
                            desc = "Val'Sharah",
                            order = 10,
                        },  
                        treasureVAL = {
                            type = "toggle",
                            arg = "treasure_val",
                            name = "寶藏",
                            desc = "給予大廳資源，增加隨機（10/20/35點）神兵之力和賣店垃圾物品的寶藏",
                            width = "normal",
                            order = 11,
                        },
                        rareVAL = {
                            type = "toggle",
                            arg = "rare_val",
                            name = "稀有怪物",
                            desc = "首次擊殺給予大廳資源，增加20神兵之力（機率掉落）和裝備（根據護甲類型給予掉落）的稀有怪物",
                            width = "normal",
                            order = 12,
                        },
                        groupHMN = {
                            type = "header",
                            name = "高嶺",
                            desc = "Highmountain",
                            order = 20,
                        },  
                        treasureHMN = {
                            type = "toggle",
                            arg = "treasure_hmn",
                            name = "寶藏",
                            desc = "給予大廳資源，增加隨機（10/20/35點）神兵之力和賣店垃圾物品的寶藏",
                            width = "normal",
                            order = 21,
                        },
                        rareHMN = {
                            type = "toggle",
                            arg = "rare_hmn",
                            name = "稀有怪物",
                            desc = "首次擊殺給予大廳資源，增加20神兵之力（機率掉落）和裝備（根據護甲類型給予掉落）的稀有怪物",
                            width = "normal",
                            order = 22,
                        },  
                        groupSTH = {
                            type = "header",
                            name = "斯鐸海姆",
                            desc = "Stormheim",
                            order = 30,
                        },  
                        treasureSTH = {
                            type = "toggle",
                            arg = "treasure_sth",
                            name = "寶藏",
                            desc = "給予大廳資源，增加隨機（10/20/35點）神兵之力和賣店垃圾物品的寶藏",
                            width = "normal",
                            order = 31,
                        },
                        rareSTH = {
                            type = "toggle",
                            arg = "rare_sth",
                            name = "稀有怪物",
                            desc = "首次擊殺給予大廳資源，增加20神兵之力（機率掉落）和裝備（根據護甲類型給予掉落）的稀有怪物",
                            width = "normal",
                            order = 32,
                        },  
                        groupSUR = {
                            type = "header",
                            name = "蘇拉瑪爾",
                            desc = "Suramar",
                            order = 40,
                        },    
                        treasureSUR = {
                            type = "toggle",
                            arg = "treasure_sur",
                            name = "寶藏",
                            desc = "給予上古法力，大廳資源，增加隨機（10/20/35點）神兵之力和賣店垃圾物品的寶藏",
                            width = "normal",
                            order = 41,
                        },
                        rareSUR = {
                            type = "toggle",
                            arg = "rare_sur",
                            name = "稀有怪物",
                            desc = "首次擊殺給予大廳資源，增加20神兵之力（機率掉落）和裝備（根據護甲類型給予掉落）的稀有怪物",
                            width = "normal",
                            order = 42,
                        },
						groupDH = {
                            type = "header",
                            name = "惡魔獵人",
                            desc = "惡魔獵人專屬區域",
                            order = 50,
                        },    
                        treasureDH = {
                            type = "toggle",
                            arg = "treasure_dh",
                            name = "寶藏",
                            desc = "給各種物品的寶藏",
                            width = "normal",
                            order = 51,
                        },
                        rareDH = {
                            type = "toggle",
                            arg = "rare_dh",
                            name = "稀有怪物",
                            desc = "適合升級中玩家的稀有怪物",
                            width = "normal",
                            order = 52,
                        },  						
                    },
                },
                alwaysshowrares = {
                    type = "toggle",
                    arg = "alwaysshowrares",
                    name = "仍然顯示已經擊殺的稀有怪物",
                    desc = "顯示每個稀有不論拾取狀態",
                    order = 100,
                    width = "full",
                },
                alwaysshowtreasures = {
                    type = "toggle",
                    arg = "alwaysshowtreasures",
                    name = "仍然顯示已經擊殺的寶藏",
                    desc = "顯示每個寶藏不論拾取狀態",
                    order = 101,
                    width = "full",
                },
                show_loot = {
                    type = "toggle",
                    arg = "show_loot",
                    name = "顯示掉落",
                    desc = "顯示每個寶藏/稀有怪物的掉落",
                    order = 102,
                },
                show_notes = {
                    type = "toggle",
                    arg = "show_notes",
                    name = "顯示註記",
                    desc = "顯示每個寶藏/稀有怪物的註記如果可用的話",
                    order = 103,
                },
            },
        },
    },
}

function LegionRaresTreasures:OnInitialize()
    local defaults = {
        profile = {
            icon_scale_treasures = 1.5,
            icon_scale_rares = 2.0,
            icon_alpha = 1.00,
            alwaysshowrares = false,
            alwaysshowtreasures = false,
            save = true,
            treasure_azs = true,
            treasure_val = true,
            treasure_hmn = true,
            treasure_sth = true,
            treasure_sur = true,
			treasure_dh = true,
            rare_azs = true,
            rare_val = true,
            rare_hmn = true,
			rare_sth = true,
            rare_sur = true,
			rare_dh = true,
            show_loot = true,
            show_notes = true,
        },
    }

    self.db = LibStub("AceDB-3.0"):New("LegionRaresTreasuresDB", defaults, "Default")
    self:RegisterEvent("PLAYER_ENTERING_WORLD", "WorldEnter")
end

function LegionRaresTreasures:WorldEnter()
    self:UnregisterEvent("PLAYER_ENTERING_WORLD")
	self:ScheduleTimer("QuestCheck", 5)
    self:ScheduleTimer("RegisterWithHandyNotes", 8)
	self:ScheduleTimer("LoadCheck", 6)
end

function LegionRaresTreasures:QuestCheck()
    do
		if (IsQuestFlaggedCompleted(41246)) then
			nodes["Highmountain"][52556638]={ "42453", "藏寶箱", "增加神兵之力", "需要完成高嶺的任務線才能看見", "default", "treasure_hmn", "138783"}
		end
    end
end

function LegionRaresTreasures:RegisterWithHandyNotes()
    do
        local function iter(t, prestate)
            if not t then return nil end

            local state, value = next(t, prestate)

            while state do

                -- QuestID[1], Name[2], Loot[3], Notes[4], Icon[5], Tag[6], ItemID[7]
                if (value[1] and self.db.profile[value[6]] and not LegionRaresTreasures:HasBeenLooted(value)) then
                    if ((value[7] ~= nil) and (value[7] ~= "")) then
                        GetIcon(value[7]) --this should precache the Item, so that the loot is correctly returned
                    end

                    if ((value[5] == "default") or (value[5] == "unknown")) then
                        if ((value[7] ~= nil) and (value[7] ~= "")) then
                            return state, nil, GetIcon(value[7]), LegionRaresTreasures.db.profile.icon_scale_treasures, LegionRaresTreasures.db.profile.icon_alpha
                        else
                            return state, nil, iconDefaults[value[5]], LegionRaresTreasures.db.profile.icon_scale_treasures, LegionRaresTreasures.db.profile.icon_alpha
                        end
                    end

                    return state, nil, iconDefaults[value[5]], LegionRaresTreasures.db.profile.icon_scale_rares, LegionRaresTreasures.db.profile.icon_alpha
                end

                state, value = next(t, state)
            end
        end

        function LegionRaresTreasures:GetNodes(mapFile, isMinimapUpdate, dungeonLevel)
            return iter, nodes[mapFile], nil
        end
    end

    HandyNotes:RegisterPluginDB("LegionRaresTreasures", self, options)
    self:RegisterBucketEvent({ "LOOT_CLOSED" }, 2, "Refresh")
    self:Refresh()
end
 
function LegionRaresTreasures:Refresh()
    self:SendMessage("HandyNotes_NotifyUpdate", "LegionRaresTreasures")
end

function LRTResetDB()
    table.wipe(LegionRaresTreasures.db.char)
    LegionRaresTreasures:Refresh()
end

function LegionRaresTreasures:HasBeenLooted(value)
    if (self.db.profile.alwaysshowtreasures and (string.find(value[6], "treasure") ~= nil)) then return false end
    if (self.db.profile.alwaysshowrares and (string.find(value[6], "treasure") == nil)) then return false end
    if (LegionRaresTreasures.db.char[value[1]] and self.db.profile.save) then return true end
    if (IsQuestFlaggedCompleted(value[1])) then
        return true
    end

    return false
end

function LRTDisableTreasure(button, mapFile, coord)
    if (nodes[mapFile][coord][1] ~= nil) then
        LegionRaresTreasures.db.char[nodes[mapFile][coord][1]] = true;
    end

    LegionRaresTreasures:Refresh()
end

function LRTaddtoTomTom(button, mapFile, coord)
    if isTomTomloaded == true then
        local mapId = HandyNotes:GetMapFiletoMapID(mapFile)
        local x, y = HandyNotes:getXY(coord)
        local desc = nodes[mapFile][coord][2];

        if (nodes[mapFile][coord][3] ~= nil) and (LegionRaresTreasures.db.profile.show_loot == true) then
            if ((nodes[mapFile][coord][7] ~= nil) and (nodes[mapFile][coord][7] ~= "")) then
                desc = desc.."\n掉落：" .. GetItem(nodes[mapFile][coord][7]);
                desc = desc.."\n掉落資訊：" .. nodes[mapFile][coord][3];
            else
                desc = desc.."\n掉落：" .. nodes[mapFile][coord][3];
            end
        end

        if (nodes[mapFile][coord][4] ~= "") and (LegionRaresTreasures.db.profile.show_notes == true) then
            desc = desc.."\n註記：" .. nodes[mapFile][coord][4]
        end

        TomTom:AddMFWaypoint(mapId, nil, x, y, {
            title = desc,
            persistent = nil,
            minimap = true,
            world = true
        })
    end
end

function LRTAddDBMArrow(button, mapFile, coord)
    if isDBMloaded == true then
        local mapId = HandyNotes:GetMapFiletoMapID(mapFile)
        local x, y = HandyNotes:getXY(coord)
        local desc = nodes[mapFile][coord][2];

        if (nodes[mapFile][coord][3] ~= nil) and (LegionRaresTreasures.db.profile.show_loot == true) then
            if ((nodes[mapFile][coord][7] ~= nil) and (nodes[mapFile][coord][7] ~= "")) then
                desc = desc.."\n掉落：" .. GetItem(nodes[mapFile][coord][7]);
                desc = desc.."\n掉落資訊：" .. nodes[mapFile][coord][3];
            else
                desc = desc.."\n掉落：" .. nodes[mapFile][coord][3];
            end
        end

        if (nodes[mapFile][coord][4] ~= "") and (LegionRaresTreasures.db.profile.show_notes == true) then
            desc = desc.."\n註記：" .. nodes[mapFile][coord][4]
        end

        if not DBMArrow.Desc:IsShown() then
            DBMArrow.Desc:Show()
        end

        x = x*100
        y = y*100
        DBMArrow.Desc:SetText(desc)
        DBM.Arrow:ShowRunTo(x, y, nil, nil, true)
    end
end

function LRTHideDBMArrow()
    DBM.Arrow:Hide(true)
end

function LegionRaresTreasures:LoadCheck()
	if (IsAddOnLoaded("TomTom")) then 
		isTomTomloaded = true
	end

	if (IsAddOnLoaded("DBM-Core")) then 
		isDBMloaded = true
	end

	if isDBMloaded == true then
		local ArrowDesc = DBMArrow:CreateFontString(nil, "OVERLAY", "GameTooltipText")
		ArrowDesc:SetWidth(400)
		ArrowDesc:SetHeight(100)
		ArrowDesc:SetPoint("CENTER", DBMArrow, "CENTER", 0, -35)
		ArrowDesc:SetTextColor(1, 1, 1, 1)
		ArrowDesc:SetJustifyH("CENTER")
		DBMArrow.Desc = ArrowDesc
	end
end
