----- AUTO GENERATED - DO NOT EDIT

if GetLocale() ~= "ruRU" then
    return
end

loadstring([[
BtWQuestsDatabase:UpdateQuestsTable({
    [90759] = {
        name = "Внутренний культ",
    },
    [90760] = {
        name = "Избежать осуждения",
    },
    [90761] = {
        name = "Избежать осуждения",
    },
    [90762] = {
        name = "Сумеречное нагорье",
    },
    [90763] = {
        name = "Сумеречное нагорье",
    },
    [90764] = {
        name = "Внутренний культ",
    },
    [90765] = {
        name = "Полуночное одеяние",
    },
    [90766] = {
        name = "Верный последователь Ксал'атат",
    },
    [90767] = {
        name = "Больше рока",
    },
    [90768] = {
        name = "Покончить с культом",
    },
    [92630] = {
        name = "Преследование продолжается",
    },
    [92631] = {
        name = "Ужасная добыча",
    },
    [92632] = {
        name = "Воздающее правосудие",
    },
})
]])()
